/******************************************************************************
**
** filename:     hal_config.h
** copyright:    
** description:  该模块主要实现功能配置
**
-------------------------------------------------------------------------------
**             Revision history
**-----------------------------------------------------------------------------
**| 2014/03/09 | 叶德焰 |  创建文件
*******************************************************************************/
#ifndef HAL_CONFIG_H
#define HAL_CONFIG_H         1


/*
********************************************************************************
* define config parameters
********************************************************************************
*/
#define EN_I2C_SIMU          1

#define EN_DEBUG             0
#define UART_COM_DEBUG       UART_COM_1


#if EN_DEBUG > 0
#define DEBUG_SYS            1
#define DEBUG_ERR            1

#else
#define DEBUG_SYS            0
#define DEBUG_ERR            0

#endif


#endif

/*****END OF FILE****/
