/******************************************************************************
**
** filename:     os_bsp.c
** copyright:    
** description:  该模块主要实现板载接口实现
**
-------------------------------------------------------------------------------
**             Revision history
**-----------------------------------------------------------------------------
**| 2014/03/09 | 叶德焰 |  创建文件
*******************************************************************************/
#include "os_include.h"
#include "os_timer.h"
#include "stm32f10x.h"
#include "stm32f10x_conf.h"
#include "st_irq_drv.h"

/*
********************************************************************************
* define config parameters
********************************************************************************
*/

/*
********************************************************************************
* define struct
********************************************************************************
*/



/*
********************************************************************************
* define module variants
********************************************************************************
*/


/*******************************************************************
* 函数名称:  SystickIntProc
* 函数描述:  定时器中断处理函数
* 参数:      无
* 返回:      无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) void SysTickHandler(void)
{
	 g_systicks++;
}

/*******************************************************************
* 函数名称:  OS_SysTickStartup
* 函数描述:  启动硬件定时器
* 参数:      无
* 返回:      无
********************************************************************/
void OS_SysTickStartup(void)
{
    INT32U tick;
    RCC_ClocksTypeDef RCC_Clocks;
    
    RCC_GetClocksFreq(&RCC_Clocks);  
    ST_IRQ_ConfigIrqPriority(SysTick_IRQn, IRQ_PRIOTITY_SYSTICK);               /* 配置中断优先级 */
    ST_IRQ_InstallIrqHandler(SysTick_IRQn, (IRQ_SERVICE_FUNC)SysTickHandler);
    tick = ((RCC_Clocks.SYSCLK_Frequency / 1000) * PERTICK);
    SysTick_Config(tick);  
    
}

/*******************************************************************
* 函数名称:  OS_GetSysTick
* 函数描述:  获得系统tick
* 参数:      无
* 返回:      tick
********************************************************************/
INT32U OS_GetSysTick(INT32U * count)
{
    count[0] = g_systicks;
    return g_systicks;
}


/*************END OF FILE****/

