/********************************************************************************
**
** 文件名:     man_error.c
** 版权所有:   (c) 2014-2020 厦门雅迅网络股份有限公司
** 文件描述:   系统出错相关管理模块
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2010/12/30 | LEON   | 创建本模块
**
*********************************************************************************/
#include "dal_include.h"
#include "man_error.h"
#include "dal_pinlist.h"
#include "debug_print.h"

/*******************************************************************
** 函数名:     SysErrorExit
** 函数描述:   系统出错处理退出函数
** 参数:       [in] file: 出错的文件名
**             [in] line: 出错的行数
** 返回:       无
********************************************************************/
void SysErrorExit(INT8U *file, INT32U line)
{
  #if EN_DEBUG < 1

    Debug_SysPrint("Sorry, System Assert Fail...!\r\nFile: %s\r\nLine: %d\r\n", file, line);

    for (;;) {
        ;
    }

  #else

    for (;;) {                                                                  /* 此处可加入闪灯或其他机制提示用户 */
        //GPIO_WriteBit(WORK_LED, Bit_SET);
    }

    #endif
}

