/********************************************************************************
**
** 文件名:     at_drv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现手机模块驱动管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/06/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef AT_DRV_H
#define AT_DRV_H             1


#include "at_power.h"
#include "at_com.h"
#include "at_recv.h"
#include "at_send.h"
#include "at_core.h"

#include "at_urc_common.h"
#include "at_urc_phone.h"
#include "at_urc_sms.h"
#include "at_urc_tcpip.h"

#include "at_cmd_common.h"
#include "at_cmd_sms.h"
#include "at_cmd_phone.h"
#include "at_cmd_tcpip.h"

#include "at_q_set.h"
#include "at_q_sms.h"
#include "at_q_tcpip.h"
#include "at_q_phone.h"
 
#include "at_other.h"
#include "at_gprs_drv.h"
#include "at_socket_drv.h"
#include "at_pdu.h"




/*******************************************************************
** 函数名:     AT_DRV_Init
** 函数描述:   初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void AT_DRV_Init(void);

/*******************************************************************
** 函数名:     AT_DRV_Open
** 函数描述:   打开驱动功能
** 参数:       无
** 返回:       无
********************************************************************/
void AT_DRV_Open(void);

/*******************************************************************
** 函数名:     AT_DRV_Close
** 函数描述:   关闭驱动功能
** 参数:       无
** 返回:       无
********************************************************************/
void AT_DRV_Close(void);



#endif
