/****************************************************************
**                                                              *
**  FILE         :  AT_SET.H                                    *
**  COPYRIGHT    :  (c) 2001 .Xiamen Yaxon NetWork CO.LTD       *
**                                                              *
**                                                              *
**  By : CCH 2003.11.2                                          *
****************************************************************/
#ifndef AT_OTHER_H
#define AT_OTHER_H           1

/*******************************************************************
** 函数名:     AT_OTHER_Init
** 函数描述:   AT指令初始化
** 参数:      无
** 返回:       无
********************************************************************/
void AT_OTHER_Init(void);

/*******************************************************************
** 函数名:     AT_OTHER_Entry
** 函数描述:   AT指令执行入口
** 参数:      无
** 返回:       无
********************************************************************/
void AT_OTHER_Entry(void);

/*******************************************************************
** 函数名:     AT_OTHER_HaveTsk
** 函数描述:   AT指令执行入口
** 参数:      无
** 返回:       有AT指令返回true，无返回false
********************************************************************/
BOOLEAN AT_OTHER_HaveTsk(void);

/*******************************************************************
** 函数名:     AT_OTHER_PlayTts
** 函数描述:   启动TTS播放
** 参数:       [in] fp：       回调函数
**             [in] sptr：     数据指针
**             [in] len：      数据长度
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_OTHER_PlayTts(void (*fp)(INT8U), INT8U *sptr, INT16U len);

/*******************************************************************
** 函数名:     AT_OTHER_SetTtsPara
** 函数描述:   设置TTS播放参数
** 参数:       [in] fp：       回调函数
**             [in] volume：   音量
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_OTHER_SetTtsPara(void (*fp)(INT8U), INT8U volume);


#endif
