/********************************************************************************
**
** 文件名:     at_pdu_cdma.c
** 版权所有:   (c) 2014-2020 厦门雅迅网络股份有限公司
** 文件描述:   实现CDMA模块短消息在pdu模式下的解析和封装
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/04/03 | 叶德焰 |  创建该文件
**
*********************************************************************************/
#ifndef AT_PDU_CDMA_H
#define AT_PDU_CDMA_H        1


/*******************************************************************
** 函数名:     AT_SMS_ParseCdmaPduData
** 函数描述:   按照pdu格式解析接收到的短消息
** 参数:       [out] sm:                存放解析后的短消息
**             [in]  pdubuf:            存放接收到pdu格式内容数据
**             [in]  pdusize:           pdu格式内容数据长度
** 返回:       true:  解析成功
**             false: 解析失败
********************************************************************/
BOOLEAN AT_SMS_ParseCdmaPduData(SM_T *sm, INT8U *pdubuf, INT16U pdusize);

/*******************************************************************
** 函数名:     AT_SMS_AssembleCdmaPduData
** 函数描述:   按照pdu格式要求对待发送的短消息进行组帧
** 参数:       [out] dptr:              返回存放组帧后的pdu格式数据的缓冲区
**             [in]  dcs:               短消息编码格式
**             [in]  telptr:            接收方手机号码
**             [in]  tellen:            接收方手机号码长度
**             [in]  dataptr:           短消息内容缓冲区
**             [in]  datalen:           短消息内容长度
** 返回:       组帧后的数据长度; 如组帧失败, 则返回0
********************************************************************/
INT16U AT_SMS_AssembleCdmaPduData(INT8U **dptr, SM_DCS_E dcs, INT8U *telptr, INT8U tellen, const INT8U *dataptr, INT8U datalen);




#endif
