/********************************************************************************
**
** 文件名:     at_q_set.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现手机模块通用设置指令发送队列管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/06/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef AT_Q_SET_H
#define AT_Q_SET_H           1



/*******************************************************************
** 函数名:     AT_Q_InitSet
** 函数描述:   初始化模块
** 参数:       无
** 返回:       无
********************************************************************/
void AT_Q_InitSet(void);

/*******************************************************************
** 函数名:     AT_Q_SetSendEntry
** 函数描述:   发送入口
** 参数:       无
** 返回:       无
********************************************************************/
void AT_Q_SetSendEntry(void);

/*******************************************************************
** 函数名:     AT_Q_ClearSetQueue
** 函数描述:   清除设置指令队列
** 参数:       无
** 返回:       无
********************************************************************/
void AT_Q_ClearSetQueue(void);

/*******************************************************************
** 函数名:     AT_Q_ListSm
** 函数描述:   列取所有短信
** 参数:       无
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_ListSm(void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     AT_Q_ReadSmByIndex
** 函数描述:   根据索引号读取短信
** 参数:       [in] index：索引号
**             [in] fp：   回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_ReadSmByIndex(INT16U index, void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     AT_Q_DelSmByIndex
** 函数描述:   根根据索引号删除短信
** 参数:       [in] index：索引号
**             [in] fp：   回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_DelSmByIndex(INT16U index, void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     AT_Q_SetIMEI
** 函数描述:   设置IMEI
** 参数:       [in] imei：   IMEI
**             [in] imeilen：IMEI长度
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SetIMEI(INT8U *imei, INT8U imeilen);

/*******************************************************************
** 函数名:     AT_Q_SetCfun
** 函数描述:   设置CFUN
** 参数:       [in] fun：  功能号
**             [in] fp：   回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SetCfun(INT8U fun, void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     AT_Q_GetSmscTel
** 函数描述:   获取短信服务中心号码
** 参数:       [in] index：索引号
**             [in] fp：   回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_GetSmscTel(void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     AT_Q_SetSmscTel
** 函数描述:   设置短信服务中心号码
** 参数:       [in] tel:    号码指针, ASCII码
**             [in] tellen: 号码长度
**             [in] fp：    回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SetSmscTel(INT8U *tel, INT8U tellen, void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     SetQsclk
** 函数描述:   设置省电工作模式
** 参数:       [in] enable: 1-省电使能，0-正常工作模式
**             [in] fp：    回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN SetQsclk(INT8U enable, void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     SetQsclk
** 函数描述:   设置省电工作模式
** 参数:       [in] enable: 1-省电使能，0-正常工作模式
**             [in] fp：    回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN SetQsclk(INT8U enable, void (*fp)(INT8U));

/*******************************************************************
** 函数名:     SetQeng
** 函数描述:   设置基站信息
** 参数:       [in] enable: 1-开启，0-关闭
**             [in] fp：    回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN SetQeng(INT8U enable, void (*fp)(INT8U));

/*******************************************************************
** 函数名:     QueryQeng
** 函数描述:   查询基站信息
** 参数:       [in] fp：    回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN QueryQeng(void (*fp)(INT8U));

#endif
