/********************************************************************************
**
** 文件名:     at_q_tcpip.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现手机模块TCP/IP指令发送队列管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/06/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef AT_Q_TCPIP_H
#define AT_Q_TCPIP_H         1

#if EN_AT > 0

/*******************************************************************
** 函数名:     AT_Q_InitTcpip
** 函数描述:   初始化模块
** 参数:       无
** 返回:       无
********************************************************************/
void AT_Q_InitTcpip(void);

/*******************************************************************
** 函数名:     AT_Q_TcpipSendEntry
** 函数描述:   发送入口
** 参数:       无
** 返回:       无
********************************************************************/
void AT_Q_TcpipSendEntry(void);

/*******************************************************************
** 函数名:     AT_Q_ClearTcpipQueue
** 函数描述:   清除TCPIP指令队列
** 参数:       无
** 返回:       无
********************************************************************/
void AT_Q_ClearTcpipQueue(void);

/*******************************************************************
** 函数名:     AT_Q_SetAuthentication
** 函数描述:   启动任务并设置APN 
** 参数:       [in] fp：       回调函数
**             [in] profileid: 参数组号
**             [in] apn:       APN，以'\0'未结束符
**	           [in] username:  用户名，以'\0'未结束符
**	           [in] password:  密码，以'\0'未结束符
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SetAuthentication(void (*fp)(INT8U result), INT8U profileid, char *apn, char *username, char *password);

/*******************************************************************
** 函数名:     AT_Q_ActivePDPContext
** 函数描述:   激活移动场景
** 参数:       [in] fp：       回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_ActivePDPContext(void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     AT_Q_DeactivePDPContext
** 函数描述:   关闭移动场景,去活GPRS上下文
** 参数:       [in] fp：       回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_DeactivePDPContext(void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     AT_Q_GetLocalIp
** 函数描述:   获得本地IP地址
** 参数:       [in] fp：       回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_GetLocalIp(void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     AT_Q_SocketConnect
** 函数描述:   socket连接
** 参数:       [in] fp：       回调函数
**             [in] ch：       socket通道
**             [in] type：     socket类型，见SOCKET_TYPE_E
**             [in] ip：       ip地址
**             [in] port：     端口
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SocketConnect(void (*fp)(INT8U result), INT8U ch, INT8U type, char *ip, INT16U port);

/*******************************************************************
** 函数名:     AT_Q_SocketClose
** 函数描述:   socket关闭
** 参数:       [in] fp：       回调函数
**             [in] ch：       socket通道
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SocketClose(void (*fp)(INT8U result), INT8U ch);

/*******************************************************************
** 函数名:     AT_Q_QuerySocketStatus
** 函数描述:   查询socket连接状态
** 参数:       [in] fp：       回调函数
**             [in] ch：       socket通道
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_QuerySocketStatus(void (*fp)(INT8U result), INT8U ch);

/*******************************************************************
** 函数名:     AT_Q_SetMultiSocket
** 函数描述:   设置多路IP
** 参数:       [in] fp：       回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SetMultiSocket(void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     AT_Q_GetIpByDomainName
** 函数描述:   根据域名获取IP地址
** 参数:       [in] fp：        回调函数
**             [in] domainname：域名
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_GetIpByDomainName(void (*fp)(INT8U result), char *domainname);

/*******************************************************************
** 函数名:     AT_Q_SetDNS
** 函数描述:   设置域名解析服务器地址
** 参数:       [in] fp：    回调函数
**             [in] pri_ip：主服务器IP
**             [in] sec_ip：次服务器IP
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SetDNS(void (*fp)(INT8U result), char *pri_ip, char *sec_ip);

#endif
#endif
