/********************************************************************************
**
** 文件名:     at_q_phone.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现手机模块电话指令发送队列管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/06/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef AT_Q_PHONE_H
#define AT_Q_PHONE_H         1



/* 语音通道 */
typedef enum {
	AUDIO_CHANNEL_NORMAL = 0,/* 普通通道 */
	AUDIO_CHANNEL_HEADSET,   /* 耳机 */
	AUDIO_CHANNEL_FREE,      /* 免提 */
	AUDIO_CHANNEL_TTS,       /* 文语转换 */
	AUDIO_CHANNEL_LISTEN,    /* 监听通道 */
	AUDIO_CHANNEL_AUDIO,     /* 音频通道 */
	AUDIO_CHANNEL_MAX
} AUDIO_CHANNEL_E;

#if EN_AT_PHONE > 0

/*******************************************************************
** 函数名:     AT_Q_InitPhone
** 函数描述:   初始化模块
** 参数:       无
** 返回:       无
********************************************************************/
void AT_Q_InitPhone(void);

/*******************************************************************
** 函数名:     AT_Q_PhoneSendEntry
** 函数描述:   发送入口
** 参数:       无
** 返回:       无
********************************************************************/
void AT_Q_PhoneSendEntry(void);

/*******************************************************************
** 函数名:     AT_Q_ClearPhoneQueue
** 函数描述:   清除电话指令队列
** 参数:       无
** 返回:       无
********************************************************************/
void AT_Q_ClearPhoneQueue(void);

/*******************************************************************
** 函数名:     AT_Q_SendHangupCmd
** 函数描述:   发送挂机指令
** 参数:       [in] fp：       回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SendHangupCmd(void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     AT_Q_SendPickupCmd
** 函数描述:   发送摘机指令
** 参数:       [in] fp：       回调函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SendPickupCmd(void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     AT_Q_SendRingupCmd
** 函数描述:   发送拨打电话指令
** 参数:       [in] fp：       回调函数
**             [in] datamode： 拨号模式,TRUE-数据拨号,FASLE-常规电话
**             [in] tel：      电话号码
**             [in] tellen：   电话号码长度
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SendRingupCmd(void (*fp)(INT8U result), BOOLEAN datamode, INT8U *tel, INT8U tellen);

/*******************************************************************
** 函数名:     AT_Q_SendDtmf
** 函数描述:   发送拨打电话指令
** 参数:       [in] dtmf：     DTMF字符
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SendDtmf(char dtmf);

/*******************************************************************
** 函数名:     AT_Q_SendDtmf
** 函数描述:   发送拨打电话指令
** 参数:       [in] dtmf：     DTMF字符
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_QueryPhoneStatus(void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     AT_Q_SelectAudioChannel
** 函数描述:   选择话音通道
** 参数:       [in] ch: 通道号，见AUDIO_CHANNEL_E
** 返回:       成功或失败
********************************************************************/
BOOLEAN AT_Q_SelectAudioChannel(INT8U ch);

/*******************************************************************
** 函数名:     AT_Q_SetSpeakerLevel
** 函数描述:   设置喇叭音量
** 参数:       [in] ch:    通道号，见AUDIO_CHANNEL_E
**             [in] gain:  喇叭音量等级
** 返回:       成功或失败
********************************************************************/
BOOLEAN AT_Q_SetSpeakerLevel(INT8U ch, INT8U gain);

/*******************************************************************
** 函数名:     AT_Q_SetMicLevel
** 函数描述:   设置Mic增益
** 参数:       [in] ch:   通道号，见AUDIO_CHANNEL_E
**             [in] gain: MIC增益
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SetMicLevel(INT8U ch, INT32U gain);

/*******************************************************************
** 函数名:     AT_Q_SetEchoCancel
** 函数描述:   设置回音抑制参数
** 参数:       [in] ch:   通道号，见AUDIO_CHANNEL_E
**             [in] gain: 回音抑制参数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SetEchoCancel(INT8U ch, INT32U echo);

/*******************************************************************
** 函数名:     AT_Q_SetSideTone
** 函数描述:   设置侧音增益参数
** 参数:       [in] ch:   通道号，见AUDIO_CHANNEL_E
**             [in] gain: 参数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN AT_Q_SetSideTone(INT8U ch, INT32U gain);

#endif
#endif
