/********************************************************************************
**
** 文件名:     at_recv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现手机模块数据接收解析处理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/06/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef AT_RECV_H
#define AT_RECV_H            1


#if EN_AT > 0


#define EVT_RESET            0
#define EVT_OVERTIME         1
#define EVT_NORMAL           2

/* URC消息处理器接口体 */
typedef struct {
    char const  *keyword;
    INT8U        overtime;
    INT8U        fromhead;
    INT8U      (*handler)(INT8U ct_recv, INT8U event, INT8U *sptr, INT16U slen);
} URC_HDL_TBL_T;

/*******************************************************************
** 函数名:     AT_RECV_Init
** 函数描述:   初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void AT_RECV_Init(void);

/*******************************************************************
** 函数名:     AT_RECV_Open
** 函数描述:   打开模块数据接收解析功能
** 参数:       无
** 返回:       无
********************************************************************/
void AT_RECV_Open(void);

/*******************************************************************
** 函数名:     AT_RECV_Close
** 函数描述:   关闭模块数据接收解析功能
** 参数:       无
** 返回:       无
********************************************************************/
void AT_RECV_Close(void);

/*******************************************************************
** 函数名:     AT_RECV_Reset
** 函数描述:   复位接收状态
** 参数:       无
** 返回:       无
********************************************************************/
void AT_RECV_Reset(void);

/*******************************************************************
** 函数名:     AT_RECV_RegistUrcHandler
** 函数描述:   注册URC消息接收处理器
** 参数:       [in] type:   协议类型
**             [in] handler:协议处理函数
** 返回:       注册成功返回true，注册失败返回false
********************************************************************/
BOOLEAN AT_RECV_RegistUrcHandler(URC_HDL_TBL_T *tbl);


#endif
#endif

