/********************************************************************************
**
** 文件名:     at_socket_drv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现SOCKET驱动管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/03/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef AT_SOCKET_DRV_H
#define AT_SOCKET_DRV_H     1


#if EN_AT > 0
#include "at_urc_tcpip.h"

/* SOCKET类型 */
typedef enum {
    SOCKET_TYPE_STREAM = 0,  /* 数据流类型，TCP */
    SOCKET_TYPE_DATAGRAM,    /* 数据报类型，UDP */
    SOCKET_TYPE_SMS,         /* 短消息类型，SMS */
    SOCKET_TYPE_RAW,         /* 原始数据类型，RAW */
    SOCKET_TYPE_MAX
} SOCKET_TYPE_E;






/*******************************************************************
** 函数名:     AT_SOCKET_InitDrv
** 函数描述:   初始化SOCKET网络
** 参数:       无
** 返回:       无
********************************************************************/
void AT_SOCKET_InitDrv(void);

/*******************************************************************
** 函数名:     AT_SOCKET_RegistHandler
** 函数描述:   注册SOCKET消息处理器
** 参数:       [in]  callback: 注册回调函数参数
** 返回:       成功返回TRUE, 失败返回FALSE
********************************************************************/
BOOLEAN AT_SOCKET_RegistHandler(SOCKET_CALLBACK_T *callback);

/*******************************************************************
** 函数名:     AT_SOCKET_ClearDataBySocket
** 函数描述:   根据socket编号，清除通道数据
** 参数:       [in] socketid:   socket编号
** 返回:       无
********************************************************************/
void AT_SOCKET_ClearDataBySocket(INT8U socketid);

/*******************************************************************
** 函数名:     AT_SOCKET_CloseAllSocket
** 函数描述:   关闭通道数据，并清除通道数据
** 参数:       无
** 返回:       无
********************************************************************/
void AT_SOCKET_CloseAllSocket(void);

/*******************************************************************
** 函数名:     AT_SOCKET_SocketIsClosed
** 函数描述:   判断socket是否已关闭
** 参数:       [in] socketid:  sock编号
** 返回:       是返回true,否返回false
********************************************************************/
BOOLEAN AT_SOCKET_SocketIsClosed(INT8U socketid);

/*******************************************************************
** 函数名:     AT_SOCKET_SocketConnect
** 函数描述:   连接sock
** 参数:       [in]  socketid:  sock编号
**             [in]  socket_type:SOCKET类型,见SOCKET_TYPE_E
**             [in]  host_ip:   主机ip地址,依次从从高位到低位
**             [in]  host_port: 主机端口
** 返回:       0表示连接成功；
**            -1表示阻塞中，等待callback回调；
**            -2表示参数有误；
**            -3其他错误
********************************************************************/
INT32S AT_SOCKET_SocketConnect(INT8U socketid, INT8U socket_type, char *host_ip, INT16U host_port);

/*******************************************************************
** 函数名:     AT_SOCKET_SocketClose
** 函数描述:   关闭sock
** 参数:       [in]  socketid:  sock编号
** 返回:       0表示关闭成功；
**            -1表示阻塞中，等待callback回调；
**            -2表示参数有误；
**            -3其他错误
********************************************************************/
INT32S AT_SOCKET_SocketClose(INT8U socketid);

/*******************************************************************
** 函数名:     AT_SOCKET_SocketSend
** 函数描述:   通过sock发送数据
** 参数:       [in]  socketid:  sock编号
**             [in]  sptr:      待发送数据缓冲区
**             [in]  len:       待发送数据长度
** 返回:      -1表示阻塞中，等待callback回调
**            -2表示链路可能已断开，需要close
**            >0表示实际已发送的数据长度
********************************************************************/
INT32S AT_SOCKET_SocketSend(INT8U socketid, INT8U *sptr, INT32U len);

/*******************************************************************
** 函数名:     AT_SOCKET_SocketRecv
** 函数描述:   从sock上接收数据
** 参数:       [in]  socketid:  sock编号
**             [out] dptr:      接收数据缓冲区
**             [in]  maxlen:    接收数据缓冲区长度
** 返回:       -1:表示阻塞中，无数据，等待callback回调
**             -2:表示服务器关闭socket，需要close
**             -3:表示链路可能已断开，需要close
**             >0:实际接收的数据长度
********************************************************************/
INT32S AT_SOCKET_SocketRecv(INT8U socketid, INT8U *dptr, INT32U maxlen);

/*******************************************************************
** 名称: AT_SOCKET_UdpSend
*  描述: udp数据发送接口
** 参数:       [in]  socketid:  sock编号
**             [in]  host_ip:   服务器IP地址
**             [in]  host_port: 服务器端口号
**			   [in]	 localport:	本地端口号
**             [in]  sptr:      待发送数据
**             [in]  len:       待发送数据长度
** 返回:      -1表示阻塞中，等待callback回调
**            -2表示发送失败
**             0表示发送成功
*******************************************************************/
INT32S AT_SOCKET_UdpSend(INT8U socketid, char *host_ip, INT16U host_port, INT16U localport, INT8U *sptr, INT32U len);

/*******************************************************************
** 函数名:     AT_SOCKET_UdpRecv
** 函数描述:   UDP数据报接收
** 参数:       [in]  socketid:  sock编号
**             [out] dptr:      接收数据缓冲区
**             [in]  maxlen:    接收数据缓冲区最大长度
** 返回:       -1:表示阻塞中，无数据，等待callback回调
**             -2:接收失败
**             >0:实际接收的数据长度
********************************************************************/
INT32S AT_SOCKET_UdpRecv(INT32S socketid, INT8U *dptr, INT32U maxlen);

/*******************************************************************
** 函数名:     AT_SOCKET_SendEntry
** 函数描述:   发送socket数据入口函数
** 参数:       无
** 返回:       无
********************************************************************/
void AT_SOCKET_SendEntry(void);

/*******************************************************************
** 函数名:     AT_SOCKET_HaveTask
** 函数描述:   是否AT需要发送
** 参数:       无
** 返回:       有返回true，否则返回false
********************************************************************/
BOOLEAN AT_SOCKET_HaveTask(void);

#endif
#endif
