/********************************************************************************
**
** 文件名:     at_urc_sms.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现手机模块短消息数据接收解析处理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/06/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef AT_URC_SMS_H
#define AT_URC_SMS_H         1


#if EN_AT > 0

#include "at_pdu.h"

/* SMS消息回调通知 */
typedef struct {
    void (*callback_recvsmindex)(INT16U index);
    void (*callback_recvsm)(SM_T *sm);
} AT_SMS_CALLBACK_T;




/*******************************************************************
** 函数名:     AT_URC_InitSms
** 函数描述:   初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void AT_URC_InitSms(void);

/*******************************************************************
** 函数名:     AT_URC_RegistSmsHandler
** 函数描述:   注册短消息接收处理器
** 参数:       [in] callback:   消息处理器
** 返回:       注册成功返回true，注册失败返回false
********************************************************************/
BOOLEAN AT_URC_RegistSmsHandler(AT_SMS_CALLBACK_T *callback);


#endif
#endif

