/********************************************************************************
**
** 文件名:     at_urc_phone.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现手机模块电话消息接收解析处理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/06/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef AT_URC_PHONE_H
#define AT_URC_PHONE_H       1


#if EN_AT > 0

#include "at_pdu.h"

/* PHONE消息回调通知 */
typedef struct {
    void (*callback_ring)(void *id, char *tel);
    void (*callback_connect)(void *id);
    void (*callback_disconnect)(void *id);
} AT_PHONE_CALLBACK_T;




/*******************************************************************
** 函数名:     AT_URC_InitPhone
** 函数描述:   初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void AT_URC_InitPhone(void);

/*******************************************************************
** 函数名:     AT_URC_RegistPhoneHandler
** 函数描述:   注册电话消息接收处理器
** 参数:       [in] callback:   消息处理器
** 返回:       注册成功返回true，注册失败返回false
********************************************************************/
BOOLEAN AT_URC_RegistPhoneHandler(AT_PHONE_CALLBACK_T *callback);


#endif
#endif

