/******************************************************************************
**
** Filename:     yx_dym_cfg.h
** Copyright:    
** Description:  该模块主要实现动态内存注册信息管理
**
-------------------------------------------------------------------------------
**             Revision history
**-----------------------------------------------------------------------------
**| 2014/03/09 | 叶德焰 |  创建文件
*******************************************************************************/
#ifndef YX_DYM_CFG_H
#define YX_DYM_CFG_H             1


#include "yx_list.h"
/*
********************************************************************************
* define struct
********************************************************************************
*/
typedef struct {
    INT32U ct_over;          /* 计算时间 */
    INT16U maxtime;          /* 超时时间 */
    INT8U useflag;           /* 使用标志 */
    INT8U type;              /* 内存类型 */
    INT8U startflag;         /* 起始标志 */
} DYM_HEAD_T;

typedef struct {
    INT8U    type;           /* 统一的动态内存池类型编号 */
    INT32U   datasize;       /* 该类型动态内存单个内存数据区长度 */
    INT32U   totalsize;      /* 该类型动态内存单个内存包括头等总长度 */
    INT16U   maxnum;         /* 该类型动态内存池个数 */
    INT8U    *memptr;        /* 该类型动态内存池起始指针 */
    LIST_T   *freelist;      /* 空闲链表 */
    LIST_T   *usedlist;      /* 使用链表 */
    char     *label;         /* 该类型动态内存池标签 */
} DYM_POOL_T;



/*
********************************************************************************
* 定义动态内存类型数
********************************************************************************
*/
#ifdef DYM_CFG
#undef DYM_CFG
#endif

#define DYM_CFG(_DYM_TYPE_, _NUM_, _SIZE_, _LABEL_) \
              _DYM_TYPE_,


typedef enum {
    #include "yx_dym_cfg.reg"
    DYM_TYPE_MAX
} DYM_TYPE_E;


/*-------------------------------------------------------------------
** 函数名:     YX_DYM_GetRegPoolInfo
** 函数描述:   获取内存池注册信息
** 参数:       [in] type: 内存池类型
** 返回:       注册信息表指针
-------------------------------------------------------------------*/
DYM_POOL_T const *YX_DYM_GetRegPoolInfo(INT8U type);

/*-------------------------------------------------------------------
** 函数名:     YX_DYM_GetRegPoolNum
** 函数描述:   内存池注册信息个数
** 参数:       无
** 返回:       注册信息个数
-------------------------------------------------------------------*/
INT8U YX_DYM_GetRegPoolNum(void);

#endif
