/********************************************************************************
**
** 文件名:     yx_heapmem.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现堆内存管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/06/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef YX_HEAPMEM_H
#define YX_HEAPMEM_H         1


#define SIZE_HEAP_MEM        (8 * 1024)         /* 内存池大小 */


typedef struct memquery_t {
    INT32U occupysize;                                     /* 已经使用的内存大小 */
    INT32U blocks;                                         /* 内存块数量 */
} HEAPMEM_STATISTICS_T;



/*******************************************************************
** 函数名:     YX_HEAPMEM_Init
** 函数描述:   初始化堆内存管理模块
** 参数:       无
** 返回:       无
********************************************************************/
void YX_HEAPMEM_Init(void);

/*******************************************************************
** 函数名:     YX_HEAPMEM_Alloc
** 函数描述:   申请分配内存接口
** 参数:       [in] datalen: 申请内存的长度
**             [in] overtime:内存使用时间，单位：秒
**             [in] file:    申请内存的文件名
**             [in] line:    申请内存的行号
** 返回:       成功返回内存指针，失败返回0
********************************************************************/
void *HEAPMEM_Alloc(INT32U datalen, INT16U overtime, char *file, INT32U line);

/*******************************************************************
** 函数名:     YX_HEAPMEM_Free
** 函数描述:   释放内存接口
** 参数:       [in] sptr: 释放内存的地址
**             [in] file: 申请内存的文件名
**             [in] line: 申请内存的行号
** 返回:       无
********************************************************************/
void HEAPMEM_Free(void *sptr, char *file, INT32U line);


/*******************************************************************
** 函数名:     YX_HEAPMEM_GetStatistics
** 函数描述:   查询内存池当前使用状态接口
** 参数:       无
** 返回:       成功返回返回统计信息，失败返回0
********************************************************************/
HEAPMEM_STATISTICS_T *YX_HEAPMEM_GetStatistics(void);

/*******************************************************************
** 函数名:     YX_HEAPMEM_GetAddress
** 函数描述:   获取内存块首地址
** 参数:       无
** 返回:       内存块首地址
********************************************************************/
INT8U *YX_HEAPMEM_GetAddress(void);

#endif 
