/******************************************************************************
**
** Filename:     yx_list.h
** Copyright:    
** Description:  该模块主要链表管理
**
-------------------------------------------------------------------------------
**             Revision history
**-----------------------------------------------------------------------------
**| 2014/03/09 | 叶德焰 |  创建文件
*******************************************************************************/
#ifndef YX_LIST_H
#define YX_LIST_H

/*
********************************************************************************
* define struct
********************************************************************************
*/
typedef struct listnode {
    struct listnode *priv;
    struct listnode *next;
} NODE_T;

typedef struct {
    INT32U   inum;
    NODE_T  *head;
    NODE_T  *tail;
} LIST_T;



/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_GetNodeNum
** 函数描述:   获取链表节点个数
** 参数:       [in]  plist: 链表指针
** 返回:       返回链表结点个数
-------------------------------------------------------------------*/
INT32U YX_LIST_GetNodeNum(LIST_T *plist);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_GetListHead
** 函数描述:   获取链表头节点
** 参数:       [in]  plist: 链表指针
** 返回:       链表头节点; 如链表无节点, 则返回0
-------------------------------------------------------------------*/
INT8U *YX_LIST_GetListHead(LIST_T *plist);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_GetListTail
** 函数描述:   获取链表尾节点
** 参数:       [in]  plist: 链表指针
** 返回:       链表尾节点; 如链表无节点, 则返回0
-------------------------------------------------------------------*/
INT8U *YX_LIST_GetListTail(LIST_T *plist);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_GetNextEle
** 函数描述:   获取指定节点的下一个节点
** 参数:       [in]  pnode: 链表当前节点
** 返回:       返回下一个节点指针; 无结点返回0
-------------------------------------------------------------------*/
INT8U *YX_LIST_GetNextEle(INT8U *pnode);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_GetPrivEle
** 函数描述:   获取指定节点的前一个节点
** 参数:       [in]  pnode: 链表当前节点
** 返回:       返回前一节点指针; 无结点返回0
-------------------------------------------------------------------*/
INT8U *YX_LIST_GetPrivEle(INT8U *pnode);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_DeleListEle
** 函数描述:   删除指定节点，并返回下一个结点指针
** 参数:       [in]  plist: 链表指针
** 参数:       [in]  pnode: 链表当前节点
** 返回:       返回下一个节点指针; 无结点返回0
-------------------------------------------------------------------*/
INT8U *YX_LIST_DeleListEle(LIST_T *plist, INT8U *pnode);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_DeleListHead
** 函数描述:   删除链表头节点,返回头结点指针
** 参数:       [in]  plist: 链表指针
** 返回:       返回链表头节点指针; 无结点返回0
-------------------------------------------------------------------*/
INT8U *YX_LIST_DeleListHead(LIST_T *plist);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_DeleListTail
** 函数描述:   删除链表尾节点,返回链表尾结点指针
** 参数:       [in]  plist: 链表指针
** 返回:       返回链表尾节点指针; 无结点返回0
-------------------------------------------------------------------*/
INT8U *YX_LIST_DeleListTail(LIST_T *plist);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_AppendListEle
** 函数描述:   将新增节点插在链表尾
** 参数:       [in]  plist: 链表指针
**             [in]  pnode: 待挂接节点
** 返回:       成功返回true,失败返回false
-------------------------------------------------------------------*/
BOOLEAN YX_LIST_AppendListEle(LIST_T *plist, INT8U *pnode);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_InsertListHead
** 函数描述:   将新增结点插在链表头
** 参数:       [in]  plist: 链表指针
**             [in]  pnode: 新增节点
** 返回:       插入成功或失败
-------------------------------------------------------------------*/
BOOLEAN YX_LIST_InsertListHead(LIST_T *plist, INT8U *pnode);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_InsertNodeBefore
** 函数描述:   在指定节点前插入一个新节点
** 参数:       [in]  plist: 链表指针
**             [in]  cnode: 指定节点
**             [in]  dnode: 新增节点
** 返回:       成功返回true,失败返回false
-------------------------------------------------------------------*/
BOOLEAN YX_LIST_InsertNodeBefore(LIST_T *plist, INT8U *cnode, INT8U *dnode);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_InsertNodeAfter
** 函数描述:   在指定节点后插入一个新节点
** 参数:       [in]  plist: 链表指针
**             [in]  cnode: 指定节点
**             [in]  dnode: 新增节点
** 返回:       插入成功或失败
-------------------------------------------------------------------*/
BOOLEAN YX_LIST_InsertNodeAfter(LIST_T *plist, INT8U *cnode, INT8U *dnode);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_Init
** 函数描述:   初始化链表
** 参数:       [in]  plist: 链表指针
** 返回:       成功返回,失败返回false
-------------------------------------------------------------------*/
BOOLEAN YX_LIST_Init(LIST_T *plist);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_CreateList
** 参数:       [in]  plist:   链表指针
**             [in]  nodeptr: 节点首地址
**             [in]  nodenum: 节点个数
**             [in]  nodesize:节点大小
** 返回:       成功返回true,失败返回false
-------------------------------------------------------------------*/
BOOLEAN YX_LIST_CreateList(LIST_T *plist, INT8U *nodeptr, INT32U nodenum, INT32U nodesize);

/*-------------------------------------------------------------------
** 函数名称:   YX_LIST_CheckError
** 函数描述:   检测链表的有效性
** 参数:       [in]  plist: 链表指针
**             [in]  bptr:  最小地址
**             [in]  eptr:  最大地址
** 返回:       有效返回true,无效返回false
-------------------------------------------------------------------*/
BOOLEAN YX_LIST_CheckError(LIST_T *plist, void *bptr, void *eptr);



#endif
