/******************************************************************************
**
** Filename:     yx_loopbuf.h
** Copyright:    
** Description:  该模块主要实现环形缓冲区管理
**
-------------------------------------------------------------------------------
**             Revision history
**-----------------------------------------------------------------------------
**| 2014/03/09 | 叶德焰 |  创建文件
*******************************************************************************/
#ifndef OS_LOOPBUF_H
#define OS_LOOPBUF_H


/*
********************************************************************************
* define config parameters
********************************************************************************
*/

/*
********************************************************************************
* define struct
********************************************************************************
*/
typedef struct {
    INT32U  memsize;
    INT32U  used;
    INT8U  *bptr;
    INT8U  *eptr;
    INT8U  *wptr;
    INT8U  *rptr;
} LOOP_BUF_T;

/*-------------------------------------------------------------------
** 函数名称:   YX_InitLoopBuffer
** 函数描述:   初始化循环缓冲区
** 参数:       [in]  loop:    循环缓冲区管理结构体
**             [in]  memptr:  缓冲区首地址
**             [in]  memsize: 缓冲区长度
** 返回:       无
-------------------------------------------------------------------*/
void YX_InitLoopBuffer(LOOP_BUF_T *loop, INT8U *memptr, INT32U memsize);

/*-------------------------------------------------------------------
** 函数名称:   YX_ClearLoopBuffer
** 函数描述:   恢复缓冲区为初始化状态
** 参数:       [in]  loop:    循环缓冲区管理结构体
** 返回:       无
-------------------------------------------------------------------*/
void YX_ClearLoopBuffer(LOOP_BUF_T *loop);

/*-------------------------------------------------------------------
** 函数名称:   YX_GetLoopBufferStartPtr
** 函数描述:   获取循环缓冲区首地址
** 参数:       [in]  loop:    循环缓冲区管理结构体
** 返回:       循环缓冲区首地址
-------------------------------------------------------------------*/
INT8U *YX_GetLoopBufferStartPtr(LOOP_BUF_T *loop);

/*-------------------------------------------------------------------
** 函数名称:   YX_WriteLoopBuffer
** 函数描述:   往循环缓冲区中写入一个字节的数据
** 参数:       [in]  loop:   循环缓冲区管理结构体
**             [in]  indata: 字节数据
** 返回:       成功返回true,失败返回false
-------------------------------------------------------------------*/
BOOLEAN YX_WriteLoopBuffer(LOOP_BUF_T *loop, INT8U indata);

/*-------------------------------------------------------------------
** 函数名称:   YX_WriteLoopBuffer_INT
** 函数描述:   往循环缓冲区中写入一个字节的数据,无中断保护
** 参数:       [in]  loop:   循环缓冲区管理结构体
**             [in]  indata: 字节数据
** 返回:       成功返回true,失败返回false
-------------------------------------------------------------------*/
BOOLEAN YX_WriteLoopBuffer_INT(LOOP_BUF_T *loop, INT8U indata);

/*-------------------------------------------------------------------
** 函数名称:   YX_WriteBlockLoopBuffer
** 函数描述:   写入一串数据到环形缓冲区
** 参数:       [in]  loop:    循环缓冲区管理结构体
**             [in]  bptr:    数据块的指针
**             [in] len:      数据块的字节数
** 返回:       成功返回true, 失败返回false
-------------------------------------------------------------------*/
BOOLEAN YX_WriteBlockLoopBuffer(LOOP_BUF_T *loop, INT8U *bptr, INT32U len);

/*-------------------------------------------------------------------
** 函数名称:   YX_WriteBlockLoopBuffer_INT
** 函数描述:   写入一串数据到环形缓冲区,无中断保护
** 参数:       [in]  loop:    循环缓冲区管理结构体
**             [in]  bptr:    数据块的指针
**             [in] len:      数据块的字节数
** 返回:       成功返回true, 失败返回false
-------------------------------------------------------------------*/
BOOLEAN YX_WriteBlockLoopBuffer_INT(LOOP_BUF_T *loop, INT8U *bptr, INT32U len);

/*-------------------------------------------------------------------
** 函数名称:   YX_ReadLoopBuffer
** 函数描述:   从循环缓冲区中读取一个字节的数据
** 参数:       [in]  loop:    循环缓冲区管理结构体
** 返回:       成功返回数据值,失败返回-1
-------------------------------------------------------------------*/
INT32S YX_ReadLoopBuffer(LOOP_BUF_T *loop);

/*-------------------------------------------------------------------
** 函数名称:   YX_ReadLoopBuffer_INT
** 函数描述:   从循环缓冲区中读取一个字节的数据,无中断保护
** 参数:       [in]  loop:    循环缓冲区管理结构体
** 返回:       成功返回数据值,失败返回-1
-------------------------------------------------------------------*/
INT32S YX_ReadLoopBuffer_INT(LOOP_BUF_T *loop);

/*-------------------------------------------------------------------
** 函数名称:   YX_LeftOfLoopBuffer
** 函数描述:   获取循环缓冲区中剩余的空间
** 参数:       [in]  loop:    循环缓冲区管理结构体
** 返回:       剩余空间字节数
-------------------------------------------------------------------*/
INT32U YX_LeftOfLoopBuffer(LOOP_BUF_T *loop);

/*-------------------------------------------------------------------
** 函数名称:   YX_UsedOfLoopBuffer
** 函数描述:   获取循环缓冲区中已使用空间
** 参数:       [in]  loop:    循环缓冲区管理结构体
** 返回:       已使用空间字节数
-------------------------------------------------------------------*/
INT32U YX_UsedOfLoopBuffer(LOOP_BUF_T *loop);


#endif

