/********************************************************************************
**
** 文件名:     yx_stream.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   实现数据流管理功能
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/04/11 | 叶德焰 |  创建该文件
*********************************************************************************/
#ifndef YX_STREAM_H
#define YX_STREAM_H          1


/* 数据流控制结构体 */
typedef struct {
    INT8U  *startptr;
    INT8U  *curptr;
    INT32U  len;
    INT32U  maxlen;
} STREAM_T;


/*******************************************************************
** 函数名:     YX_InitStrm
** 函数描述:   初始化数据流
** 参数:       [in]  sp:              数据流
**             [in]  bp:              数据流所管理内存地址
**             [in]  maxlen:          数据流所管理内存字节数
** 返回:       成功或失败
********************************************************************/
BOOLEAN YX_InitStrm(STREAM_T *sp, void *bp, INT32U maxlen);

/*******************************************************************
** 函数名:     YX_GetStrmLeftLen
** 函数描述:   获取数据流中剩余的可用字节数
** 参数:       [in]  sp:              数据流
** 返回:       数据流剩余的可用字节数
********************************************************************/
INT32U YX_GetStrmLeftLen(STREAM_T *sp);

/*******************************************************************
** 函数名:     YX_GetStrmLen
** 函数描述:   获取数据流中已用字节数
** 参数:       [in]  sp:              数据流
** 返回:       数据流已用字节数
********************************************************************/
INT32U YX_GetStrmLen(STREAM_T *sp);

/*******************************************************************
** 函数名:     YX_GetStrmMaxLen
** 函数描述:   获取数据流缓存总长度
** 参数:       [in]  sp:              数据流
** 返回:       数据流的最大长度
********************************************************************/
INT32U YX_GetStrmMaxLen(STREAM_T *sp);

/*******************************************************************
** 函数名:     YX_GetStrmPtr
** 函数描述:   获取数据流当前读/写指针
** 参数:       [in]  sp:              数据流
** 返回:       当前读/写指针
********************************************************************/
void *YX_GetStrmPtr(STREAM_T *sp);

/*******************************************************************
** 函数名:     YX_GetStrmStartPtr
** 函数描述:   获取数据流所管理内存的地址
** 参数:       [in]  sp:              数据流
** 返回:       所管理内存地址
********************************************************************/
void *YX_GetStrmStartPtr(STREAM_T *sp);

/*******************************************************************
** 函数名:     YX_MovStrmPtr
** 函数描述:   移动数据流中读/写指针
** 参数:       [in]  sp:              数据流
**             [in]  len:             移动字节数
** 返回:       无
********************************************************************/
void YX_MovStrmPtr(STREAM_T *sp, INT32U len);

/*******************************************************************
** 函数名:     YX_WriteBYTE_Strm
** 函数描述:   往数据流中写入一个字节数据
** 参数:       [in]  sp:              数据流
**             [in]  writebyte:       写入的数据
** 返回:       无
********************************************************************/
void YX_WriteBYTE_Strm(STREAM_T *sp, INT8U writebyte);

/*******************************************************************
** 函数名:     YX_WriteHWORD_Strm
** 函数描述:   往数据流中写入一个半字(16位)数据, 大端模式(高字节先写，低字节后写)
** 参数:       [in]  sp:              数据流
**             [in]  writeword:       写入的数据
** 返回:       无
********************************************************************/
void YX_WriteHWORD_Strm(STREAM_T *sp, INT16U writeword);

/*******************************************************************
** 函数名:     YX_LE_WriteHWORD_Strm
** 函数描述:   往数据流中写入一个半字(16位)数据, 小端模式(低字节先写，高字节后写)
** 参数:       [in]  sp:              数据流
**             [in]  writeword:       写入的数据
** 返回:       无
********************************************************************/
void YX_LE_WriteHWORD_Strm(STREAM_T *sp, INT16U writeword);

/*******************************************************************
** 函数名:     YX_WriteLONG_Strm
** 函数描述:   往数据流中写入一个半字(32位)数据, 大端模式(高字节先写，低字节后写)
** 参数:       [in]  sp:              数据流
**             [in]  writeword:       写入的数据
** 返回:       无
********************************************************************/
void YX_WriteLONG_Strm(STREAM_T *sp, INT32U writelong);

/*******************************************************************
** 函数名:     YX_LE_WriteLONG_Strm
** 函数描述:   往数据流中写入一个半字(32位)数据, 小端模式(低字节先写，高字节后写)
** 参数:       [in]  sp:              数据流
**             [in]  writeword:       写入的数据
** 返回:       无
********************************************************************/
void YX_LE_WriteLONG_Strm(STREAM_T *sp, INT32U writelong);

/*******************************************************************
** 函数名:     YX_WriteLF_Strm
** 函数描述:   往数据流中写入换行符, 即写入'\r'和'\n'
** 参数:       [in]  sp:              数据流
** 返回:       无
********************************************************************/
void YX_WriteLF_Strm(STREAM_T *sp);

/*******************************************************************
** 函数名:     YX_WriteCR_Strm
** 函数描述:   往数据流中写入回车符, 即写入'\r''
** 参数:       [in]  sp:              数据流
** 返回:       无
********************************************************************/
void YX_WriteCR_Strm(STREAM_T *sp);

/*******************************************************************
** 函数名:     YX_WriteSTR_Strm
** 函数描述:   往数据流中写入字符串
** 参数:       [in]  sp:              数据流
**             [in]  ptr:             写入的字符串指针
** 返回:       无
********************************************************************/
void YX_WriteSTR_Strm(STREAM_T *sp, char *ptr);

/*******************************************************************
** 函数名:     YX_WriteDATA_Strm
** 函数描述:   往数据流中写入一块内存数据
** 参数:       [in]  sp:              数据流
**             [in]  ptr:             写入的数据块地址
**             [in]  len:             写入的数据块字节数
** 返回:       无
********************************************************************/
void YX_WriteDATA_Strm(STREAM_T *sp, INT8U *ptr, INT32U len);

/*******************************************************************
** 函数名:     YX_ReadBYTE_Strm
** 函数描述:   从数据流中读取一个字节
** 参数:       [in]  sp:              数据流
** 返回:       读取到的字节
********************************************************************/
INT8U YX_ReadBYTE_Strm(STREAM_T *sp);

/*******************************************************************
** 函数名:     YX_ReadHWORD_Strm
** 函数描述:   从数据流中读取一个半字(16位)数据,大端模式(先读为高字节，后读为低字节)
** 参数:       [in]  sp:              数据流
** 返回:       读取到的字
********************************************************************/
INT16U YX_ReadHWORD_Strm(STREAM_T *sp);

/*******************************************************************
** 函数名:     YX_LE_ReadHWORD_Strm
** 函数描述:   从数据流中读取一个半字(16位)数据,小端模式(先读为低字节，后读为高字节)
** 参数:       [in]  sp:              数据流
** 返回:       读取到的字
********************************************************************/
INT16U YX_LE_ReadHWORD_Strm(STREAM_T *sp);

/*******************************************************************
** 函数名:     YX_ReadLONG_Strm
** 函数描述:   从数据流中读取一个半字(32位)数据,大端模式(先读为高字节，后读为低字节)
** 参数:       [in]  sp:              数据流
** 返回:       读取到的字
********************************************************************/
INT32U YX_ReadLONG_Strm(STREAM_T *sp);

/*******************************************************************
** 函数名:     YX_LE_ReadLONG_Strm
** 函数描述:   从数据流中读取一个半字(32位)数据,小端模式(先读为低字节，后读为高字节)
** 参数:       [in]  sp:              数据流
** 返回:       读取到的字
********************************************************************/
INT32U YX_LE_ReadLONG_Strm(STREAM_T *sp);

/*******************************************************************
** 函数名:     YX_ReadDATA_Strm
** 函数描述:   从数据流中读取指定长度的数据内容
** 参数:       [in]  sp:              数据流
**             [out] ptr:             读取到的数据存放的内存地址
**             [in]  len:             读取的数据长度
** 返回:       无
********************************************************************/
void YX_ReadDATA_Strm(STREAM_T *sp, INT8U *ptr, INT32U len);

/*******************************************************************
** 函数名:     YX_STREAM_GetBufferStream
** 函数描述:   获取流缓存，目前流缓存最大为2000字节
**             备注：本接口用于需要暂时需要缓存地方，如各类外设组帧发送，注意不要冲突使用
** 参数:       无
** 返回:       放回流指针
********************************************************************/
STREAM_T *YX_STREAM_GetBufferStream(void);

#endif
