#if 0
/********************************************************************************
**
** 文件名:     dal_pp_reg.c
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现公共参数文件存储驱动注册信息表管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2017/06/07 | 谢金成 |  移植修改
********************************************************************************/
#ifndef __BAL__PP_REG_H__
#define __BAL__PP_REG_H__	1

#include "bal_pp_misc.h"

/* 公共参数信息结构体 */
typedef struct {
    INT8U        id;                       /* 公共参数统一编号 */
    INT16U       ppsize;                   /* 参数长度 */
    void const  *i_ptr;                    /* 默认参数指针 */
} PP_REG_T;

/*
********************************************************************************
* 定义所有数据库文件统一编号
********************************************************************************
*/
#ifdef PP_DEF
#undef PP_DEF
#endif

#define PP_DEF(_PP_ID_, _LEN_, _I_PTR_) \
               _PP_ID_,

typedef enum {
    #include "bal_pp_reg.def"
    PP_ID_MAX
} PP_ID_E;

/*******************************************************************
** 函数名:     bal_pp_GetRegInfo
** 函数描述:   获取对应公共参数的注册信息
** 参数:       [in] id:统一编号的参数编号，见PP_ID_E
** 返回:       成功返回注册表指针，失败返回0
********************************************************************/
PP_REG_T const *bal_pp_GetRegInfo(INT8U id);

/*******************************************************************
*   函数名:    bal_pp_GetRegPPMax
*   功能描述:  获取已注册的公共参数个数
*　 参数:      无
*   返回值:    个数
*******************************************************************/
INT8U bal_pp_GetRegPPMax(void);

#endif
#endif


