#if 0
/********************************************************************************
**
** 文件名:     bal_pp_misc.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现公共参数结构体定义和参数定义
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2017/06/07 | 谢金成 |  删减
*********************************************************************************/
#ifndef __BAL_PP_MISC_H__
#define __BAL_PP_MISC_H__   1

#include "yx_includes.h"
/*
********************************************************************************
*                        定义参数结构体
********************************************************************************
*/
typedef struct {
    BOOLEAN  is_cali;
    INT32S   calvalue_x; /* X轴标定值 */
    INT32S   calvalue_y; /* Y轴标定值 */
    INT32S   calvalue_z; /* Z轴标定值 */
    INT16U   setvalue_g; /* 加速度设置阈值 */
} AXISPARA_T;

/*
********************************************************************************
*                        Define Default PubParas
********************************************************************************
*/

static AXISPARA_T  		const i_axiscalconfig = {false, 2, -41, 997, 4000};

/*static LOCK_PARA        const i_LOCKPARA      = {false, 0x01, 0x01, 0x64, 0x18, {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}, ECU_FTIMMO };
static LOCKCARD         const i_LOCKCARD      = {false, 0x01, 0x01,  0xfffe,    0x00};
static LOCK_PARA2       const i_LOCKPARA2     = {0xfffe, {0x00, 0x00, 0x00, 0x00}};
static LC_CTRL_T        const i_LC_CTRL_T     = {{0, 0, 0, 0}, 0xfffe, 0, 0x00, 0x00, {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};*/


#endif
#endif
