/********************************************************************************
** 文件名:     port_can.h
** 版权所有:   (c) 2017 厦门雅迅网络股份有限公司
** 文件描述:   can收发器接口
** 创建人：        谢金成，2017.5.9
*********************************************************************************
**                  修改历史记录
**===============================================================================
**| 日期              | 作者        |  修改记录
**===============================================================================
**| 2017/05/12 | 黄运峰    |  代码规范化，修改优化
********************************************************************************/
#ifndef PORT_CAN_H
#define PORT_CAN_H          1

#include "Dal_can.h"
/*
********************************************************************************
*                           定义模块配置参数
********************************************************************************
*/

/********************************************************************************
**                          数据类型及宏定义
********************************************************************************/
//帧格式
#define FMAT_STD                    0  // 标准帧
#define FMAT_EXT                    1  // 扩展帧

// 帧类型
#define TYPE_DATA                   0  // 数据帧
#define TYPE_REMOTE                 1  // 远程帧

//波特率枚举
typedef enum {
	CAN_BAUD_10K,
	CAN_BAUD_20K,
	CAN_BAUD_50K,
	CAN_BAUD_100K,
	CAN_BAUD_125K,
	CAN_BAUD_250K,
	CAN_BAUD_500K,
	CAN_BAUD_1000K
} APPCAN_BAUD_E;

/* CAN编号 */
typedef enum {
	CAN_CHN_1 = 0,
	CAN_CHN_2,
	CAN_CHN_3,
	MAX_CAN_CHN
} CAN_CHN_E;

typedef struct {
	INT32U can_id;                      // CAN帧ID(标准帧或扩展帧)
	INT8U  can_IDE;                     // 帧格式，0：标准帧，1：扩展帧
	INT8U  can_DLC;                     // 帧长度(取值范围0-8)
	INT8U  Data[8];                     // 数据段
	INT16U period;
	INT8U  channel;
} CAN_DATA_SEND_T;

// CAN接收回调函数
typedef void (*CAN_CALLBAK_HDL)(CAN_DATA_HANDLE_T *);
typedef void (*CAN_SEQCFSEND_HDL)(void);
/********************************************************************************
**  函数名:     PORT_InitCan
**  函数描述:   CAN初始化dal层的CAN收发器
**  参数:       无
**  返回:       无
********************************************************************************/
void PORT_InitCan(void);

/********************************************************************************
**  函数名:     PORT_OpenCan
**  函数描述:   CAN初始化
**  参数:       [in] chn:通道号
**              [in] baud:波特率
**              [in] fmat: can帧格式(标准帧/扩展帧)
**  返回:       成功返回true，失败返回false
********************************************************************************/
BOOLEAN PORT_OpenCan(CAN_CHN_E chn, APPCAN_BAUD_E baud, INT8U fmat);

/********************************************************************************
**  函数名:     PORT_CanEnable
**  函数描述:   关闭CAN
**  参数:       [in] chn：通道号
**  返回:       无
********************************************************************************/
void PORT_CanEnable(CAN_CHN_E chn, BOOLEAN enble);

/********************************************************************************
**  函数名:     PORT_SetCanbaud
**  函数描述:   
**  参数:       [in] chn：通道号
**  返回:       无
********************************************************************************/
void PORT_SetCanbaud(CAN_CHN_E chn, APPCAN_BAUD_E baud);

/********************************************************************************
**  函数名:     PORT_CanSend
**  函数描述:   CAN数据发送处理
**  参数:       [in] sdata: port层can数据结构体指针，应包括端口，ID，帧格式，周期参数，数据长度，数据内容等
**              注意:如果周期有效同时数据长度为0，则为远程帧。
**  返回:       发送结果
********************************************************************************/
BOOLEAN PORT_CanSend(CAN_DATA_SEND_T *sdata);

/********************************************************************************
**  函数名:     PORT_ClearCanFilter
**  函数描述:   清空CAN滤波组
**  参数:       [in] chn：通道号
**  返回:       无
********************************************************************************/
void PORT_ClearCanFilter(CAN_CHN_E chn);

/********************************************************************************
**  函数名:     PORT_SetCanFilter
**  函数描述:   CAN滤波设置
**  参数:       [in] chn:通道号
**              [in] fmat: 帧格式，0：标准帧，1：扩展帧
**              [in] filtid: 滤波id
**              [in] maskid: 掩码id
**  返回:       设置结果
********************************************************************************/
BOOLEAN PORT_SetCanFilter(CAN_CHN_E chn, INT8U fmat, INT32U filtid, INT32U maskid);

/********************************************************************************
**  函数名:     PORT_AddCanID
**  函数描述:   CAN增加接收ID
**  参数:       [in] chn:通道号
**              [in] fmat: 帧格式，0：标准帧，1：扩展帧
**              [in] id: 具体id值
**  返回:       发送结果
********************************************************************************/
BOOLEAN PORT_AddCanID(CAN_CHN_E chn, INT8U fmat, INT32U id);

/********************************************************************************
**  函数名:     PORT_RegCanCallbakFunc
**  函数描述:   CAN回调函数注册
**  参数:
**             [in] handle: 回调函数
**  返回:      无
********************************************************************************/
void PORT_RegCanCallbakFunc(CAN_CALLBAK_HDL handle);
void PORT_CanRecCallbakFunc(CAN_CALLBAK_HDL handle);
void PORT_CanSeqCFSendCallbakFunc(CAN_SEQCFSEND_HDL handle);


/********************************************************************************
** 函数名:     PORT_GetBusOffFlag
** 函数描述:   查询bus off 状态
** 参数:       [in] ch:can通道
** 返回:       TRUE bus off
********************************************************************************/
BOOLEAN PORT_GetBusOffFlag(INT8U ch);

/********************************************************************************
** 函数名:     PORT_ClrBusOffFlag
** 函数描述:   查询bus off 状态
** 参数:       [in] ch:can通道
** 返回:       TRUE bus off
********************************************************************************/
void PORT_ClrBusOffFlag(INT8U ch);

/********************************************************************************
** 函数名:     PORT_GetTxErrCnt
** 函数描述:   查询Transmit Error Counter
** 参数:       [in] ch:can通道
** 返回:       TRUE bus off
********************************************************************************/
INT8U PORT_GetTxErrCnt(INT8U ch);

/********************************************************************************
** 函数名:     PORT_GetESR1
** 函数描述:   查询ESR1寄存器状态
** 参数:       [in] ch:can通道
** 返回:
********************************************************************************/
INT32U PORT_GetESR1(INT8U ch);
//#if SOFT_BUSOFF_RECOBRY > 0
/**************************************************************************************************
**  函数名称:  GetBusOffStatus
**  功能描述:  获取busoff状态
**  输入参数:
**  返回参数:  TRUE BUSOFF FALSE 
**************************************************************************************************/
BOOLEAN PORT_GetBusOffStatus(INT8U chn);
//#endif

#if 0    /* 暂不支持 */
/********************************************************************************
** 函数名:     PORT_BusOffManual
** 函数描述:   设置手动清除bus off 状态
** 参数:       [in] ch:can通道
** 返回:
********************************************************************************/
void PORT_BusOffManual(INT8U ch);
#endif

/*****************************************************************************
**  函数名:  Port_CanGetErrStatus
**  函数描述: 获取can通道错误状态
**  参数:    [in] ch : 通道号
**  返回:    错误状态值
*****************************************************************************/
INT32U Port_CanGetErrStatus(INT8U ch);

/*****************************************************************************
**  函数名:  Port_CanClrErrStatus
**  函数描述: 清除can通道错误状态
**  参数:    [in] ch : 通道号
**  返回:    无
*****************************************************************************/
void Port_CanClrErrStatus(INT8U ch);

//-------------------------------------------------------------------------------
#endif /* PORT_CAN_H */
