/********************************************************************************
**
** 文件名:     port_dm.c
** 版权所有:   (c) 1998-2017 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现动态内存申请、释放等接口
**
*********************************************************************************
**                  修改历史记录
**===============================================================================
**| 日期              | 作者        |  修改记录
**===============================================================================
**| 2017/05/12 | 黄运峰    |  创建该文件
********************************************************************************/
#include "yx_includes.h"
#include "dmemory.h"
/********************************************************************************
** 函数名:     PORT_Malloc
** 函数描述:   申请指定大小的动态内存
** 参数:       [in] size: 申请动态内存的大小
** 返回:       申请成功返回内存指针，失败则返回NULL
********************************************************************************/
void *PORT_Malloc(INT32U size)
{
    //return hal_malloc(size);
    return MemAlloc(size);
}
/********************************************************************************
** 函数名:     PORT_Free
** 函数描述:   释放动态内存
** 参数:       [in] ptr: 待释放的动态内存指针
** 返回:       无
********************************************************************************/
void PORT_Free(void *ptr)
{
    //return hal_free(ptr);
    MemFree(ptr);
}

/*****************************************************************************
**  函数名:  PORT_GetFreeHeapSize
**  函数描述: 获取动态内存动态空间
**  参数:    无
**  返回:    动态内容空闲空间
*****************************************************************************/
INT32U PORT_GetFreeHeapSize(void)
{
	HEAPMEM_STATISTICS_T* p_dm_sta;
    p_dm_sta = mmi_dmemory_getstatistics();
    return (SIZE_HEAP_MEM - p_dm_sta->occupysize);
    //return 0;
}
/*****************************************************************************
**  函数名:  PORT_GetDmSize
**  函数描述: 获取已经使用的内存大小
**  参数:    无
**  返回:    已经使用的内存大小
*****************************************************************************/
INT32U PORT_GetDmSize(void)
{
    HEAPMEM_STATISTICS_T* p_dm_sta;
    p_dm_sta = mmi_dmemory_getstatistics();
    return p_dm_sta->occupysize;
}

/*****************************************************************************
**  函数名:  PORT_GetDmBlocks
**  函数描述: 获取内存块数量
**  参数:    无
**  返回:    动态内存块数量
*****************************************************************************/
INT32U PORT_GetDmBlocks(void)
{
    HEAPMEM_STATISTICS_T* p_dm_sta;
    p_dm_sta = mmi_dmemory_getstatistics();
    return p_dm_sta->blocks;
}

//------------------------------------------------------------------------------
/* End of File */


