/********************************************************************************
**
** 文件名:     port_plat.h
** 版权所有:   (c) 1998-2017 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现平台复位、省电、清看门狗等平台接口
**
*********************************************************************************
**                  修改历史记录
**===============================================================================
**| 日期              | 作者        |  修改记录
**===============================================================================
**| 2017/05/15 | 黄运峰    |  创建该文件
********************************************************************************/
#ifndef PORT_PLAT_H
#define PORT_PLAT_H     1

/*
*********************************************************************************
*                   数据类型及宏定义
*********************************************************************************
*/
// 定义复位原因
typedef enum {
    RST_TYPE_NONE  = 0,     // 无复位或未知原因
    RST_TYPE_PWRON,         // 上电复位
    RST_TYPE_EXTR,          // 外部复位管脚复位
    RST_TYPE_WDTO,          // 软件看门狗溢出复位
    RST_TYPE_SWR,           // 软件复位
    RST_TYPE_LVD,           // 欠压或过压复位
    RST_TYPE_OTHER,         // 其他复位原因(非通用，不常见的原因，如LOL(Loss Of Lock)、LOC(Loss Of Clock))
    MAX_RST_REASON
} RST_REASON_E;
/*
 *
*********************************************************************************
*                   对外接口声明
*********************************************************************************
*/
//----------------------------------------------------------
//                  系统时钟相关接口
//----------------------------------------------------------

/********************************************************************************
**  函数名:     PORT_GetSysTimestamp
**  函数描述:   获取系统时间戳
**  参数:       无
**  返回:       成功返回时间戳
********************************************************************************/
INT32U PORT_GetSysTimestamp(INT8U* rtc_time);

/********************************************************************************
**  函数名:     PORT_StampTotime
**  函数描述:   时间戳转时间
**  参数:       [in] stamp:时间戳
				[out]temp:转换的时间
**  返回:       
********************************************************************************/
BOOLEAN PORT_StampTotime(INT32U stamp, INT8U* temp);


/********************************************************************************
**  函数名:     PORT_SetSysTime
**  函数描述:   设置系统时间
**  参数:       [in] stime: 系统时间
**  返回:       成功返回true，失败返回false
********************************************************************************/
BOOLEAN PORT_SetSysTime(SYSTIME_T *dt);

/********************************************************************************
** 函数名:     PORT_GetSysTime
** 函数描述:   从平台中读取当前时间
** 参数:       [out] dtime:   时间
** 返回:       成功返回true，失败返回false
********************************************************************************/
BOOLEAN PORT_GetSysTime(SYSTIME_T *dtime);
BOOLEAN PORT_GetSysTime1(SYSTIME_T *dtime);


/********************************************************************************
** 函数名:     PORT_GetSysDate
** 函数描述:   从平台中读取当前日期
** 参数:       [out] ddate:   日期
** 返回:       成功或失败
********************************************************************************/
BOOLEAN PORT_GetSysDate(DATE_T *ddate);
//----------------------------------------------------------
//                  系统复位及控制相关接口
//----------------------------------------------------------
/********************************************************************************
** 函数名:     PORT_ClearWatchdog
** 函数描述:   清看门狗(MCU软件看门狗)
** 参数:       无
** 返回:       无
********************************************************************************/
void PORT_ClearWatchdog(void);

/*
********************************************************************************
** 函数名:   PORT_ClearWatchdogHS
** 函数描述: 清软硬件看门狗，须定时调用，以免溢出
** 参数:     无
** 返回:     无
********************************************************************************
*/
void PORT_ClearWatchdogHS(void);

/********************************************************************************
** 函数名:     PORT_ResetCPU
** 函数描述:   正常关机复位接口
** 参数:       [in] resettype:复位类型，见SHELL_RESET_E
** 返回:       无
********************************************************************************/
void PORT_ResetCPU(void);

/********************************************************************************
** 函数名:     PORT_ResetCPU_EXT
** 函数描述:   死循环等待外部看门狗复位
** 参数:       无
** 返回:       无
********************************************************************************/
void PORT_ResetCPU_EXT(void);

/********************************************************************************
** 函数名:     PORT_GetResetReason
** 函数描述:   查询复位原因
** 参数:       无
** 返回:       复位原因类型，参见RST_REASON_E
********************************************************************************/
RST_REASON_E PORT_GetResetReason(void);

/********************************************************************************
** 函数名:     PORT_Assert
** 函数描述:   系统复位
** 参数:       [in] exp:  表达式
**             [in] file: 文件名
**             [in] line: 行号
** 返回:       无
********************************************************************************/
void PORT_Assert(void *exp, void *file, INT32U line);

/********************************************************************************
** 函数名:     PORT_DlyNumMS
** 函数描述:   延时若干毫秒(近似时间，受主频、中断等因素影响)
** 参数:       [in] num:  需要延时的毫秒数
** 返回:       无
********************************************************************************/
void PORT_DlyNumMS(INT32U num);
//----------------------------------------------------------
//                  系统信息读写相关接口
//----------------------------------------------------------
/********************************************************************************
** 函数名:     PORT_ReadSNCode
** 函数描述:   读取dataflash中的设备SN码
** 参数:       [out] sn: 返回sn码的缓存指针
**             [in] len: 要读取的sn码长度
** 返回:       TRUE, 读取成功； FALSE, 读取失败。
********************************************************************************/
BOOLEAN PORT_ReadSNCode(INT8U *sn, INT8U len);

/********************************************************************************
** 函数名:     PORT_WriteSNCode
** 函数描述:   向dataflash写入设备SN码
** 参数:       [in] sn: SN码缓存指针
**                 len: 要写入的sn码长度
** 返回:       TRUE, 写入成功； FALSE， 写入失败。
********************************************************************************/
BOOLEAN PORT_WriteSNCode(INT8U *sn, INT8U len);

/********************************************************************************
** 函数名:     YX_PORT_GetHalVersion
** 函数描述:   获取平台版本号
** 参数:       无
** 返回:       成功返回版本号字符串指针，以'\0'为结束符，失败返回0
********************************************************************************/
char *PORT_GetHalVersion(void);
//----------------------------------------------------------
//                  程序更新相关接口
//----------------------------------------------------------
/********************************************************************************
** 函数名:     PORT_GetAppFileName
** 函数描述:   获取无线下载文件名
** 参数:       无
** 返回:       指向文件名字符串的指针(ASCII码),以'\0'为结束符
********************************************************************************/
char const *PORT_GetAppFileName(void);

/********************************************************************************
** 函数名:     PORT_UpdateAppToCodeArea
** 函数描述:   将数据写入codeflash中的APP程序区
** 参数:       [in] fullname: 绝对路径文件名
**             [in] filesize: 文件大小
**             [in] proc:     需要在本函数调用的函数，如清看门狗
** 返回:       成功返回true，失败返回false
********************************************************************************/
BOOLEAN PORT_UpdateAppToCodeArea(char const *fullname, INT32U filesize, void (*proc)(void));

/********************************************************************************
** 函数名:     PORT_CheckLoadDataValid
** 函数描述:   检验下载到codeflash IMAGE区的程序数据有效性。
** 参数:       无
** 返回:       TRUE：校验成功且有效； FALSE：校验失败或无效
********************************************************************************/
BOOLEAN PORT_CheckLoadDataValid(void);
//----------------------------------------------------------
//                  系统低功耗、省电相关接口
//----------------------------------------------------------
/********************************************************************************
** 函数名:     PORT_EnterTransportMode
** 函数描述:   平台进入运输模式
** 参数:       [out] 无
**             [in] 无
** 返回:       无
********************************************************************************/
void PORT_EnterTransportMode(void);

/********************************************************************************
** 函数名:     PORT_Sleep
** 函数描述:   进入省电状态
** 参数:       wktime:休眠唤醒时间
** 返回:       无
********************************************************************************/
void PORT_Sleep(INT16U (*hook)(void), INT16U wktime);

/********************************************************************************
**  函数名称:  PORT_SetAlarm
**  功能描述:  RTC设置提醒中断函数
**  输入参数:  [in] instance:  RTC编号
**             [in] alarmtime: 设置时间（单位为分钟 /取值范围1-43200 [即1分钟-1个月]）
**  返回参数:  无
********************************************************************************/
void PORT_SetAlarm(INT16U alarmtime);

/********************************************************************************
**  函数名称:  PORT_SetAlarmRepeat
**  功能描述:  RTC设置提醒中断函数
**  输入参数:  [in] instance:       RTC编号
**             [in] alarmtime:      设置时间（单位为分钟 /取值范围1-43200 [即1分钟-1个月]）
**             [in] repeatenable:   是否使能重复唤醒
**             [in] repeatinterval: 重复唤醒间隔(单位秒)
**  返回参数:  无
********************************************************************************/
void PORT_SetAlarmRepeat(INT16U alarmtime, BOOLEAN repeatenable, INT32U repeatinterval);
/********************************************************************************
**  函数名称:  PORT_SetRtc
**  功能描述:  内部RTC是否设置
**  返回参数:  无
********************************************************************************/
BOOLEAN PORT_SetRtc(void);
//-------------------------------------------------------------------------------
#endif /* PORT_PLAT_H */
