/********************************************************************************
**
** 文件名:     port_nandflash.h
** 版权所有:   (c) 1998-2017 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要封装nandflash存储访问接口
**
*********************************************************************************
**                  修改历史记录
**===============================================================================
**| 日期              | 作者        |  修改记录
**===============================================================================
**| 2017/08/04 | 黄运峰    |  创建该文件
********************************************************************************/
#ifndef PORT_NANDFLASH_H
#define PORT_NANDFLASH_H    1
/*
*********************************************************************************
*                   模块数据类型及宏定义
*********************************************************************************
*/
#define REC_ATTR_LEN    32      // 记录属性段长度
#define REC_DATA_LEN    1024    // 记录数据段长度

// 定义记录序号枚举类型
typedef enum {
    REC_IDX_0,
    REC_IDX_1,
    REC_IDX_2,
    REC_IDX_3,
    MAX_REC_IDX
} REC_IDX_E;

// 定义读/写/擦操作返回错误枚举类型
typedef enum {
    ERR_NONE,                       // 无错误，操作成功
    ERR_PARA,                       // 错误的参数
    ERR_ECCOVF,                     // 读操作中ECC检测到超出设定阀值的错误位数(设定阀值为8bit)
    ERR_WRFIAL,                     // 写和擦除操作中检测到失败状态
    ERR_OPERTO,                     // 操作超时，可能遇到flash芯片或SPI总线故障
    MAX_ERR_TYPE
} ERR_TYPE_E;

/*
*********************************************************************************
*                   对外接口声明
*********************************************************************************
*/
/********************************************************************************
** 函数名:   PORT_EraseBlock
** 函数描述: 擦除指定块，对于nandflash一次只能擦除1个BLOCK
** 参数:     [in] blknum：要擦除的block序号（0~2047）
** 返回:     执行结果代码
********************************************************************************/
ERR_TYPE_E PORT_EraseBlock(INT32U blkNum);

/********************************************************************************
** 函数名:   PORT_WriteFlashRec
** 函数描述: 向nandflash指定地址写入一条记录数据
** 参数:     [in] blkNum：block序号(0~2047)
**           [in] pageNum：page序号(0~63)
**           [in] recNum：记录序号(0~3)
**           [in] attrBuf：待写入属性段缓存指针
**           [in] dataBuf：待写入数据段缓存指针
** 返回:     执行结果代码
********************************************************************************/
ERR_TYPE_E PORT_WriteFlashRec(INT32U blkNum, INT32U pageNum, INT8U recNum, INT8U *attrBuf, INT8U *dataBuf);

/********************************************************************************
** 函数名:   PORT_ReadFlashRec
** 函数描述: 从nandflash指定地址读出一条记录数据
** 参数:     [in] blkNum：block序号(0~2047)
**           [in] pageNum：page序号(0~63)
**           [in] recNum：记录序号(0~3)
**           [in] attrBuf：存放读取的属性段数据缓存指针
**           [in] dataBuf：存放读取的数据段数据缓存指针
** 返回:     执行结果代码
********************************************************************************/
ERR_TYPE_E PORT_ReadFlashRec(INT32U blkNum, INT32U pageNum, INT8U recNum, INT8U *attrBuf, INT8U *dataBuf);

/********************************************************************************
** 函数名:   PORT_GetFlashPara
** 函数描述: 获取sflash的基本参数
** 参数:     [out] pagesize：页大小
**           [out] blksize：块大小，一个块中包含的页数
**           [out] blknum：块的个数（与总容量有关）
** 返回:     TRUE,获取成功；FALSE，获取失败
********************************************************************************/
BOOLEAN PORT_GetFlashPara(INT32U *pageSize, INT32U *blkSize, INT32U *blkNum);

//-------------------------------------------------------------------------------
#endif /* PORT_NANDFLASH_H */
