/********************************************************************************
**
** 文件名:     port_485.c
** 版权所有:   (c) 1998-2017 厦门雅迅网络股份有限公司
** 文件描述:   实现平台的485驱动接口
**
*********************************************************************************
**                  修改历史记录
**===============================================================================
**| 日期              | 作者        |  修改记录
**===============================================================================
**| 2017/06/26 | 谢金成    |  创建该文件
********************************************************************************/
#if 0
//#include "hal_includes.h"
//#include "hal_uart_drv.h"
#include "dal_485_rxtx.h"
#include "port_485.h"

/********************************************************************************
**  函数名:     PORT_Init485
**  函数描述:   485初始化
**  参数:       [in] :配置参数
**  返回:       成功返回true，失败返回false
********************************************************************************/
BOOLEAN PORT_Init485(INT8U uid, INT32U baud, INT16U rlen, INT16U slen)
{
    return dal_485_Init(uid, baud, rlen, slen);
}

/********************************************************************************
**  函数名:     PORT_Close485
**  函数描述:   关闭串口
**  参数:       [in] uid：串口编号,见UART_IDX_E
**  返回:       无
********************************************************************************/
void PORT_Close485(INT32U uid)
{
    dal_485_Close(uid);
}

/********************************************************************************
** 函数名:   PORT_485_LeftOfWrbuf
** 函数描述: 查询发送缓冲剩余空间
** 参数:     [in] uid:  串口编号
** 返回:     查询成功，返回发送缓冲剩余空间；查询失败则返回-1.
********************************************************************************/
INT32S PORT_485_LeftOfWrbuf(INT32U uid)
{
	return dal_485_LeftOfWrbuf(uid);
}

/********************************************************************************
**  函数名:     PORT_485WriteBlock
**  函数描述:   向485总线发送一串数据
**  参数:       [in] uid: 串口编号，见UART_IDX_E
**              [in] sdata: 待发送的数据指针
**              [in] slen: 待发送的数据长度
**  返回:       发送结果
********************************************************************************/
BOOLEAN PORT_485WriteBlock(INT32U uid, INT8U *sdata, INT32U slen)
{
    return dal_485_WriteBlock(uid, sdata, slen);
}

/********************************************************************************
**  函数名:     PORT_485WriteByte
**  函数描述:   向485总线发送一个字节
**  参数:       [in] uid：串口编号，见UART_IDX_E
**              [in] ch：待发送的字节
**  返回:       成功返回TRUE，失败返回FALSE
********************************************************************************/
BOOLEAN PORT_485WriteByte(INT32U uid, INT8U ch)
{
    return dal_485_WriteByte(uid, ch);
}

/********************************************************************************
**  函数名:     PORT_485Read
**  函数描述:   从串口读取一个字节
**  参数:       [in] uid: 串口编号，见UART_IDX_E
**  返回:       读取到的字节, -1则无效
********************************************************************************/
INT16S PORT_485Read(INT32U uid)
{
    return dal_485_ReadByte(uid);
}
#endif
//------------------------------------------------------------------------------
/* End of File */
