/********************************************************************************
**
** 文件名:     port_gsensor.h
** 版权所有:   (c) 1998-2017 厦门雅迅网络股份有限公司
** 文件描述:   该模块实现g-sensor模块相关功能接口封装和事件处理
**
*********************************************************************************
**                  修改历史记录
**===============================================================================
**| 日期              | 作者        |  修改记录
**===============================================================================
**| 2017/05/15 | 黄运峰    |  创建该文件
********************************************************************************/
#ifndef PORT_GSENSOR_H
#define PORT_GSENSOR_H      1

#include "Dal_Include.h"
/*
*********************************************************************************
*                   数据类型和宏定义
*********************************************************************************
*/
// GSENSOR事件枚举类型定义
typedef enum {
    GSEN_EVT_NONE = 0,
    GSEN_EVT_HIT,
    GSEN_EVT_MOTION,
    GSEN_EVT_MAX
} GSEN_EVT_E;

// 坐标轴数据结构体类型
typedef struct {
    INT32S axis_x;
    INT32S axis_y;
    INT32S axis_z;
} AXIS_DAT_T;
// 坐标轴、加速度阈值数据结构体类型

// 加速度传感器三轴标定完成后回调函数指针，返回标定得到的三轴初始加速度值
typedef void (* GSEN_CALIB_CALBAK)(AXIS_DAT_T *val_accl, AXIS_DAT_T *val_gyro);
/********************************************************************************
** 函数名:     PORT_Hdl_SHELL_MSG_GSENSOR_EVENT
** 函数描述:   处理gsensor事件:碰撞,振动等
** 参数:       [in] msg: 为事件类型, 具体定义参见GSEN_EVENT_E
** 返回:       成功返回true，失败返回false
********************************************************************************/
BOOLEAN PORT_Hdl_SHELL_MSG_GSENSOR_EVENT(void *msg);

/********************************************************************************
** 函数名:     PORT_Hdl_SHELL_MSG_WAKE_EVENT
** 函数描述:   处理gsensor事件:碰撞,振动等
** 参数:       [in] msg: 为事件类型, 具体定义参见SHELL_MCU_WKUP_EVNT_E
** 返回:       成功返回true，失败返回false
********************************************************************************/
BOOLEAN PORT_Hdl_SHELL_MSG_WAKE_EVENT(void *msg);//2017.11.28yuyoupeng

/********************************************************************************
**  函数名:     PORT_GsenCalibStart
**  函数描述:   启动标定
**  参数:       [in] callback: 回调函数
**  返回:       无
********************************************************************************/
void PORT_GsenCalibStart(GSEN_CALIB_CALBAK calbak);

/********************************************************************************
**  函数名:     PORT_GsenGetWorkState
**  函数描述:   查询Gsensor状态
**  参数:       无
**  返回:       Gsensor状态 0 未运行  1 已运行
********************************************************************************/
INT8U PORT_GsenGetWorkState(void);

/********************************************************************************
** 函数名:     PORT_GsenEnableTemp
** 函数描述:   使能温度数据采集功能，默认初始化完是关闭
** 参数:       无
** 返回:       无
********************************************************************************/
BOOLEAN PORT_GsenEnableTemp(void);

/********************************************************************************
**  函数名:     PORT_CloseGsensor
**  函数描述:   gsensor进入低功耗模式，系统进入休眠模式前调用
**  参数:       无
**  返回:       无
********************************************************************************/
void PORT_SleepGsensor(void);

/********************************************************************************
**  函数名:     PORT_CloseGsensor
**  函数描述:   关闭Gsensor,在运输模式下使用
**  参数:       无
**  返回:       无
********************************************************************************/
void PORT_CloseGsensor(void);

/********************************************************************************
**  函数名:     PORT_GsenSetHitPara
**  函数描述:   设置阀值和三轴标定值 
**  参数:       [in] ths_val：碰撞加速度阀值
**              [in] calib： X/Y/Z三轴标定值,单位0.001g
**  返回:       TRUE，设置成功；FALSE，设置失败
********************************************************************************/
BOOLEAN PORT_GsenSetHitPara(INT16U ths_val, AXIS_DAT_T *calib);

/********************************************************************************
**  函数名称:  PORT_GsenSetGyroPara
**  功能描述:  设置标定的角速度三轴偏移值
**  输入参数: [in] calib: 标定的角速度三轴偏移值
**
**  返回参数:  TRUE，设置成功；FALSE，设置失败
********************************************************************************/
BOOLEAN PORT_GsenSetGyroPara(AXIS_DAT_T *calib);

/********************************************************************************
**  函数名称:  PORT_ReadGyroData
**  功能描述:  获取g-sensor三轴角速度值，单位1/1000 °/s
**  输入参数:  [in] axis_val：用于返回三轴角速度值
**  返回参数:  TRUE，获取成功；FALSE，获取失败
********************************************************************************/
BOOLEAN PORT_ReadGyroData(AXIS_DAT_T *axis_val);

/********************************************************************************
**  函数名:     PORT_ReadAcclData
**  函数描述:   读取实时三轴的加速度值, 单位: 0.001g
**  参数:       [out] axis_val：X/Y/Z三轴加速度返回结构体指针
**  返回:       是否成功
********************************************************************************/
BOOLEAN PORT_ReadAcclData(AXIS_DAT_T *axis_val);

/********************************************************************************
**  函数名:     PORT_ReadHitAcclData
**  函数描述:   读取碰撞时三轴的加速度值, 单位: 0.001g
**  参数:       [out] axis_val： X/Y/Z三轴加速度返回结构体指针
**  返回:       是否成功
********************************************************************************/
BOOLEAN PORT_ReadHitAcclData(AXIS_DAT_T *axis_val);

/********************************************************************************
**  函数名称:  PORT_ReadTemperData
**  功能描述:  获取温度传感器值
**  输入参数:  [in] rval：用于返回温度值，单位:1/10℃
**  返回参数:  TRUE，获取成功；FALSE，获取失败
********************************************************************************/
BOOLEAN PORT_ReadTemperData(INT16S *rval);

void PORT_Gsensor_Init(void);

//-------------------------------------------------------------------------------
#endif /* PORT_GSENSOR_H */
