/********************************************************************************
**
** 文件名:     os_timer.c
** 版权所有:   (c) 1998-2017 厦门雅迅网络股份有限公司
** 文件描述:   实现虚拟内核软件定时器功能
** 创建人：        陈从华
*********************************************************************************
**                  修改历史记录
**===============================================================================
**| 日期              | 作者        |  修改记录
**===============================================================================
**| 2017/05/15 | 黄运峰    |  移植、修改、规范化
********************************************************************************/
#include "yx_includes.h"
#include "port_timer.h"
#include "Man_Timer.h"


/********************************************************************************
** 函数名:     OS_InstallTmr
** 函数描述:   安装一个定时器
** 参数:       [in] taskid     定时器所属任务ID
**             [in] index:     定时器标识, 当定时器超时执行超时处理函数时, 该参数作为形参传入处理函数
**             [in] tmrproc:   定时器超时处理函数
** 返回:       定时器ID; 如安装失败, 则返回0xff
** 注意:       安装完定时器还需调用Gps_StartTmr才能启动定时器运行
********************************************************************************/
INT32U OS_InstallTmr(INT8U taskid, void *index, void (*tmrproc)(void *index))
{
    return CreateTimer(tmrproc);
}

/********************************************************************************
** 函数名:     OS_RemoveTmr
** 函数描述:   删除一个已创建的定时器
** 参数:       [in]  id:        已创建的一个定时器ID
** 返回:       无
********************************************************************************/
void OS_RemoveTmr(INT32U id)
{
    RemoveTimer(id);
}

/********************************************************************************
** 函数名:     OS_StartTmr
** 函数描述:   启动定时器
** 参数:       [in]  id:        已创建的一个定时器ID
**             [in]  attrib:    定时器超时时间单位
**             [in]  time:      定时器超时时间
** 返回:       无
********************************************************************************/
void OS_StartTmr(INT32U id, INT32U attrib, INT32U time)
{
    StartTimer(id, attrib, time, true);
}

/********************************************************************************
** 函数名:     OS_StopTmr
** 函数描述:   停止定时器
** 参数:       [in]  id:        已创建的一个定时器ID
** 返回:       无
********************************************************************************/
void OS_StopTmr(INT32U id)
{
    StopTimer(id);
}

/********************************************************************************
** 函数名:     OS_TmrIsRun
** 函数描述:   判断定时器是否处于运行状态
** 参数:       [in]  id:    已创建的一个定时器ID
** 返回:       true:  定时器处于运行状态
**             false: 定时器处于停止状态
********************************************************************************/
BOOLEAN OS_TmrIsRun(INT8U id)
{
    return TimerIsRun(id);
}

//------------------------------------------------------------------------------
/* End of File */

