/********************************************************************************
**
** 文件名:     port_msghdl.h
** 版权所有:   (c) 1998-2017 厦门雅迅网络股份有限公司
** 文件描述:   定义上层应用事件/消息ID
**
*********************************************************************************
**                  修改历史记录
**===============================================================================
**| 日期              | 作者        |  修改记录
**===============================================================================
**| 2017/05/12 | 黄运峰    |  创建该文件
********************************************************************************/
#ifndef PORT_MSGHDL_H
#define PORT_MSGHDL_H   1

/*
*********************************************************************************
*                   数据类型和宏定义
*********************************************************************************
*/
// 定义上层应用事件/消息ID
typedef enum {
    SHELL_MSG_NULL = 0x00,

    SHELL_MSG_GSENSOR_EVENT,                // g-sensor事件:碰撞,振动等,具体事件定义参见GSEN_EVENT_E
    SHELL_MSG_MCU_WAKEUP,                   // MCU唤醒事件，可能原因可以是g-sensor、can、gsm模块等

    MAX_SHELL_MSGID
} SHELL_MSGID_E;
// 定义唤醒事件类型
typedef enum {
    SHELL_WKUP_EVNT_MOTION,
    SHELL_WKUP_EVNT_HIT,
    SHELL_WKUP_EVNT_RTCALM,
    SHELL_WKUP_EVNT_ACCON,
    SHELL_WKUP_EVNT_CAN0,
    SHELL_WKUP_EVNT_CHGCAR,
    SHELL_WKUP_EVNT_MCUWK,
	SHELL_WKUP_EVNT_PWRDECT,
    SHELL_MAX_ENVT_NUM
} SHELL_MCU_WKUP_EVNT_E;
/*
*********************************************************************************
*                   对外接口声明
*********************************************************************************
*/
/********************************************************************************
**  函数名:     YX_PortLayerInit
**  函数描述:   初始化Port层，初始化常数型变量，安装系统消息处理入口
**  参数:       无
**  返回:       无
********************************************************************************/
void YX_PortLayerInit(void);

//-------------------------------------------------------------------------------
#endif /* PORT_MSGHDL_H */

