/********************************************************************************
**
** 文件名:     port_nvrec.c
** 版权所有:   (c) 1998-2017 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要封装非易失性记录式存储空间访问接口
**
*********************************************************************************
**                  修改历史记录
**===============================================================================
**| 日期              | 作者        |  修改记录
**===============================================================================
**| 2017/07/04 | 黄运峰    |  创建该文件
********************************************************************************/
#if 0
#include "hal_includes.h"
#include "hal_nvrec_drv.h"

/********************************************************************************
**  函数名称:  PORT_ClearAllNvRec
**  功能描述:  清除所有nvrec记录(清除完所有数据都是0xff)
**  输入参数:  无
**  返回参数:  TRUE，执行成功； FALSE，执行失败
********************************************************************************/
BOOLEAN PORT_ClearAllNvRec(void)
{
    return hal_nvrec_ClearAllRecord();
}
/********************************************************************************
** 函数名:     PORT_WriteNvRecord
**  功能描述:  向nvrec空间写入若干条记录数据
**  输入参数:  [in] s_idx: 要写入的起始记录编号,从0开始
**             [in] recnum：所要写入的记录个数
**             [in] srcbuf：保存待写入记录数据的缓存指针
**  返回参数:  TRUE，执行成功； FALSE，执行失败
********************************************************************************/
BOOLEAN PORT_WriteNvRecord(INT16U s_idx, INT16U recnum, INT8U *srcbuf)
{
    return hal_nvrec_WriteRecord(s_idx, recnum, srcbuf);
}
/********************************************************************************
**  函数名称:  PORT_ReadNvRecord
**  功能描述:  从nvrec空间读取若干条记录数据
**  输入参数:  [in] s_idx: 要读取的起始记录编号,从0开始
**             [in] recnum：所要读取的记录个数
**             [in] destbuf：保存读取的记录数据的缓存指针
**  返回参数:  TRUE，执行成功； FALSE，执行失败
********************************************************************************/
BOOLEAN PORT_ReadNvRecord(INT16U s_idx, INT16U recnum, INT8U *destbuf)
{
    return hal_nvrec_ReadRecord(s_idx, recnum, destbuf);
}
#endif
//------------------------------------------------------------------------------
/* End of File */
