/******************************************************************************
**
** 文件名   : port_spi.h
** 版权所有 : (c) 2005-2020 厦门雅迅网络股份有限公司
** 文件描述 : 实现平台的spi驱动接口
** 创建人   : cym, 2020年12月15日 
**
*******************************************************************************
**             修改历史记录
**===============================================================================
**| 日期        | 作者    |  修改记录
**===============================================================================
**| 2020 /12/15 | cym     |  创建该文件
**
*********************************************************************************/
#ifndef _PORT_SPI_H_
#define _PORT_SPI_H_


/*
********************************************************************************
* 定义宏
********************************************************************************
*/


/*
********************************************************************************
* 定义配置参数
********************************************************************************
*/
/* spi编号枚举 */
typedef enum {
    PORT_SPI1,     /* 对应spi1(用于加密芯片) */
    PORT_SPI2,     /* 对应spi4(用于can芯片) */
    MAX_PORT_SPI
} PORT_SPI_IND_E;

/* spi模式枚举 */
typedef enum {
    PORT_SPI_MODE_MASTER,    /* 主机模式 */   
    PORT_SPI_MODE_SLAVER,    /* 从机模式 */
    MAX_PORT_MODE
} PORT_SPI_MODE_E;

/* spi处理模式枚举 */
typedef enum {
    PORT_SPI_HDL_MODE_INT,    /* 中断模式 */   
    PORT_SPI_HDL_MODE_DMA,    /* DMA模式 */
    PORT_SPI_HDL_MODE_LOOP,   /* 查询状态传输模式 */
    MAX_PORT_SPI_HDL_MODE
} PORT_SPI_HDL_MODE_E;

/* spi时钟极性和相位模式 */
typedef enum {
    PORT_SPI_CLOCK_MODE_0,    /* CPOL = 0, CPHA = 0 */
    PORT_SPI_CLOCK_MODE_1,    /* CPOL = 0, CPHA = 1 */
    PORT_SPI_CLOCK_MODE_2,    /* CPOL = 1, CPHA = 0 */
    PORT_SPI_CLOCK_MODE_3,    /* CPOL = 1, CPHA = 1 */
    PORT_SPI_CLOCK_MODE_ERR
} PORT_SPI_CLOCK_MODE_E;
/*
********************************************************************************
* 定义模块数据结构
********************************************************************************
*/
/* 初始化结构 */
typedef struct {
    PORT_SPI_MODE_E mode;
    PORT_SPI_HDL_MODE_E hdl_mode;
    PORT_SPI_CLOCK_MODE_E clock_mode;
    INT32U baud;
} PORT_SPI_INIT_T;


/*
********************************************************************************
* 定义模块变量
********************************************************************************
*/

/*
********************************************************************************
* 定义对外接口
********************************************************************************
*/
/*****************************************************************************
**	函数名:  PORT_SpiReadByte
**	函数描述: 读取1字节
**	参数:	 [in] idx : spi编号
**	返回:	 -1:表示无效,正值表示读取的有效数据
*****************************************************************************/
INT32S PORT_SpiReadByte(PORT_SPI_IND_E idx);

/*******************************************************************
** 函数名:     PORT_SpiRecvBufUsed
** 函数描述:   SPIX接收的大小
** 参数:       [in] idx : spi编号
** 返回:       接收大小
********************************************************************/
INT32U PORT_SpiRecvBufUsed(PORT_SPI_IND_E idx);

/*******************************************************************
** 函数名:     Spix_RecvBufReset
** 函数描述:   复位接收缓存
** 参数:       [in] idx : spi编号
** 返回:       无
********************************************************************/
void PORT_SpiRecvBufReset(PORT_SPI_IND_E idx);

/*******************************************************************
** 函数名:     Spix_SendByte
** 函数描述:   SPIX发送单个字节
** 参数:       [in] idx : spi编号
               [in] byte: 字节数据
** 返回:       无
********************************************************************/
BOOLEAN PORT_SpiSendByte(PORT_SPI_IND_E idx, INT8U byte);

/*******************************************************************
** 函数名:     PORT_SpiSendData
** 函数描述:   SPIX发送连续数据
** 参数:       [in] idx : spi编号
               [in] ptr:   数据指针
**             [in] tlen:  数据长度
** 返回:       发送结果
********************************************************************/
BOOLEAN PORT_SpiSendData(PORT_SPI_IND_E idx, INT8U *ptr, INT32U tlen);

/*******************************************************************
** 函数名:     PORT_SpiClose
** 函数描述:   SPI关闭操作
** 参数:       [in] idx : spi编号
** 返回:       TRUE : 关闭成功 ；FALSE : 关闭失败
********************************************************************/
BOOLEAN PORT_SpiClose(PORT_SPI_IND_E idx);

/*******************************************************************
** 函数名:     PORT_SpiOpen
** 函数描述:   SPI打开操作
** 参数:       [in] idx : spi编号
               [in] init : 初始化结构
** 返回:       TRUE : 打开成功 ；FALSE : 打开失败
********************************************************************/
BOOLEAN PORT_SpiOpen(PORT_SPI_IND_E idx, PORT_SPI_INIT_T init);

/*******************************************************************
** 函数名:     PORT_SpiIsSendIle
** 函数描述:   发送是否在空闲状态
** 参数:       [in] idx : spi编号
** 返回:       TRUE : 空闲 FALSE: 非空闲状态
********************************************************************/
BOOLEAN PORT_SpiIsSendIle(PORT_SPI_IND_E idx);


#endif

