/********************************************************************************
**
** 文件名:     dal_pp_drv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:    该模块主要实现公共参数文件存储驱动管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2012/01/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef DAL_PP_DRV_H
#define DAL_PP_DRV_H   1


#include "dal_pp_reg.h"
#include "dal_pp_misc.h"

/*
********************************************************************************
* 定义模块配置参数
********************************************************************************
*/

// pubpara change reason
typedef enum {
    PP_REASON_STORE,         /* 存储 */
    PP_REASON_SIMBAK,        /* 取出备份参数 */
    PP_REASON_RESET,         /* 恢复出厂设置 */
    PP_REASON_MAX
} PP_REASON_E;

#define MAX_PP_NUM           20       /* 最大参数个数 */
#define MAX_PP_CLASS_NUM     1         /* 最大数据区个数 */

#define MAX_PP_INFORM        1        /* 最大注册参数变化通知函数个数 */
#define MAX_PP_FILENAME_LEN  6

/*
********************************************************************************
* 定义模块数据结构
********************************************************************************
*/
typedef struct {
    INT8U chksum[2];
} PP_HEAD_T;

/*******************************************************************
** 函数名:      DAL_PP_InitDrv
** 函数描述:    公共参数存储驱动初始化
** 参数:        无
** 返回:        无
********************************************************************/
void DAL_PP_InitDrv(void);

/*******************************************************************
** 函数名:     DAL_PP_DelParaByClass
** 函数描述:   删除指定参数区的参数
** 参数:       [in] cls：参数区,见PP_CLASS_ID_E
** 返回:       成功返回true，失败返回false
********************************************************************/
#define DAL_PP_DelParaByClass(cls)    PP_DelParaByClass(0x55, cls)
BOOLEAN PP_DelParaByClass(INT8U flag, INT8U cls);

/*******************************************************************
** 函数名:     DAL_PP_DelAllPara
** 函数描述:   删除所有参数区的参数,程序可以继续正常运行
** 参数:       无
** 返回:       成功返回true，失败返回false
********************************************************************/
#define DAL_PP_DelAllPara()    PP_DelAllPara(0x55)
BOOLEAN PP_DelAllPara(INT8U flag);

/*******************************************************************
** 函数名:     DAL_PP_DelAllParaAndRst
** 函数描述:   删除所有参数区的参数,必须复位重启设备后才能继续存储
** 参数:       无
** 返回:       无
********************************************************************/
#define DAL_PP_DelAllParaAndRst()    PP_DelAllParaAndRst(0x55)
void PP_DelAllParaAndRst(INT8U flag);

/*******************************************************************
** 函数名:      DAL_PP_ClearParaByID
** 函数描述:    清除PP参数
** 参数:        [in] id:  参数编号，见PP_ID_E
** 返回:        有效返回true，无效返回false
********************************************************************/
BOOLEAN DAL_PP_ClearParaByID(INT8U id);

/*******************************************************************
** 函数名:      DAL_PP_GetParaPtr
** 函数描述:    读取PP参数指针(只能按字节访问)
** 参数:        [in] id:  参数编号，见PP_ID_E
**              [in] dptr:输出缓存
**              [in] rlen:缓存长度
** 返回:        有效返回true，无效返回false
********************************************************************/
INT8U *DAL_PP_GetParaPtr(INT8U id);

/*******************************************************************
** 函数名:      DAL_PP_ReadParaByID
** 函数描述:    读取PP参数，判断PP有效性
** 参数:        [in] id:  参数编号，见PP_ID_E
**              [in] dptr:输出缓存
**              [in] rlen:缓存长度
** 返回:        有效返回true，无效返回false
********************************************************************/
BOOLEAN DAL_PP_ReadParaByID(INT8U id, INT8U *dptr, INT16U rlen);

/*******************************************************************
** 函数名:      DAL_PP_StoreParaByID
** 函数描述:    存储PP参数，延时2秒存储到flash
** 参数:        [in] id:  参数编号，见PP_ID_E
**              [in] sptr:输入缓存
**              [in] slen:缓存长度
** 返回:        成功返回true，失败返回false
********************************************************************/
BOOLEAN DAL_PP_StoreParaByID(INT8U id, INT8U *sptr, INT16U slen);

/*******************************************************************
** 函数名:      DAL_PP_StoreParaInstantByID
** 函数描述:    存储PP参数,立即存储到flash中
** 参数:        [in] id:  参数编号，见PP_ID_E
**              [in] sptr:输入缓存
**              [in] slen:缓存长度
** 返回:        成功返回true，失败返回false
********************************************************************/
BOOLEAN DAL_PP_StoreParaInstantByID(INT8U id, INT8U *sptr, INT16U slen);

/*******************************************************************
** 函数名:      DAL_PP_CheckParaValidByID
** 函数描述:    判断PP参数有效性
** 参数:        [in] id:  参数编号，见PP_ID_E
** 返回:        有效返回true，无效返回false
********************************************************************/
BOOLEAN DAL_PP_CheckParaValidByID(INT8U id);

/*******************************************************************
** 函数名:      DAL_PP_GetParaByID
** 函数描述:    获取PP参数，不判断PP参数的有效性，直接获取
** 参数:        [in] id:  参数编号，见PP_ID_E
**              [in] dptr:输出缓存
**              [in] rlen:缓存长度
** 返回:        成功返回true，失败返回false
********************************************************************/
BOOLEAN DAL_PP_GetParaByID(INT8U id, INT8U *dptr, INT16U rlen);

/*******************************************************************
** 函数名:      DAL_PP_RegParaChangeInformer
** 函数描述:    注册参数变化通知函数的函数
** 参数:        [in] id:  参数编号，见PP_ID_E
**              [in] fp:  回调函数
** 返回:        成功返回true，失败返回false
********************************************************************/
BOOLEAN DAL_PP_RegParaChangeInformer(INT8U id, void (*fp)(INT8U reason));

/*******************************************************************
** 函数名:      DAL_PP_InformParaChangeByID
** 函数描述:    参数变化通知处理
** 参数:        [in] id:      参数编号，见PP_ID_E
**              [in] reason:  变化原因
** 返回:        无
********************************************************************/
void DAL_PP_InformParaChangeByID(INT16U id, INT8U reason);

#endif


