/********************************************************************************
**
** 文件名:     dal_output_drv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现I/O输出驱动控制
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2012/02/09 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef DAL_OUTPUT_DRV_H
#define DAL_OUTPUT_DRV_H     1


#include "dal_output_reg.h"

/*
********************************************************************************
*                  DEFINE PORT MODE PRIORITY
********************************************************************************
*/
typedef enum {
    OUTPUT_PRI_HIGH,
    OUTPUT_PRI_MID,
    OUTPUT_PRI_LOW,
    OUTPUT_PRI_MAX
} OUTPUT_PRI_E;

/*******************************************************************
** 函数名:     DAL_OUTPUT_InitDrv
** 函数描述:   初始化端口驱动
** 参数:       无
** 返回:       无
********************************************************************/
void DAL_OUTPUT_InitDrv(void);

/*******************************************************************
** 函数名:     DAL_OUTPUT_StartFlash
** 函数描述:   启动输出控制接口
** 参数:       [in]	port:	    输入口类型,见OUTPUT_IO_E
**             [in]	prior:	    优先级，见OUTPUT_PRI_E
**             [in]	cycle:	    次数
**             [in]	time_high:	高电平持续时间，单位：100ms
**             [in]	time_low:	低电平持续时间，单位：100ms
**             [in]	informer:	通知回调函数;
**             [in]	pdata:	    特征值，回调给informer
** 返回:       无
********************************************************************/
void DAL_OUTPUT_StartFlash(INT8U port, INT8U prior, INT16U cycle, INT8U time_high, INT8U time_low, void (*informer)(INT8U, void *), void *pdata);

/*******************************************************************
** 函数名:     DAL_OUTPUT_StopFlash
** 函数描述:   停止输出控制接口
** 参数:       [in]	port:	输入口类型,见OUTPUT_IO_E
**             [in]	prior:	优先级，见OUTPUT_PRI_E
** 返回:       无
********************************************************************/
void DAL_OUTPUT_StopFlash(INT8U port, INT8U prior);

/*******************************************************************
** 函数名:     DAL_OUTPUT_StartPermentFlash
** 函数描述:   启动永久控制输出口接口，常用于闪灯控制
** 参数:       [in]	port:	    输入口类型,见OUTPUT_IO_E
**             [in]	time_high:	高电平持续时间，单位：100ms
**             [in]	time_low:	低电平持续时间，单位：100ms
** 返回:       无
********************************************************************/
void DAL_OUTPUT_StartPermentFlash(INT8U port, INT8U time_high, INT8U time_low);

/*******************************************************************
** 函数名:     DAL_OUTPUT_StopPermentFlash
** 函数描述:   停止永久控制输出口接口，常用于闪灯控制
** 参数:       [in]	port:	输入口类型,见OUTPUT_IO_E
** 返回:       无
********************************************************************/
void DAL_OUTPUT_StopPermentFlash(INT8U port);

/*******************************************************************
** 函数名:     DAL_OUTPUT_PortIsFlashing
** 函数描述:   判断指定端口是否正在被驱动
** 参数:       [in]	port:	输入口类型,见OUTPUT_IO_E
** 返回:       TRUE：端口已被驱动
**			   FALSE：端口未被驱动
********************************************************************/
BOOLEAN DAL_OUTPUT_PortIsFlashing(INT8U port);

/*******************************************************************
** 函数名:     DAL_OUTPUT_GetPortStatus
** 函数描述:   读取指定端口的当前状态
** 参数:       [in]	port:	输入口类型,见OUTPUT_IO_E
** 返回:       1：高电平状态
**			   0：低点平状态
********************************************************************/
INT8U DAL_OUTPUT_GetPortStatus(INT8U port);


#endif
