/********************************************************************************
**
** 文件名:     dal_gpio_cfg.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现GPIO定义和配置
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2011/01/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef DAL_GPIO_CFG_H
#define DAL_GPIO_CFG_H       1




/*
********************************************************************************
*  看门狗
********************************************************************************
*/
void DAL_GPIO_InitWatchdog(void);
void DAL_GPIO_ClearWatchdog(void);


/*******************************************************************
** 函数名:     DAL_GPIO_InitOutput
** 函数描述:   通用GPIO输出初始化
** 参数:       [in] port: 输出口编号，见OUTPUT_IO_E
** 返回:       无
********************************************************************/
void DAL_GPIO_InitOutput(INT8U port);

/*******************************************************************
** 函数名:     DAL_GPIO_Pullup
** 函数描述:   控制拉高GPIO
** 参数:       [in] port: 输出口编号，见OUTPUT_IO_E
** 返回:       无
********************************************************************/
void DAL_GPIO_Pullup(INT8U port);

/*******************************************************************
** 函数名:     DAL_GPIO_Pulldown
** 函数描述:   控制拉低GPIO
** 参数:       [in] port: 输出口编号，见OUTPUT_IO_E
** 返回:       无
********************************************************************/
void DAL_GPIO_Pulldown(INT8U port);

/*******************************************************************
** 函数名:     DAL_GPIO_PullupMixLed
** 函数描述:   红绿灯混合控制,控制拉高GPIO
** 参数:       [in] port: 输出口编号，见OUTPUT_IO_E
** 返回:       无
********************************************************************/
void DAL_GPIO_PullupMixLed(INT8U port);

/*******************************************************************
** 函数名:     DAL_GPIO_PulldownMixLed
** 函数描述:   红绿灯混合控制,控制拉低GPIO
** 参数:       [in] port: 输出口编号，见OUTPUT_IO_E
** 返回:       无
********************************************************************/
void DAL_GPIO_PulldownMixLed(INT8U port);

/*******************************************************************
** 函数名:     DAL_GPIO_PullupDvrPower
** 函数描述:   控制MMI电源
** 参数:       无
** 返回:       无
********************************************************************/
void DAL_GPIO_InitDvrPower(void);
void DAL_GPIO_PullupDvrPower(void);
void DAL_GPIO_PulldownDvrPower(void);

/*******************************************************************
** 函数名:     DAL_GPIO_PullupDvrReset
** 函数描述:   控制MMI电源
** 参数:       无
** 返回:       无
********************************************************************/
void DAL_GPIO_InitDvrReset(void);
void DAL_GPIO_PullupDvrReset(void);
void DAL_GPIO_PulldownDvrReset(void);

/*******************************************************************
** 函数名:     DAL_GPIO_PullupPowerSave
** 函数描述:   控制外围电路电源
** 参数:       无
** 返回:       无
********************************************************************/
void DAL_GPIO_InitPowerSave(void);
void DAL_GPIO_PullupPowerSave(void);
void DAL_GPIO_PulldownPowerSave(void);

/*******************************************************************
** 函数名:     DAL_GPIO_PullupGpsPower
** 函数描述:   控制GPS电源
** 参数:       无
** 返回:       无
********************************************************************/
void DAL_GPIO_InitGpsPower(void);
void DAL_GPIO_PullupGpsPower(void);
void DAL_GPIO_PulldownGpsPower(void);

/*******************************************************************
** 函数名:     DAL_GPIO_PullupGpsVbat
** 函数描述:   控制GPS备用电源
** 参数:       无
** 返回:       无
********************************************************************/
void DAL_GPIO_InitGpsVbat(void);
void DAL_GPIO_PullupGpsVbat(void);
void DAL_GPIO_PulldownGpsVbat(void);

/*******************************************************************
** 函数名:     DAL_GPIO_PullupGsmPower
** 函数描述:   控制GSM电源
** 参数:       无
** 返回:       无
********************************************************************/
void DAL_GPIO_InitGsmPower(void);
void DAL_GPIO_PullupGsmPower(void);
void DAL_GPIO_PulldownGsmPower(void);


/*******************************************************************
** 函数名:     DAL_GPIO_PullupGsmOnOff
** 函数描述:   控制GSM开关机
** 参数:       无
** 返回:       无
********************************************************************/
void DAL_GPIO_InitGsmOnOff(void);
void DAL_GPIO_PullupGsmOnOff(void);
void DAL_GPIO_PulldownGsmOnOff(void);

/*******************************************************************
** 函数名:     
** 函数描述:   控制里程脉冲通道
** 参数:       无
** 返回:       无
********************************************************************/
void DAL_GPIO_InitPulseChanne(void);
void DAL_GPIO_PullupPulseCh1(void);
void DAL_GPIO_PulldownPulseCh1(void);
void DAL_GPIO_PullupPulseCh2(void);
void DAL_GPIO_PulldownPulseCh2(void);

/*
********************************************************************************
*  行驶记录仪里程和脉冲通道选择
PIN_LICHENG_CH  PIN_PULSE_CH           DB9的第7脚的用途
---------------------------------------------------------
    0            X(任意状态)           输入
    1            1                     里程脉冲输出
    1            0                     实时时间输出
********************************************************************************
*/

void DAL_GPIO_InitPulseChannel(void);

/* 选择里程脉冲从外部线束上输入 */
void DAL_GPIO_SelectOdometerPulseFromEXT(void);

/* E1选择里程脉冲从DB9上输入 */
void DAL_GPIO_SelectMeterIntoDB9(void);

/* E2选择脉冲从DB9输出 */
void DAL_GPIO_SelectPulseOutDB9(void);

/* E3选择实时时间从DB9输出 */
void DAL_GPIO_SelectTimeOutDB9(void);

//********************************************************************************-----------------------

/*******************************************************************
** 函数名:     DAL_GPIO_InitInput
** 函数描述:   通用GPIO初始化
** 参数:       [in] port: 输入口编号，见INPUT_IO_E
** 返回:       无
********************************************************************/
void DAL_GPIO_InitInput(INT8U port);

/*******************************************************************
** 函数名:     DAL_GPIO_ReadPort
** 函数描述:   读取通用GPIO状态
** 参数:       [in] port: 输入口编号，见INPUT_IO_E
** 返回:       有效返回TRUE,无效返回false
********************************************************************/
BOOLEAN DAL_GPIO_ReadPort(INT8U port);

/*******************************************************************
** 函数名:     DAL_GPIO_ReadPortN
** 函数描述:   读取通用GPIO状态,低电平表示有效
** 参数:       [in] port: 输入口编号，见INPUT_IO_E
** 返回:       有效返回TRUE,无效返回false
********************************************************************/
BOOLEAN DAL_GPIO_ReadPortN(INT8U port);

/*******************************************************************
** 函数名:     DAL_GPIO_ReadPowDect
** 函数描述:   读取断电状态
** 参数:       [in] port: 输入口编号，见INPUT_IO_E
** 返回:       断电返回true，正常返回false
********************************************************************/
void DAL_GPIO_InitPowDect(INT8U port);
BOOLEAN DAL_GPIO_ReadPowDect(INT8U port);

/*******************************************************************
** 函数名:     DAL_GPIO_ReadLowVol
** 函数描述:   读取欠压状态
** 参数:       [in] port: 输入口编号，见INPUT_IO_E
** 返回:       欠压返回true，正常返回false
********************************************************************/
void DAL_GPIO_InitLowVol(INT8U port);
BOOLEAN DAL_GPIO_ReadLowVol(INT8U port);

/*******************************************************************
** 函数名:     ReadValue_VINLOW
** 函数描述:   读取ADC值
** 参数:       无
** 返回:       返回ADC值
********************************************************************/
INT32U ReadValue_VINLOW(void);

/*******************************************************************
** 函数名:     ReadValue_ADC2
** 函数描述:   读取第二路ADC值
** 参数:       无
** 返回:       返回ADC值
********************************************************************/
INT32U ReadValue_ADC2(void);

#endif

