/********************************************************************************
**
** 文件名:     dal_input_drv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现I/O口传感器输入状态检测
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2010/08/09 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef DAL_INPUT_DRV_H
#define DAL_INPUT_DRV_H      1


#include "dal_input_reg.h"

/*
********************************************************************************
*                  定义触发模式
********************************************************************************
*/
typedef enum {
    INPUT_TRIG_NEGATIVE = 0x01,
    INPUT_TRIG_POSITIVE = 0x02,
    INPUT_TRIG_MAX
} INPUT_TRIG_E;

#define INPUT_TRIG_MASK      ((1 << INPUT_TRIG_MAX) - 1)

/*
********************************************************************************
*                  定义IO口输入电平
********************************************************************************
*/
#define LEVEL_NEGATIVE              0
#define LEVEL_POSITIVE              1


/*******************************************************************
** 函数名:     DAL_INPUT_InitDrv
** 函数描述:   初始输入驱动模块
** 参数:       无
** 返回:       无
********************************************************************/
void DAL_INPUT_InitDrv(void);

/*******************************************************************
** 函数名:     DAL_INPUT_ReadInstantStatus
** 函数描述:   读取当前IO口实时状态(无滤波)
** 参数:       [in] port: 输入口编号，见INPUT_IO_E
** 返回:       有效返回true，无效返回false
********************************************************************/
INT8U DAL_INPUT_ReadInstantStatus(INT8U port);

/*******************************************************************
** 函数名:     DAL_INPUT_ReadFilterStatus
** 函数描述:   读取滤波后输入口状态
** 参数:       [in] port: 输入口编号，见INPUT_IO_E
** 返回:       有效返回true，无效返回false
********************************************************************/
INT8U DAL_INPUT_ReadFilterStatus(INT8U port);

/*******************************************************************
** 函数名:     DAL_INPUT_InstallTriggerProc
** 函数描述:   注册输入口状态变化回调通知
** 参数:       [in] port:     输入口编号,见INPUT_IO_E
**             [in] trigmode: 信号跳变触发模式,INPUT_TRIG_E
**             [in] informer: 信号变化通知函数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN DAL_INPUT_InstallTriggerProc(INT8U port, INT8U trigmode, void (*informer)(INT8U port, INT8U mode));

/***************************************************************
** 函数名:    DAL_INPUT_SetFilterPara
**  功能描述:  输入口传感器滤波参数配置接口
** 参数:       [in] port:   输入口编号,见INPUT_IO_E
**             [in] ct_low: 低电平滤波时间，单位：毫秒
**             [in] ct_high:高电平滤波时间，单位：毫秒
*   返回值:    无
***************************************************************/
void DAL_INPUT_SetFilterPara(INT8U port, INT16U ct_low, INT16U ct_high);

#endif
