/********************************************************************************
**
** 文件名:     dal_pulse_drv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现里程脉冲采集驱动
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/04/09 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef DAL_PULSE_DRV_H
#define DAL_PULSE_DRV_H       1




/*******************************************************************
** 函数名称: DAL_PULSE_InitDrv
** 函数描述: 初始化模块
** 参数:     无
** 返回:     无
********************************************************************/
void DAL_PULSE_InitDrv(void);

/*******************************************************************
** 函数名称: DAL_PULSE_IsOpen
** 函数描述: 里程脉冲统计功能是否已打开
** 参数:     无
** 返回:     是返回TRUE,否返回FALSE
********************************************************************/
BOOLEAN DAL_PULSE_IsOpen(void);

/*******************************************************************
** 函数名称: DAL_PULSE_OpenPulseCalFunction
** 函数描述: 打开里程脉冲统计功能
** 参数:     [in] period: 采集间隔，单位：ms
** 返回:     成功返回TRUE,失败返回FALSE
********************************************************************/
BOOLEAN DAL_PULSE_OpenPulseCalFunction(INT16U period);

/*******************************************************************
** 函数名称: DAL_PULSE_ClosePulseCalFunction
** 函数描述: 关闭里程脉冲统计功能
** 参数:     [in] pinid:    GPIO统一编号,GPIO_PIN_E
** 返回:     成功返回TRUE,失败返回FALSE
********************************************************************/
BOOLEAN DAL_PULSE_ClosePulseCalFunction(void);

/*******************************************************************
** 函数名称: DAL_PULSE_OpenClockOutput
** 函数描述: 打开实时时钟1HZ脉冲输出
** 参数:     无
** 返回:     成功返回TRUE,失败返回FALSE
********************************************************************/
BOOLEAN DAL_PULSE_OpenClockOutput(void);

/*******************************************************************
** 函数名称: DAL_PULSE_CloseClockOutput
** 函数描述: 关闭实时时钟1HZ脉冲输出
** 参数:     [in] pinid:    GPIO统一编号,GPIO_PIN_E
** 返回:     成功返回TRUE,失败返回FALSE
********************************************************************/
BOOLEAN DAL_PULSE_CloseClockOutput(void);

/*******************************************************************
** 函数名称: DAL_PULSE_GetGroupNum
** 函数描述: 获取脉冲组数
** 参数:     无
** 返回:     成功返回组数
********************************************************************/
INT8U DAL_PULSE_GetGroupNum(void);

/*******************************************************************
** 函数名称: DAL_PULSE_GetPulse
** 函数描述: 获取脉冲数，从最旧开始获取
** 参数:     无
** 返回:     成功单组脉冲数,失败返回-1
********************************************************************/
INT32S DAL_PULSE_GetPulse(void);

/*******************************************************************
** 函数名称: DAL_PULSE_GetTotalPulse
** 函数描述: 获取复位重启后总脉冲数
** 参数:     无
** 返回:     脉冲数
********************************************************************/
INT32U DAL_PULSE_GetTotalPulse(void);

#endif

/************************ (C) COPYRIGHT 2011 XIAMEN YAXON.LTD *******************END OF FILE******/

