/********************************************************************************
**
** 文件名:     dal_hit_drv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现碰撞侧翻标定、检测功能
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/04/09 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef DAL_HIT_DRV_H
#define DAL_HIT_DRV_H        1


#if EN_GSENSOR > 0


/* 加速度传感器事件,按位表示 */
typedef enum {
    GSENSOR_EVENT_COLLISION = 0x01,        /* 碰撞报警 */
    GSENSOR_EVENT_ROLLOVER  = 0x02,        /* 侧翻报警 */
    GSENSOR_EVENT_VALID     = 0x80,        /* 重力加速度传感器正常 */
    GSENSOR_EVENT_MAX
} GSENSOR_EVENT_E;



/*******************************************************************
** 函数名:     DAL_HIT_InitDrv
** 函数描述:   模块初始化
** 参数:       无
** 返回:       无
********************************************************************/
void DAL_HIT_InitDrv(void);

/*******************************************************************
** 函数名:     DAL_HIT_SetGsensorPara
** 函数描述:   设置加速度传感器参数
**             [in]  acceleration:    加速度阈值,单位:0.1g
**             [in]  sensitivity:     时间灵敏度, 单位: ms
**             [in]  angle:           侧翻角度阈值
**             [in]  auto_report:     true:  开启自动定时上报,false: 关闭自动定时上报
**             [in]  period:          定时上报间隔周期, 单位: s
** 返回:       成功返回TRUE, 失败返回FALSE
********************************************************************/
BOOLEAN DAL_HIT_SetGsensorPara(INT8U acceleration, INT16U sensitivity, INT8U angle, BOOLEAN auto_report, INT8U period);

/*******************************************************************
** 函数名:     DAL_HIT_GetGsensorStatus
** 函数描述:   读取重力加速度传感器状态
** 参数:       [in] status: 重力传感器状态, GSENSOR_EVENT_E 事件组合
** 返回:       返回传感器状态, GSENSOR_EVENT_E 事件组合
********************************************************************/
INT8U DAL_HIT_GetGsensorStatus(void);

/*******************************************************************
** 函数名:     DAL_HIT_RegistEventHandler
** 函数描述:   注册事件处理器
** 参数:       [in] handler: 事件处理器,event为GSENSOR_EVENT_E事件组合
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN DAL_HIT_RegistEventHandler(void (*handler)(INT8U event));

/*******************************************************************
** 函数名:     DAL_HIT_StartCalibration
** 函数描述:   启动加速度传感器标定
** 参数:       无
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN DAL_HIT_StartCalibration(void);

/*******************************************************************
** 函数名:     DAL_HIT_StopCalibration
** 函数描述:   停止加速度传感器标定
** 参数:       无
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN DAL_HIT_StopCalibration(void);

#endif
#endif
