/******************************************************************************
**
** Filename:     yx_jieyou_drv.c
** Copyright:    
** Description:  该模块主要实现检测节油产品驱动
**
-------------------------------------------------------------------------------
**             Revision history
**-----------------------------------------------------------------------------
**| 2018/07/10 | nhong |  创建文件
*******************************************************************************/
#ifndef _yx_jieyou_drv_h_
#define _yx_jieyou_drv_h_

#include "hal_can_drv.h"
#include "yx_jieyou_cancheck.h"
#include "yx_jieyou_adcheck.h"

/*******************************************************************
** 函数名:     YX_JieYou_InitCanCheck
** 函数描述:   节油can检测初始化
** 参数:       无
** 返回:       无
********************************************************************/
void YX_JieYou_InitDrv(void);

/*******************************************************************
** 函数名:     YX_JieYou_Confirm
** 函数描述:   确认收到can消息
** 参数:       无
** 返回:       无
********************************************************************/
INT8U YX_JieYou_Confirm(INT8U com, CAN_DATA_T * candata);

/*******************************************************************
** 函数名:     YX_JieYou_IsConfirm
** 函数描述:   can通道是否已经确认
** 参数:       无
** 返回:       无
********************************************************************/
BOOLEAN YX_JieYou_IsConfirm(void);

/*******************************************************************
** 函数名:     YX_JieYou_GetCanCom
** 函数描述:   获取确认的can通道
** 参数:       无
** 返回:       无
********************************************************************/
INT8U YX_JieYou_GetCanCom(void);

/*******************************************************************
** 函数名:     YX_JieYou_SetCanFilterByMask
** 函数描述:   设置can滤波
** 参数:       无
** 返回:       无
********************************************************************/
BOOLEAN YX_JieYou_SetCanFilterByMask(INT8U idtype, INT8U idnum, INT32U *pfilterid, INT32U *pmaskid);

/*******************************************************************
** 函数名:     YX_JieYou_SetCanFilterByList
** 函数描述:   设置can滤波
** 参数:       无
** 返回:       无
********************************************************************/
BOOLEAN YX_JieYou_SetCanFilterByList(INT8U idtype, INT8U idnum, INT32U *pfilterid);

/*******************************************************************
** 函数名:     YX_JieYou_SendStatus
** 函数描述:   can标定状态发送
** 参数:       [in] 
** 返回:       无
********************************************************************/
BOOLEAN YX_JieYou_SendStatus(INT8U status, INT8U result);

#endif

