/******************************************************************************
**
** Filename:     yx_jieyou_cancheck.c
** Copyright:    
** Description:  该模块主要实现检测节油产品obd can引脚位置
**
-------------------------------------------------------------------------------
**             Revision history
**-----------------------------------------------------------------------------
**| 2018/07/10 | nhong |  创建文件
*******************************************************************************/
#ifndef _yx_jieyou_cancheck_h_
#define _yx_jieyou_cancheck_h_

/*******************************************************************
** 函数名:     YX_JieYou_InitCanCheck
** 函数描述:   节油can检测初始化
** 参数:       无
** 返回:       无
********************************************************************/
void YX_JieYou_InitCanCheck(void);

/*******************************************************************
** 函数名:     YX_JieYou_StartCanCheck
** 函数描述:   开始can检测
** 参数:       无
** 返回:       无
********************************************************************/
BOOLEAN YX_JieYou_StartCanCheck(void);

/*******************************************************************
** 函数名:     YX_JieYou_StopCanCheck
** 函数描述:   停止can检测
** 参数:       无
** 返回:       无
********************************************************************/
BOOLEAN YX_JieYou_StopCanCheck(void);

/*******************************************************************
** 函数名:     YX_JieYou_GetCanHigh
** 函数描述:   获取can高引脚编号
** 参数:       无
** 返回:       无
********************************************************************/
INT8U YX_JieYou_GetCanHigh(void);

/*******************************************************************
** 函数名:     YX_JieYou_GetCanLow
** 函数描述:   获取can低引脚编号
** 参数:       无
** 返回:       无
********************************************************************/
INT8U YX_JieYou_GetCanLow(void);

/*******************************************************************
** 函数名:     YX_JieYou_SetCanHighIo
** 函数描述:   设置can高引脚编号
** 参数:       无
** 返回:       无
********************************************************************/
BOOLEAN YX_JieYou_SetCanHighIo(INT8U pin);

/*******************************************************************
** 函数名:     YX_JieYou_SetCanLowIo
** 函数描述:   设置can低引脚编号
** 参数:       无
** 返回:       无
********************************************************************/
BOOLEAN YX_JieYou_SetCanLowIo(INT8U pin);

/*******************************************************************
** 函数名:     YX_JieYou_IsChecking
** 函数描述:   是否在检测中
** 参数:       无
** 返回:       无
********************************************************************/
BOOLEAN YX_JieYou_IsChecking(void);

#endif
