/******************************************************************************
**
** Filename:     yx_jieyou_adcheck.c
** Copyright:    
** Description:  该模块主要实现检测节油产品obd can引脚 AD值检测，用于生产检测
**
-------------------------------------------------------------------------------
**             Revision history
**-----------------------------------------------------------------------------
**| 2018/07/31 | nhong |  创建文件
*******************************************************************************/
#ifndef _yx_jieyou_adcheck_h_
#define _yx_jieyou_adcheck_h_

/*******************************************************************
** 函数名:     YX_JieYou_InitCanCheck
** 函数描述:   节油ad检测初始化
** 参数:       无
** 返回:       无
********************************************************************/
void YX_JieYou_InitADCheck(void);

/*******************************************************************
** 函数名:     YX_JieYou_StartADCheck
** 函数描述:   启动AD检测
** 参数:       无
** 返回:       无
********************************************************************/
void YX_JieYou_StartADCheck(void (*result)(INT16U *ad, INT8U count));


#endif

