/********************************************************************************
**
** 文件名:     bal_maplist.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:    该模块主要实现映射链表管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2011/11/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef MAPLIST
#define MAPLIST


/* 节点结构体 */
typedef struct mapnode{
    INT16S prev;
    INT16S next;
} MAPNODE;

/* 链表结构体 */
typedef struct {
    INT16S  head;
    INT16S  tail;
    INT32U  item;
} MAP_LIST_T;

/*******************************************************************
** 函数名:     bal_CheckMapList
** 函数描述:   检测链表的有效性
** 参数:       [in] lp:      链表指针
**             [in] memptr:  映射表起始地址
**             [in] max_num: 最大记录数
** 返回:       有效返回true，无效返回false
********************************************************************/
BOOLEAN bal_CheckMapList(MAP_LIST_T *lp, INT8U *memptr, INT16U max_num);

/*******************************************************************
** 函数名:     bal_InitMapList
** 函数描述:   初始化链表
** 参数:       [in] lp:      链表指针
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN bal_InitMapList(MAP_LIST_T *lp);

/*******************************************************************
** 函数名:     bal_MapListItem
** 函数描述:   获取链表节点个数
** 参数:       [in]  lp:        链表
** 返回:       链表节点个数
********************************************************************/
INT32U bal_MapListItem(MAP_LIST_T *lp);

/*******************************************************************
** 函数名:     bal_GetMapListHead
** 函数描述:   获取链表头节点
** 参数:       [in]  lp:        链表
** 返回:       返回记录位置编号，返回-1表示无头节点
********************************************************************/
INT16S bal_GetMapListHead(MAP_LIST_T *lp);

/*******************************************************************
** 函数名:     bal_GetMapListTail
** 函数描述:   获取链表尾节点
** 参数:       [in]  lp:        链表
** 返回:       返回记录位置编号，返回-1表示无尾节点记录
********************************************************************/
INT16S bal_GetMapListTail(MAP_LIST_T *lp);

/*******************************************************************
** 函数名:     bal_MapListNextEle
** 函数描述:   获取指定节点的后一节点
** 参数:       [in] memptr:  映射表起始地址
**             [in] pos:     当前记录位置编号
** 返回:       返回下一个记录位置编号，返回-1表示无后节点记录
********************************************************************/
INT16S bal_MapListNextEle(INT8U *memptr, INT16S pos);

/*******************************************************************
** 函数名:     bal_MapListPrvEle
** 函数描述:   获取指定节点的前一节点
** 参数:       [in] memptr:  映射表起始地址
**             [in] pos:     当前记录位置编号
** 返回:       返回前一个记录位置编号，-1表示无前节点记录
********************************************************************/
INT16S bal_MapListPrvEle(INT8U *memptr, INT16S pos);

/*******************************************************************
** 函数名:     bal_DelMapListEle
** 函数描述:   删除指定节点，并返回下一个记录的位置编号
** 参数:       [in] lp:  链表
**             [in] memptr:  映射表起始地址
**             [in] pos: 当前记录位置编号
** 返回:       返回记录pos的下一个记录位置编号，返回-1表示无后节点记录
********************************************************************/
INT16S bal_DelMapListEle(MAP_LIST_T *lp, INT8U *memptr, INT16S pos);

/*******************************************************************
** 函数名:     bal_DelMapListHead
** 函数描述:   删除链表头节点
** 参数:       [in] lp:      链表
**             [in] memptr:  映射表起始地址
** 返回:       链表头节点; 如返回-1, 则表示不存在链表头节点
********************************************************************/
INT16S bal_DelMapListHead(MAP_LIST_T *lp, INT8U *memptr);

/*******************************************************************
** 函数名:     bal_DelMapListTail
** 函数描述:   删除链表尾节点
** 参数:       [in] lp:      链表
**             [in] memptr:  映射表起始地址
** 返回:       链表头节点; 如返回-1, 则表示不存在链表尾节点
********************************************************************/
INT16S bal_DelMapListTail(MAP_LIST_T *lp, INT8U *memptr);

/*******************************************************************
** 函数名:     bal_AppendMapListEle
** 函数描述:   在链表尾上追加一个节点
** 参数:       [in] lp:      链表
**             [in] memptr:  映射表起始地址
**             [in] pos:     待追加节点编号
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN bal_AppendMapListEle(MAP_LIST_T *lp, INT8U *memptr, INT16S pos);

/*******************************************************************
** 函数名:     bal_InsertMapListHead
** 函数描述:   在链表头插入一个节点
** 参数:       [in] lp:      链表
**             [in] memptr:  映射表起始地址
**             [in] pos:     待插入的节点位置编号
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN bal_InsertMapListHead(MAP_LIST_T *lp, INT8U *memptr, INT16S pos);

/*******************************************************************
** 函数名:     bal_BInsertMapListEle
** 函数描述:   在指定节点前插入一个新节点
** 参数:       [in] lp:      链表
**             [in] memptr:  映射表起始地址
**             [in] curpos:  当前节点位置编号
**             [in] inspos:  待插入的节点位置编号
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN bal_BInsertMapListEle(MAP_LIST_T *lp, INT8U *memptr, INT16S curpos, INT16S inspos);

/*******************************************************************
** 函数名:     bal_AInsertMapListEle
** 函数描述:   在指定节点前插入一个新节点
** 参数:       [in] lp:      链表
**             [in] memptr:  映射表起始地址
**             [in] curpos:  当前节点位置编号
**             [in] inspos:  待插入的节点位置编号
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN bal_AInsertMapListEle(MAP_LIST_T *lp, INT8U *memptr, INT16S curpos, INT16S inspos);

/*******************************************************************
** 函数名:     bal_InitMemMapList
** 函数描述:   将一块内存初始化成链表缓冲区
** 参数:       [in] lp:      链表
**             [in] memptr:  映射表起始地址
**             [in] max_num: 最大记录数
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN bal_InitMemMapList(MAP_LIST_T *lp, INT8U *memptr, INT16U max_num);


#endif
