/********************************************************************************
**
** 文件名:     bal_stream.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   实现数据流管理功能
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2007/04/11 | 陈从华 |  创建该文件
**| 2008/10/13 | 任赋   |  使用原车台程序实现和接口
*********************************************************************************/
#ifndef DEF_STREAM
#define DEF_STREAM

#define STREAMMEM	INT8U

typedef struct {
    STREAMMEM	*StartPtr;
    STREAMMEM   *CurPtr;
    INT32U       Len;
    INT32U       MaxLen;
} STREAM_T;


/*******************************************************************
** 函数名:     bal_InitStrm
** 函数描述:   初始化数据流
** 参数:       [in]  Sp:              数据流
**             [in]  Bp:              数据流所管理内存地址
**             [in]  MaxLen:          数据流所管理内存字节数
** 返回:       成功或失败
********************************************************************/
BOOLEAN bal_InitStrm(STREAM_T *Sp, STREAMMEM *Bp, INT32U MaxLen);

/*******************************************************************
** 函数名:     bal_GetStrmLeftLen
** 函数描述:   获取数据流中剩余的可用字节数
** 参数:       [in]  Sp:              数据流
** 返回:       数据流剩余的可用字节数
********************************************************************/
INT32U  bal_GetStrmLeftLen(STREAM_T *Sp);

/*******************************************************************
** 函数名:     bal_GetStrmLen
** 函数描述:   获取数据流中已用字节数
** 参数:       [in]  Sp:              数据流
** 返回:       数据流已用字节数
********************************************************************/
INT32U  bal_GetStrmLen(STREAM_T *Sp);

/*******************************************************************
** 函数名:     bal_GetStrmMaxLen
** 函数描述:   获取数据流缓存总长度
** 参数:       [in]  Sp:              数据流
** 返回:       数据流的最大长度
********************************************************************/
INT32U  bal_GetStrmMaxLen(STREAM_T *Sp);

/*******************************************************************
** 函数名:     bal_GetStrmPtr
** 函数描述:   获取数据流当前读/写指针
** 参数:       [in]  Sp:              数据流
** 返回:       当前读/写指针
********************************************************************/
STREAMMEM *bal_GetStrmPtr(STREAM_T *Sp);

/*******************************************************************
** 函数名:     bal_GetStrmStartPtr
** 函数描述:   获取数据流所管理内存的地址
** 参数:       [in]  Sp:              数据流
** 返回:       所管理内存地址
********************************************************************/
STREAMMEM *bal_GetStrmStartPtr(STREAM_T *Sp);

/*******************************************************************
** 函数名:     bal_MovStrmPtr
** 函数描述:   移动数据流中读/写指针
** 参数:       [in]  Sp:              数据流
**             [in]  Len:             移动字节数
** 返回:       无
********************************************************************/
void    bal_MovStrmPtr(STREAM_T *Sp, INT32U Len);

/*******************************************************************
** 函数名:     bal_WriteBYTE_Strm
** 函数描述:   往数据流中写入一个字节数据
** 参数:       [in]  Sp:              数据流
**             [in]  writebyte:       写入的数据
** 返回:       无
********************************************************************/
void    bal_WriteBYTE_Strm(STREAM_T *Sp, INT8U writebyte);

/*******************************************************************
** 函数名:     bal_WriteHWORD_Strm
** 函数描述:   往数据流中写入一个半字(16位)数据, 大端模式(高字节先写，低字节后写)
** 参数:       [in]  Sp:              数据流
**             [in]  writeword:       写入的数据
** 返回:       无
********************************************************************/
void bal_WriteHWORD_Strm(STREAM_T *Sp, INT16U writeword);

/*******************************************************************
** 函数名:     bal_LE_WriteHWORD_Strm
** 函数描述:   往数据流中写入一个半字(16位)数据, 小端模式(低字节先写，高字节后写)
** 参数:       [in]  Sp:              数据流
**             [in]  writeword:       写入的数据
** 返回:       无
********************************************************************/
void bal_LE_WriteHWORD_Strm(STREAM_T *Sp, INT16U writeword);

/*******************************************************************
** 函数名:     bal_WriteLONG_Strm
** 函数描述:   往数据流中写入一个半字(32位)数据, 大端模式(高字节先写，低字节后写)
** 参数:       [in]  Sp:              数据流
**             [in]  writeword:       写入的数据
** 返回:       无
********************************************************************/
void bal_WriteLONG_Strm(STREAM_T *sp, INT32U writelong);

/*******************************************************************
** 函数名:     bal_LE_WriteLONG_Strm
** 函数描述:   往数据流中写入一个半字(32位)数据, 小端模式(低字节先写，高字节后写)
** 参数:       [in]  Sp:              数据流
**             [in]  writeword:       写入的数据
** 返回:       无
********************************************************************/
void bal_LE_WriteLONG_Strm(STREAM_T *sp, INT32U writelong);

/*******************************************************************
** 函数名:     bal_WriteLF_Strm
** 函数描述:   往数据流中写入换行符, 即写入'\r'和'\n'
** 参数:       [in]  Sp:              数据流
** 返回:       无
********************************************************************/
void    bal_WriteLF_Strm(STREAM_T *Sp);

/*******************************************************************
** 函数名:     bal_WriteCR_Strm
** 函数描述:   往数据流中写入回车符, 即写入'\r''
** 参数:       [in]  Sp:              数据流
** 返回:       无
********************************************************************/
void    bal_WriteCR_Strm(STREAM_T *Sp);

/*******************************************************************
** 函数名:     bal_WriteSTR_Strm
** 函数描述:   往数据流中写入字符串
** 参数:       [in]  Sp:              数据流
**             [in]  Ptr:             写入的字符串指针
** 返回:       无
********************************************************************/
void    bal_WriteSTR_Strm(STREAM_T *Sp, char *Ptr);

/*******************************************************************
** 函数名:     bal_WriteDATA_Strm
** 函数描述:   往数据流中写入一块内存数据
** 参数:       [in]  Sp:              数据流
**             [in]  Ptr:             写入的数据块地址
**             [in]  Len:             写入的数据块字节数
** 返回:       无
********************************************************************/
void    bal_WriteDATA_Strm(STREAM_T *Sp, INT8U *Ptr, INT32U Len);

/*******************************************************************
** 函数名:     bal_ReadBYTE_Strm
** 函数描述:   从数据流中读取一个字节
** 参数:       [in]  Sp:              数据流
** 返回:       读取到的字节
********************************************************************/
INT8U   bal_ReadBYTE_Strm(STREAM_T *Sp);

/*******************************************************************
** 函数名:     bal_ReadHWORD_Strm
** 函数描述:   从数据流中读取一个半字(16位)数据,大端模式(先读为高字节，后读为低字节)
** 参数:       [in]  Sp:              数据流
** 返回:       读取到的字
********************************************************************/
INT16U bal_ReadHWORD_Strm(STREAM_T *Sp);

/*******************************************************************
** 函数名:     bal_LE_ReadHWORD_Strm
** 函数描述:   从数据流中读取一个半字(16位)数据,小端模式(先读为低字节，后读为高字节)
** 参数:       [in]  Sp:              数据流
** 返回:       读取到的字
********************************************************************/
INT16U bal_LE_ReadHWORD_Strm(STREAM_T *Sp);

/*******************************************************************
** 函数名:     bal_ReadLONG_Strm
** 函数描述:   从数据流中读取一个半字(32位)数据,大端模式(先读为高字节，后读为低字节)
** 参数:       [in]  Sp:              数据流
** 返回:       读取到的字
********************************************************************/
INT32U bal_ReadLONG_Strm(STREAM_T *Sp);

/*******************************************************************
** 函数名:     bal_LE_ReadLONG_Strm
** 函数描述:   从数据流中读取一个半字(32位)数据,小端模式(先读为低字节，后读为高字节)
** 参数:       [in]  Sp:              数据流
** 返回:       读取到的字
********************************************************************/
INT32U bal_LE_ReadLONG_Strm(STREAM_T *Sp);

/*******************************************************************
** 函数名:     bal_ReadDATA_Strm
** 函数描述:   从数据流中读取指定长度的数据内容
** 参数:       [in]  Sp:              数据流
**             [out] Ptr:             读取到的数据存放的内存地址
**             [in]  Len:             读取的数据长度
** 返回:       无
********************************************************************/
void    bal_ReadDATA_Strm(STREAM_T *Sp, INT8U *Ptr, INT32U Len);

/*******************************************************************
** 函数名:     bal_STREAM_GetBufferStream
** 函数描述:   获取流缓存，目前流缓存最大为2000字节
**             备注：本接口用于需要暂时需要缓存地方，如各类外设组帧发送，注意不要冲突使用
** 参数:       无
** 返回:       放回流指针
********************************************************************/
STREAM_T *bal_STREAM_GetBufferStream(void);

#endif
