/*
********************************************************************************
** 文件名:     yx_exuart_man.h
** 版权所有:   (c) 2017 厦门雅迅网络股份有限公司
** 文件描述:    物理扩展串口应用层程序接口
** 创建人：        谢金成，2017.7.13
********************************************************************************
*/
#ifndef YX_EXUART_MAN_H_
#define YX_EXUART_MAN_H_

/*
*********************************************************************************
*                   数据类型和宏定义
*********************************************************************************
*/
// 扩展串口编号定义
typedef enum {
    EXUART_IDX1,    /* S32K调试串口 */
    EXUART_IDX2,    /* 外置定位模块串口 */
    MAX_EXUART_IDX
} EXUART_IDX_E;

static INT8U const s_exuart_idx[MAX_EXUART_IDX] = {UART_IDX3, UART_IDX1};

/*******************************************************************************
 ** 函数名:    YX_ExUart_Init
 ** 函数描述:  扩展串口初始化
 ** 参数:       无
 ** 返回:       无
 ******************************************************************************/
void YX_ExUart_Init(void);

#endif /* YX_EXUART_MAN_H_ */

