/********************************************************************************
**
** 文件名:     bal_input_drv.h
** 版权所有:   (c) 1998-2017 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现I/O口传感器输入状态检测
**
*********************************************************************************
**                  修改历史记录
**===============================================================================
**| 日期              | 作者        |  修改记录
**===============================================================================
**| 2017/05/15 | 黄运峰    |  移植、修改、规范化
********************************************************************************/
#ifndef BAL_INPUTDRV_H
#define BAL_INPUTDRV_H      1

#include "bal_input_reg.h"
/*
*********************************************************************************
*                   数据类型及宏定义
*********************************************************************************
*/
// 定义触发模式
#define TRIGGER_NEGATIVE            0x01
#define TRIGGER_POSITIVE            0x02

#define MASK_TRIGGER            (TRIGGER_NEGATIVE | TRIGGER_POSITIVE)

// 定义IO口输入电平
#define LEVEL_NEGATIVE              0
#define LEVEL_POSITIVE              1

/*
*********************************************************************************
*                   对外接口声明
*********************************************************************************
*/
/********************************************************************************
** 函数名:     bal_input_ReadSensorStatus
** 函数描述:   直接读取当前IO口状态
** 参数:       [in] type:输入口类型;
** 返回:       有效返回true，无效返回false
********************************************************************************/
INT8U bal_input_ReadSensorStatus(INT8U type);

/********************************************************************************
** 函数名:     bal_input_InitDrv
** 函数描述:   初始输入驱动模块
** 参数:       无
** 返回:       无
********************************************************************************/
void bal_input_InitDrv(void);

/********************************************************************************
** 函数名:     bal_input_ReadSensorFilterStatus
** 函数描述:   读取滤波后输入口状态
** 参数:       [in] type:输入口类型;
** 返回:       有效返回true，无效返回false
********************************************************************************/
INT8U bal_input_ReadSensorFilterStatus(INT8U type);

/********************************************************************************
** 函数名:     bal_input_InstallTriggerProc
** 函数描述:   输入口状态变化注册接口
** 参数:       [in] type:输入口类型;
**             [in] trigmode:触发模式;
**             [in] informer:信号变化通知函数
** 返回:       成功返回true，失败返回false
********************************************************************************/
BOOLEAN bal_input_InstallTriggerProc(INT8U type, INT8U trigmode, void (*informer)(INT8U type, INT8U mode));

/********************************************************************************
**  函数名:    bal_input_SetFilterPara
**  功能描述:  传感器管脚滤波参数配置接口
**  参数:        [in] port:   传感器管脚编号，按照通信协议
**             [in] ct_low: 低电平时间，单位：毫秒
**             [in] ct_high:高电平时间，单位：毫秒
*   返回值:    无
********************************************************************************/
void bal_input_SetFilterPara(INT8U port, INT16U ct_low, INT16U ct_high);

//-------------------------------------------------------------------------------
#endif /* BAL_INPUTDRV_H */
