/********************************************************************************
**
** 文件名:     bal_output_drv.c
** 版权所有:   (c) 1998-2017 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现I/O输出驱动控制
**
*********************************************************************************
**                  修改历史记录
**===============================================================================
**| 日期              | 作者        |  修改记录
**===============================================================================
**| 2017/05/15 | 黄运峰    |  移植、修改、规范化
********************************************************************************/
#ifndef BAL_OUTPUT_DRV_H
#define BAL_OUTPUT_DRV_H    1

#include "bal_output_reg.h"
/*
*********************************************************************************
*                   数据类型及宏定义
*********************************************************************************
*/
typedef enum {
    MODE_HIGH,
    MODE_MID,
    MODE_LOW,
    MAX_MODE
} OUTPUT_PRIOR_E;
/*
*********************************************************************************
*                   对外接口声明
*********************************************************************************
*/
/********************************************************************************
** 函数名:     bal_output_InitDrv
** 函数描述:   初始化端口驱动
** 参数:       无
** 返回:       无
********************************************************************************/
void bal_output_InitDrv(void);

/********************************************************************************
** 函数名:     bal_output_StartFlashPort
** 函数描述:   启动输出控制接口
** 参数:       [in]	port:	    输入口类型,见OUTPUT_IO_E
**             [in]	prior:	    优先级，见OUTPUT_PRIOR_E
**             [in]	cycle:	    次数
**             [in]	time_high:	高电平持续时间，单位：100ms
**             [in]	time_low:	低电平持续时间，单位：100ms
**             [in]	informer:	通知回调函数;
**             [in]	pdata:	    特征值，回调给informer
** 返回:       无
********************************************************************************/
void bal_output_StartFlashPort(INT8U port, INT8U prior, INT16U cycle, INT8U time_high, INT8U time_low, void (*informer)(INT8U, void *), void *pdata);

/********************************************************************************
** 函数名:     bal_output_StopFlashPort
** 函数描述:   停止输出控制接口
** 参数:       [in]	port:	输入口类型,见OUTPUT_IO_E
**             [in]	prior:	优先级，见OUTPUT_PRIOR_E
** 返回:       无
********************************************************************************/
void bal_output_StopFlashPort(INT8U port, INT8U prior);

/********************************************************************************
** 函数名:     bal_output_InstallPermnentPort
** 函数描述:   启动永久控制输出口接口，常用于闪灯控制
** 参数:       [in]	port:	    输入口类型,见OUTPUT_IO_E
**             [in]	time_high:	高电平持续时间，单位：100ms
**             [in]	time_low:	低电平持续时间，单位：100ms
** 返回:       无
********************************************************************************/
void bal_output_InstallPermnentPort(INT8U port, INT8U time_high, INT8U time_low);

/********************************************************************************
** 函数名:     bal_output_RemovePermnentPort
** 函数描述:   停止永久控制输出口接口，常用于闪灯控制
** 参数:       [in]	port:	输入口类型,见OUTPUT_IO_E
** 返回:       无
********************************************************************************/
void bal_output_RemovePermnentPort(INT8U port);

/********************************************************************************
** 函数名:     bal_output_PortIsFlashing
** 函数描述:   判断指定端口是否正在被驱动
** 参数:       [in]	port:	输入口类型,见OUTPUT_IO_E
** 返回:       TRUE：端口已被驱动
**			   FALSE：端口未被驱动
********************************************************************************/
BOOLEAN bal_output_PortIsFlashing(INT8U port);

/********************************************************************************
** 函数名:     bal_output_GetPortStatus
** 函数描述:   读取指定端口的当前状态
** 参数:       [in]	port:	输入口类型,见OUTPUT_IO_E
** 返回:       1：高电平状态
**			   0：低点平状态
********************************************************************************/
INT8S bal_output_GetPortStatus(INT8U port);
/********************************************************************************
** 函数名:     bal_output_GetPortStatus
** 函数描述:   读取指定端口的当前状态
** 参数:       [in]	port:	输入口类型,见OUTPUT_IO_E
** 返回:       TRUE： 操作成功
**			   FALSE：操作失败
********************************************************************************/
BOOLEAN bal_output_CtlPort(INT8U port, INT8U level);

//-------------------------------------------------------------------------------
#endif /* BAL_OUTPUT_DRV_H */
