/********************************************************************************
**
** 文件名:     yx_jt_linkman.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现服务器UDP和TCP链路统一管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2011/02/09 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef JT_LINKMAN_H
#define JT_LINKMAN_H         1

#include "yx_jt1_tlink.h"
#include "yx_jt2_tlink.h"


/*******************************************************************
** 函数名:     YX_JT_InitLinkMan
** 函数描述:   中心前置机链路管理
** 参数:       无
** 返回:       无
********************************************************************/
void YX_JT_InitLinkMan(void);

/*******************************************************************
** 函数名:     YX_JT_OpenLink
** 函数描述:   申请应用
** 参数:       无
** 返回:       无
********************************************************************/
void YX_JT_OpenLink(void);

/*******************************************************************
** 函数名:     YX_JT_CloseLink
** 函数描述:   释放应用
** 参数:       无
** 返回:       无
********************************************************************/
void YX_JT_CloseLink(void);

/*******************************************************************
** 函数名:     YX_JT_GetPositionInfo
** 函数描述:   获取主动上报位置信息
** 参数:       [in] wstrm: 数据流
** 返回:       无
********************************************************************/
void YX_JT_GetPositionInfo(STREAM_T *wstrm);

/*******************************************************************
** 函数名:     YX_JT_LinkCanCom
** 函数描述:   中心前置机的GPRS通道是否可以通信(条件：不处于通话中/GPRS已激活/前置机已登入)
** 参数:       无
** 返回:       可以正常收发数据返回true，否则返回false
********************************************************************/
BOOLEAN YX_JT_LinkCanCom(void);

/*******************************************************************
** 函数名:     YX_JTT_LinkCanCom
** 函数描述:   TCP通道是否可以通信
** 参数:       [in] com: TCP通道, 见TCP_USER_E
** 返回:       是返回true，否返回false
********************************************************************/
BOOLEAN YX_JTT_LinkCanCom(INT8U com);

/*******************************************************************
** 函数名:     YX_JTU_LinkCanCom
** 函数描述:   UDP通道是否可以通信
** 参数:       [in] com: UDP通道, 见UDP_USER_E
** 返回:       是返回true，否返回false
********************************************************************/
BOOLEAN YX_JTU_LinkCanCom(INT8U com);

/*******************************************************************
** 函数名:     YX_JT_LinkCanCom
** 函数描述:   判断是否存在GPRS通道可以通信
** 参数:       无
** 返回:       是返回true，否返回false
********************************************************************/
BOOLEAN YX_JT_LinkCanCom(void);

/*******************************************************************
** 函数名:     YX_JT_GetComAttrib
** 函数描述:   获取通信通道
** 参数:       [in] type:业务类型
** 返回:       返回通信通道，见SM_ATTR_
********************************************************************/
INT32U YX_JT_GetComAttrib(INT8U type);



#endif

