/********************************************************************************
**
** 文件名:     yx_jt1_tsend.c
** 版权所有:   (c) 2005-2012 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现交通部协议第一服务器TCP数据发送
** 
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2013/10/21 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef H_JT1_TSEND
#define H_JT1_TSEND           1

#include "yx_protocol_type.h"

/*******************************************************************
** 函数名:     YX_JTT1_InitSend
** 函数描述:   初始化发送模块
** 参数:       无
** 返回:       无
********************************************************************/
void YX_JTT1_InitSend(void);

/*******************************************************************
** 函数名:     YX_JTT1_SendHeart
** 函数描述:   发送链路维护帧
** 参数:       无
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN YX_JTT1_SendHeart(void);

/*******************************************************************
** 函数名:     YX_JTT1_SendReqRegist
** 函数描述:   发送注册请求数据包
** 参数:       无
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN YX_JTT1_SendReqRegist(void);

/*******************************************************************
** 函数名:     YX_JTT1_SendReqUnregist
** 函数描述:   发送注销请求数据包
** 参数:       无
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN YX_JTT1_SendReqUnregist(void);

/*******************************************************************
** 函数名:     YX_JTT1_SendReqLogin
** 函数描述:   发送登陆请求数据包
** 参数:       无
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN YX_JTT1_SendReqLogin(void);

/*******************************************************************
** 函数名:     YX_JTT1_SendFromGPRS
** 函数描述:   发送数据
** 参数:       [in] attrib:   通道属性和重发属性，见PROTOCOL_COM_T
**             [in] data:     数据指针
**             [in] datalen:  数据长度
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN YX_JTT1_SendFromGPRS(PROTOCOL_COM_T *attrib, INT8U *data, INT16U datalen);



#endif
