/********************************************************************************
**
** 文件名:     yx_jt2_tlink.h
** 版权所有:   (c) 2005-2012 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现交通部协议第一服务器TCP注册、登陆管理
** 
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2013/10/21 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef H_JT2_TLINK
#define H_JT2_TLINK           1

#include "yx_jt2_tsend.h"
#include "yx_jt2_trecv.h"

/*******************************************************************
** 函数名:     YX_JTT2_InitLink
** 函数描述:   连接模块初始化
** 参数:       无
** 返回:       无
********************************************************************/
void YX_JTT2_InitLink(void);

/*******************************************************************
** 函数名:     YX_JTT2_LinkIsOpen
** 函数描述:   链路流程是否已开启
** 参数:       无
** 返回:       是返回true，否返回false
********************************************************************/
BOOLEAN YX_JTT2_LinkIsOpen(void);

/*******************************************************************
** 函数名:     YX_JTT2_OpenLink
** 函数描述:   申请应用
** 参数:       无
** 返回:       已登入返回true，为登入返回false
********************************************************************/
BOOLEAN YX_JTT2_OpenLink(void);

/*******************************************************************
** 函数名:     YX_JTT2_CloseLink
** 函数描述:   释放应用
** 参数:       无
** 返回:       已登入返回true，为登入返回false
********************************************************************/
BOOLEAN YX_JTT2_CloseLink(void);

/*******************************************************************
** 函数名:     YX_JTT2_LinkInformGprsActived
** 函数描述:   GPRS已激活/已去活回调
** 参数:       [in]  result:  true－表示激活成功，flase表示去活回调
** 返回:       无
********************************************************************/
void YX_JTT2_LinkInformGprsActived(INT8U result);

/*******************************************************************
** 函数名:     YX_JTT2_LinkInformConnect
** 函数描述:   socket已连接/断开回调处理
** 参数:       [in]  result:  true－表示已连接，flase表示已断开
** 返回:       无
********************************************************************/
void YX_JTT2_LinkInformConnect(INT8U result);

/*******************************************************************
** 函数名:     YX_JTT2_LinkInformReged
** 函数描述:   注册结果通知
** 参数:       [in]  result:  0－注册成功,1-车辆已被注册,2-数据库中无车辆,3-终端已被注册,4-数据库中无终端
**             [in]  sptr:    数据指针
**             [in]  slen:    数据长度
** 返回:       无
********************************************************************/
void YX_JTT2_LinkInformReged(INT8U result, INT8U *sptr, INT8U slen);

/*******************************************************************
** 函数名:     YX_JTT2_LinkInformLoged
** 函数描述:   登入结果通知
** 参数:       [in]  result:  true－成功，flase-失败
** 返回:       无
********************************************************************/
void YX_JTT2_LinkInformLoged(INT8U result);

/*******************************************************************
** 函数名:     YX_JTT2_LinkInformQuery
** 函数描述:   链路维护通知
** 参数:       [in] index:传递参数,根据具体参数
** 返回:       无
********************************************************************/
void YX_JTT2_LinkInformQuery(void *index);

/*******************************************************************
** 函数名:     YX_JTT2_LinkReconnect
** 函数描述:   链路socket断开后再重新连接
** 参数:       [in] delay: 重新连接等待时间，单位秒，0－立即断开重连
** 返回:       无
********************************************************************/
void YX_JTT2_LinkReconnect(INT32U delay);

/*******************************************************************
** 函数名:     YX_JTT2_LinkIsLoged
** 函数描述:   是否已登入
** 参数:       无
** 返回:       是返回true，否返回false
********************************************************************/
BOOLEAN YX_JTT2_LinkIsLoged(void);

/*******************************************************************
** 函数名:     YX_JTT2_LinkIsReged
** 函数描述:   链路是否已注册
** 参数:       无
** 返回:       是返回true，否返回false
********************************************************************/
BOOLEAN YX_JTT2_LinkIsReged(void);

/*******************************************************************
** 函数名:     YX_JTT2_LinkIsConnect
** 函数描述:   链路socket是否已连接
** 参数:       无
** 返回:       是返回true，否返回false
********************************************************************/
BOOLEAN YX_JTT2_LinkIsConnect(void);

/*******************************************************************
** 函数名:     YX_JTT2_LinkCanCom
** 函数描述:   通道是否可以通信
** 参数:       无
** 返回:       是返回true，否返回false
********************************************************************/
BOOLEAN YX_JTT2_LinkCanCom(void);



#endif


