/********************************************************************************
**
** 文件名:     yx_jt1_ulink.h
** 版权所有:   (c) 2005-2012 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现交通部协议第一服务器TCP注册、登陆管理
** 
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2013/10/21 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef H_JT1_ULINK
#define H_JT1_ULINK           1

#include "yx_jt1_tsend.h"
#include "yx_jt1_trecv.h"

/*******************************************************************
** 函数名:     YX_JTU1_InitLink
** 函数描述:   连接模块初始化
** 参数:       无
** 返回:       无
********************************************************************/
void YX_JTU1_InitLink(void);

/*******************************************************************
** 函数名:     YX_JTU1_GetLinkParaIndex
** 函数描述:   获取TCP链路ip参数索引号
** 参数:       无
** 返回:       返回当前参数索引号
********************************************************************/
INT8U YX_JTU1_GetLinkParaIndex(void);

/*******************************************************************
** 函数名:     YX_JTU1_LinkInformGprsActived
** 函数描述:   GPRS已激活/已去活回调
** 参数:       [in]  result:  true－表示激活成功，flase表示去活回调
** 返回:       无
********************************************************************/
void YX_JTU1_LinkInformGprsActived(INT8U result);

/*******************************************************************
** 函数名:     YX_JTU1_LinkInformConnect
** 函数描述:   socket已连接/断开回调处理
** 参数:       [in]  result:  true－表示已连接，flase表示已断开
** 返回:       无
********************************************************************/
void YX_JTU1_LinkInformConnect(INT8U result);

/*******************************************************************
** 函数名:     YX_JTU1_LinkInformReged
** 函数描述:   注册结果通知
** 参数:       [in]  result:  0－注册成功,1-车辆已被注册,2-数据库中无车辆,3-终端已被注册,4-数据库中无终端
**             [in]  sptr:    数据指针
**             [in]  slen:    数据长度
** 返回:       无
********************************************************************/
void YX_JTU1_LinkInformReged(INT8U result, INT8U *sptr, INT8U slen);

/*******************************************************************
** 函数名:     YX_JTU1_LinkInformLoged
** 函数描述:   登入结果通知
** 参数:       [in]  result:  true－成功，flase-失败
** 返回:       无
********************************************************************/
void YX_JTU1_LinkInformLoged(INT8U result);

/*******************************************************************
** 函数名:     YX_JTU1_LinkInformQuery
** 函数描述:   链路维护通知
** 参数:       [in] index:传递参数,根据具体参数
** 返回:       无
********************************************************************/
void YX_JTU1_LinkInformQuery(void *index);

/*******************************************************************
** 函数名:     YX_JTU1_LinkIsLoged
** 函数描述:   是否已登入
** 参数:       无
** 返回:       是返回true，否返回false
********************************************************************/
BOOLEAN YX_JTU1_LinkIsLoged(void);

/*******************************************************************
** 函数名:     YX_JTU1_LinkIsReged
** 函数描述:   链路是否已注册
** 参数:       无
** 返回:       是返回true，否返回false
********************************************************************/
BOOLEAN YX_JTU1_LinkIsReged(void);

/*******************************************************************
** 函数名:     YX_JTU1_LinkIsConnect
** 函数描述:   链路socket是否已连接
** 参数:       无
** 返回:       是返回true，否返回false
********************************************************************/
BOOLEAN YX_JTU1_LinkIsConnect(void);

/*******************************************************************
** 函数名:     YX_JTU1_LinkIsActived
** 函数描述:   链路流程是否已启动
** 参数:       无
** 返回:       是返回true，否返回false
********************************************************************/
BOOLEAN YX_JTU1_LinkIsActived(void);

/*******************************************************************
** 函数名:     YX_JTU1_LinkCanCom
** 函数描述:   通道是否可以通信
** 参数:       无
** 返回:       是返回true，否返回false
********************************************************************/
BOOLEAN YX_JTU1_LinkCanCom(void);

/*******************************************************************
** 函数名:     YX_JTU1_LinkApply
** 函数描述:   申请链路应用
** 参数:       无
** 返回:       已登入返回true，未登入返回false
********************************************************************/
BOOLEAN YX_JTU1_LinkApply(void);

/*******************************************************************
** 函数名:     YX_JTU1_LinkRelease
** 函数描述:   释放链路应用
** 参数:       [in] delay:延时释放时间，单位秒，0－立即释放
** 返回:       已登入返回true，为登入返回false
********************************************************************/
BOOLEAN YX_JTU1_LinkRelease(INT32U delay);

/*******************************************************************
** 函数名:     YX_JTU1_LinkReactivate
** 函数描述:   重新激活连接，断开socket后，重新连接socket
** 参数:       [in] delay:延时重新激活连接的时间，单位秒，0－立即重新激活链接
** 返回:       无
********************************************************************/
void YX_JTU1_LinkReactivate(INT32U delay);

#endif


