/********************************************************************************
**
** 文件名:     yx_protocol_send.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现协议数据组帧和发送管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2013/11/09 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef YX_PROTOCOL_SEND_H
#define YX_PROTOCOL_SEND_H   1

#include "yx_stream.h"
#include "yx_protocol_type.h"



/*******************************************************************
** 函数名:     YX_PROTOCOL_InitSend
** 函数描述:   初始化协议发送模块
** 参数:       无
** 返回:       无
********************************************************************/
void YX_PROTOCOL_InitSend(void);

/*******************************************************************
** 函数名:     YX_PROTOCOL_GetBufferStrm
** 函数描述:   获取流缓存，目前流缓存最大为1600字节
**             备注：本接口用于需要暂时需要缓存地方，如系统协议帧发送，注意不要冲突使用
** 参数:       无
** 返回:       返回数据流指针
********************************************************************/
STREAM_T *YX_PROTOCOL_GetBufferStrm(void);

/*******************************************************************
** 函数名:     YX_PROTOCOL_GetFrameSeq
** 函数描述:   获取数据帧流水号
** 参数:       无
** 返回:       数据帧流水号(强制从1开始, 0表示无效的发送流水号)
********************************************************************/
INT16U YX_PROTOCOL_GetFrameSeq(void);

/*******************************************************************
** 函数名:     YX_PROTOCOL_AsmFrameHead
** 函数描述:   协议头组帧函数
** 参数:       [in]  wstrm:     发送帧数据流
**             [in]  msgid:     协议类型ID
**             [in]  msgattrib: 数据长度和分包属性
**             [in]  frameseq:  帧流水号
** 返回:       返回帧流水号
********************************************************************/
INT32U YX_PROTOCOL_AsmFrameHead(STREAM_T *wstrm, INT32U msgid, INT32U msgattrib, INT32U frameseq);

/*******************************************************************
** 函数名:     YX_PROTOCOL_SendData
** 函数描述:   发送协议数据帧
** 参数:       [in]  wstrm:  发送帧数据流
**             [in]  attrib: 通道属性和重发属性，见PROTOCOL_COM_T
**             [in]  fp:     发送结果回调
** 返回:       调用成功返回true，失败返回false，失败无fp回调
********************************************************************/
BOOLEAN YX_PROTOCOL_SendData(STREAM_T *wstrm, PROTOCOL_COM_T *attrib, void (*fp)(INT8U result));

/*******************************************************************
** 函数名:     YX_PROTOCOL_SendCommonAck
** 函数描述:   发送通用应答
** 参数:       [in]  recvhead: 接收到的帧头
**             [in]  attrib:   发送属性
**             [in]  result:   应答结果
** 返回:       成功返回TRUE,失败返回FALSE
********************************************************************/
BOOLEAN YX_PROTOCOL_SendCommonAck(PROTOCOL_HEAD_T *recvhead, PROTOCOL_COM_T *attrib, INT8U result);



#endif
