/********************************************************************************
**
** 文件名:     yx_protocol_recv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现协议数据接收解析处理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2013/11/09 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef YX_PROTOCOL_RECV_H
#define YX_PROTOCOL_RECV_H   1



#include "yx_protocol_type.h"

/*
********************************************************************************
*                  DEFINE SYSTEM FRAME PROTOCOL TYPE
********************************************************************************
*/

#define PROTOCOL_MASK_FULL             0xFFFFFFFF          /* 全匹配 */
#define PROTOCOL_MASK_HALF             0xFFFFFF00          /* 半匹配，只匹配高8位*/


/*******************************************************************
** 函数名:     YX_PROTOCOL_InitRecv
** 函数描述:   初始化协议接收处理模块
** 参数:       无
** 返回:       无
********************************************************************/
void YX_PROTOCOL_InitRecv(void);

/*******************************************************************
** 函数名:     YX_PROTOCOL_HandleFrame
** 函数描述:   处理协议数据帧
**             [in]  attrib: 通道属性和重发属性，见PROTOCOL_COM_T
**             [in]  sptr:    数据指针
**             [in]  slen:    数据长度
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN YX_PROTOCOL_HandleFrame(PROTOCOL_COM_T *attrib, INT8U *sptr, INT16U slen);


#endif

