/********************************************************************************
**
** 文件名:     yx_mmi_sensor.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现外设传感器采集管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/05/22 | 叶德焰 |  创建第一版本
********************************************************************************/
#ifndef H_YX_MMI_SENSOR
#define H_YX_MMI_SENSOR           1


#if EN_MMI > 0

/* 按键 */
typedef struct {
    INT8U key;
    INT8U attrib;
} KEY_VALUE_T;


/*******************************************************************
** 函数名:     YX_MMI_InitSensor
** 函数描述:   MMI驱动模块初始化
** 参数:       无
** 返回:       无
********************************************************************/
void YX_MMI_InitSensor(void);

/*******************************************************************
** 函数名:     YX_MMI_SendSensorStatus
** 函数描述:   发送传感器状态
** 参数:       无
** 返回:       成功返回TRUE, 失败返回FALSE
********************************************************************/
BOOLEAN YX_MMI_SendSensorStatus(void);

/*******************************************************************
** 函数名:     YX_MMI_SendOdometerPulse
** 函数描述:   发送里程脉冲数
** 参数:       无
** 返回:       成功返回TRUE, 失败返回FALSE
********************************************************************/
BOOLEAN YX_MMI_SendOdometerPulse(void);

/*******************************************************************
** 函数名:     YX_MMI_SendAdcValue
** 函数描述:   发送AD采样值
** 参数:       无
** 返回:       成功返回TRUE, 失败返回FALSE
********************************************************************/
BOOLEAN YX_MMI_SendAdcValue(void);

/*******************************************************************
** 函数名:     YX_MMI_SendKeyValue
** 函数描述:   发送按键值
** 参数:       无
** 返回:       成功返回TRUE, 失败返回FALSE
********************************************************************/
BOOLEAN YX_MMI_SendKeyValue(KEY_VALUE_T *key);

/*******************************************************************
** 函数名:     YX_MMI_SendGsensorInfo
** 函数描述:   发送加速度传感器报警信息
** 参数:       无
** 返回:       成功返回TRUE, 失败返回FALSE
********************************************************************/
BOOLEAN YX_MMI_SendGsensorInfo(INT8U event);


#endif
#endif

