/********************************************************************************
**
** ÎÄ¼şÃû:     yx_mmi_drv.h
** °æÈ¨ËùÓĞ:   (c) 2007-2008 ÏÃÃÅÑÅÑ¸ÍøÂç¹É·İÓĞÏŞ¹«Ë¾
** ÎÄ¼şÃèÊö:   ¸ÃÄ£¿éÖ÷ÒªÊµÏÖMMIÍâÉèÇı¶¯»ù±¾¹¦ÄÜÒµÎñ£¬ÍâÉè×´Ì¬¹ÜÀí
**
*********************************************************************************
**             ĞŞ¸ÄÀúÊ·¼ÇÂ¼
**===============================================================================
**| ÈÕÆÚ       | ×÷Õß   |  ĞŞ¸Ä¼ÇÂ¼
**===============================================================================
**| 2011/01/22 | Ò¶µÂÑæ |  ´´½¨µÚÒ»°æ±¾
*********************************************************************************/
#ifndef H_YX_MMI_DRV
#define H_YX_MMI_DRV           1

#if EN_MMI > 0
#include "yx_mmi_type.h"
#include "yx_mmi_power.h"
#include "yx_mmi_com.h"
#include "yx_mmi_recv.h"
#include "yx_mmi_send.h"
#include "yx_mmi_common.h"
#include "yx_mmi_can.h"
#include "yx_mmi_gps.h"
#include "yx_mmi_sensor.h"
#include "yx_mmi_tr.h"
#include "yx_mmi_download.h"
#include "yx_mmi_uartext.h"



/*
********************************************************************************
* ºê¶¨Òå
********************************************************************************
*/

/*
********************************************************************************
* ¶¨ÒåÄ£¿éÊı¾İ½á¹¹
********************************************************************************
*/



/*******************************************************************
** º¯ÊıÃû:     YX_MMI_InitDrv
** º¯ÊıÃèÊö:   MMIÇı¶¯Ä£¿é³õÊ¼»¯
** ²ÎÊı:       ÎŞ
** ·µ»Ø:       ÎŞ
********************************************************************/
void YX_MMI_InitDrv(void);

/*******************************************************************
** º¯ÊıÃû:     YX_MMI_IsON
** º¯ÊıÃèÊö:   ÅĞ¶ÏMMIÊÇ·ñÁ¬½Ó
** ²ÎÊı:       ÎŞ
** ·µ»Ø:       ÒÑÁ¬½Ó·µ»Øtrue£¬Î´Á¬½Ó·µ»Øfalse
********************************************************************/
BOOLEAN YX_MMI_IsON(void);

/*******************************************************************
** º¯ÊıÃû:     YX_MMI_IsSleep
** º¯ÊıÃèÊö:   ÅĞ¶ÏMMIÊÇ·ñ´¦ÓÚÊ¡µç×´Ì¬
** ²ÎÊı:       ÎŞ
** ·µ»Ø:       ÊÇ·µ»Øtrue£¬·ñ·µ»Øfalse
********************************************************************/
BOOLEAN YX_MMI_IsSleep(void);

/*******************************************************************
** º¯ÊıÃû:     YX_MMI_Sleep
** º¯ÊıÃèÊö:   Ê¡µç
** ²ÎÊı:       ÎŞ
** ·µ»Ø:       ÒÑÁ¬½Ó·µ»Øtrue£¬Î´Á¬½Ó·µ»Øfalse
********************************************************************/
BOOLEAN YX_MMI_Sleep(void);

/*******************************************************************
** º¯ÊıÃû:     YX_MMI_Wakeup
** º¯ÊıÃèÊö:   »½ĞÑ
** ²ÎÊı:       ÎŞ
** ·µ»Ø:       ÒÑÁ¬½Ó·µ»Øtrue£¬Î´Á¬½Ó·µ»Øfalse
********************************************************************/
BOOLEAN YX_MMI_Wakeup(void);

/*******************************************************************
** º¯ÊıÃû:     YX_MMI_GetVer
** ¹¦ÄÜÃèÊö:   »ñÈ¡MMI°æ±¾ºÅ
** ²ÎÊı:  	   ÎŞ
** ·µ»Ø:       °æ±¾ºÅÖ¸Õë
********************************************************************/
INT8U *YX_MMI_GetVer(void);

/***************************************************************
** º¯ÊıÃû:    YX_MMI_ResetReq
**  ¹¦ÄÜÃèÊö:  ¸´Î»MMIÇëÇó
** ²ÎÊı:  	   [in] type: ¸´Î»ÀàĞÍ: 0x00Éı¼¶¸´Î»;0x01³£¹æ¸´Î»;0x02Òì³£¸´Î»
*   ·µ»ØÖµ:    ÎŞ
***************************************************************/
BOOLEAN YX_MMI_ResetReq(INT8U type);

/***************************************************************
** º¯ÊıÃû:    YX_MMI_PowerSaveCtrl
**  ¹¦ÄÜÃèÊö:  Ê¡µçÄ£Ê½¿ØÖÆ(¶ÏµçÉÏµç)
** ²ÎÊı:  	   [in] poweroff:TRUE-½øÈëÊ¡µçÄ£¿é, FALSE-ÍË³öÊ¡µçÄ£Ê½
*   ·µ»ØÖµ:    ÎŞ
***************************************************************/
void YX_MMI_PowerSaveCtrl(BOOLEAN poweroff);

/***************************************************************
** º¯ÊıÃû:    YX_MMI_SendPeResetInform
** ¹¦ÄÜÃèÊö:  ÍâÉèÍ¨ÖªÖ÷»ú£¬ÍâÉè¼´½«¸´Î»£¬ÒÔ±ãÖ÷»ú×öºÃ¸´Î»Ç°´¦Àí¹¤×÷
** ²ÎÊı:  	  [in] type: ¸´Î»ÀàĞÍ,¼û MMI_RESET_EVENT_E
** ·µ»Ø:      ³É¹¦·µ»Øtrue£¬·ñ·µ»Øfalse
***************************************************************/
BOOLEAN YX_MMI_SendPeResetInform(INT8U type);

/***************************************************************
** º¯ÊıÃû:    YX_MMI_SendPeResetInform
** ¹¦ÄÜÃèÊö:  ÍâÉèÍ¨ÖªÖ÷»ú£¬ÍâÉè¼´½«¹Ø±Õ»òÖØÆôÖ÷»ú(ÍâÉè×Ô¼º²»¸´Î»)÷
** ²ÎÊı:  	  [in] type: ¸´Î»ÀàĞÍ,¼û MMI_RESET_EVENT_E
** ·µ»Ø:      ³É¹¦·µ»Øtrue£¬·ñ·µ»Øfalse
***************************************************************/
BOOLEAN YX_MMI_SendHostResetInform(INT8U type);

/*******************************************************************
** º¯ÊıÃû:     YX_MMI_GetLogFlag
** º¯ÊıÃèÊö:   »ñÈ¡ÈÕÖ¾¿ªÆô»ò¹Ø±Õ
** ²ÎÊı:       ÎŞ
** ·µ»Ø:       ¿ªÆô·µ»Øtrue£¬¹Ø±Õ·µ»Øfalse
********************************************************************/
BOOLEAN YX_MMI_GetLogFlag(void);

#endif
#endif
