/********************************************************************************
**
** 文件名:     yx_mmi_download.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现固件升级功能
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/05/22 | 叶德焰 |  创建第一版本
********************************************************************************/
#ifndef YX_MMI_DOWNLOAD_H
#define YX_MMI_DOWNLOAD_H    1

#if EN_MMI > 0

#include "yx_mmi_recv.h"

/* 固件更新结果 */
typedef enum {
    DL_RESULT_NULL = 0,
    DL_RESULT_SUCCESS,                 /* 固件更新成功 */
    DL_RESULT_CHKERR,                  /* 表示固件检验失败，固件校验和错误 */
    DL_RESULT_VERERR,                  /* 表示固件检验失败，固件错误,如版本错误、固件非法 */
    DL_RESULT_OTHER,                   /* 其他错误，如文件不存在、获取不到数据等 */
    DL_RESULT_MAX
} DL_RESULT_E;

#define DL_PACKET_SIZE       512       /* 一次请求固件的数据包长度 */

#if (DL_PACKET_SIZE < 320 || DL_PACKET_SIZE > MMI_SIZE_HDL - 128)
#error "固件下载数据包长度配置出错"
#endif

/*******************************************************************
** 函数名:     YX_MMI_InitDownload
** 函数描述:   功能初始化
** 参数:       无
** 返回:       无
********************************************************************/
void YX_MMI_InitDownload(void);

/*******************************************************************
** 函数名:     YX_MMI_SendFirmwareUpdateReq
** 函数描述:   从机请求固件升级
** 参数:       无
** 返回:       无
********************************************************************/
void YX_MMI_SendFirmwareUpdateReq(void);

/*******************************************************************
** 函数名:     YX_MMI_SendGetFirmwareDataReq
** 函数描述:   从机请求固件升级
** 参数:       [in] offset:    偏移地址
**             [in] packetlen: 请求的数据长度
** 返回:       无
********************************************************************/
void YX_MMI_SendGetFirmwareDataReq(INT32U offset, INT16U packetlen);

/*******************************************************************
** 函数名:     YX_MMI_SendFirmwareUpdateResult
** 函数描述:   固件更新结果通知(
** 参数:       [in] result: 固件更新结果,见 DL_RESULT_E
** 返回:       无
********************************************************************/
void YX_MMI_SendFirmwareUpdateResult(INT8U result);

/*******************************************************************
** 函数名:     YX_MMI_StartUpdate
** 函数描述:   启动固件升级
** 参数:       无
** 返回:       无
********************************************************************/
void YX_MMI_StartUpdate(void);

/*******************************************************************
** 函数名:     YX_MMI_StopUpdate
** 函数描述:   停止固件升级
** 参数:       无
** 返回:       无
********************************************************************/
void YX_MMI_StopUpdate(void);


#endif
#endif

