/*
********************************************************************************
** 文件名:     yx_com_recv.h
** 版权所有:   (c) 2017 厦门雅迅网络股份有限公司
** 文件描述:    协议数据处理接口(接收)
** 创建人：        谢金成，2017.5.18
********************************************************************************
*/
#ifndef  _YX_COM_RECV_H
#define  _YX_COM_RECV_H

#include "port_uart.h"

void YX_ComRecv_Init(void);

#endif/* _PROTOCALDATA_RECV_H */
/************************ (C) COPYRIGHT 2010 XIAMEN YAXON.LTD *******************END OF FILE******/


