/*
********************************************************************************
** 文件名:     yx_com_man.H
** 版权所有:   (c) 2017 厦门雅迅网络股份有限公司
** 文件描述:   外设驱动基本功能业务，外设状态管理
** 创建人：        谢金成，2017.5.18
********************************************************************************
*/
#ifndef H_YX_COM_MAN
#define H_YX_COM_MAN         1

#ifdef __cplusplus
extern "C"
{
#endif

#define MAIN_COM             UART_IDX2
#define MAIN_COM_RBUF_SIZE   1536//2048
#define MAIN_COM_TBUF_SIZE   1792//1024
typedef enum {
    BAUD_200    = 200L,
    BAUD_1200   = 1200L,
    BAUD_2400   = 2400L,
    BAUD_4800   = 4800L,
    BAUD_9600   = 9600L,
    BAUD_10400  = 10400L,
    BAUD_19200  = 19200L,
    BAUD_38400  = 38400L,
    BAUD_57600  = 57600L,
    BAUD_115200 = 115200L,
    BAUD_230400 = 230400L,
    BAUD_460800 = 460800L,
    BAUD_921600 = 921600L,
    BAUD_MAXVAL
} BAUD_VALUE_E;

/*************************************************************************************************/
/*                           设备功能配置结构体                                                  */
/*************************************************************************************************/
typedef union {
    struct {                                     /* 从低字节到高字节，从右到左 */

       unsigned res0:8;                          /* 第0字节暂时保留 */
       unsigned res1:8;                          /* 第1字节暂时保留 */
       /* 第2字节 */
       unsigned res2:1;                          /* 保留位 一位*/
       unsigned signergather:1;                  /* 是否支持信号采集功能 */
       unsigned turnonside:1;                    /* 是否支持侧翻检测功能 */
       unsigned hitcheck:1;                      /* 是否支持碰撞检测功能 */
       unsigned tts:1;                           /* 是否支持TTS语音功能 */
       unsigned mileagestat:1;                   /* 是否支持里程统计功能 */
       unsigned rfid:1;                          /* 是否支持RFID功能 */
       unsigned alarm:1;                         /* 是否支持防盗报警功能 */
       /* 第3字节 */
       unsigned printer:1;                       /* 是否支持打印机功能 */
       unsigned cardreader:1;                    /* 是否支持读卡器功能 */
       unsigned CAN_Comm:1;                      /* 是否支持CAN通讯功能 */
       unsigned oilcheck:1;                      /* 是否支持油耗检测功能 */
       unsigned usarttransmit:1;                 /* 是否支持扩展串口转发功能 */
       unsigned udisk:1;                         /* 是否支持U盘读写功能*/
       unsigned update_udisk:1;                  /* 是否支持U盘升级功能 */
       unsigned update_wireless:1;               /* 是否支持无线升级 */

    }config_tags;
    INT32U configw;
}DEVICE_CONFIG_T;

/*******************************************************************************
 ** 函数名:     YX_COM_Init
 ** 函数描述:   mmi_com驱动模块初始化
 ** 参数:       无
 ** 返回:       无
 ******************************************************************************/
void YX_COM_Init(void) ;

/*******************************************************************************
 ** 函数名:    YX_COM_Islink
 ** 函数描述:   获取链接状态
 ** 参数:       无
 ** 返回:       true:  已连接
 false: 链路异常
 ******************************************************************************/
BOOLEAN YX_COM_Islink(void) ;

/*******************************************************************************
 ** 函数名:    YX_COM_Cleanlink
 ** 函数描述:   断开心跳
 ** 参数:      无
 ** 返回:      无
 ******************************************************************************/
void YX_COM_Cleanlink(void);

/*******************************************************************************
 ** 函数名:    YX_COM_SetOTA
 ** 函数描述:  设置OTA升级标志
 ** 参数:      无
 ** 返回:      无
 ******************************************************************************/
void YX_COM_SetOTA(void);

/*******************************************************************************
 ** 函数名:    YX_COM_CleanOTA
 ** 函数描述:  清除OTA升级标志
 ** 参数:      无
 ** 返回:      无
 ******************************************************************************/
void YX_COM_CleanOTA(void);

/*******************************************************************************
 ** 函数名:    YX_COM_IsOTA
 ** 函数描述:  获取OTA状态
 ** 参数:      无
 ** 返回:      true:  OTA进行中   / false:
 ******************************************************************************/
BOOLEAN YX_COM_IsOTA(void);
/*******************************************************************************
** 函数名:     Pause_Link
** 函数描述:   暂停链路定时器
** 参数:       [in]  onoff: TRUE 开启 FALSE 关闭      
** 返回:       无
******************************************************************************/
void Pause_Link(BOOLEAN onoff); 
#ifdef __cplusplus
}
#endif

#endif

