/******************************************************************************
**
** 文件: dal_sd2058.h
** 版权: (c) 2005-2021 厦门雅迅网络股份有限公司
** 描述: 外部RTC sd2058驱动
** 创建: lbx 2021.03.18
**
*********************************************************************************/
#ifndef __DAL_SD2058_H
#define __DAL_SD2058_H


/********************************************************************************
*                   数据类型及宏定义
*********************************************************************************/
/* sd2058中断使能宏定义 */
#define RTC_INT_SEC		0x01	// 秒中断使能
#define RTC_INT_MIN		0x02	// 分中断使能
#define RTC_INT_HOUR	0x04	// 时中断使能
#define RTC_INT_WEK		0x08	// 周中断使能
#define RTC_INT_DAY		0x10	// 日中断使能
#define RTC_INT_MON		0x20	// 月中断使能
#define RTC_INT_YEAR	0x40	// 年中断使能


/********************************************************************************
*                       对外接口声明
*********************************************************************************/

/*****************************************************************************
**  函数: HAL_sd2058_SetCalendar
**  描述: 设置日期
**  参数: [in]data 设置日期数据缓存
**  返回: TRUE 成功
          FALSE 失败
*****************************************************************************/
BOOLEAN HAL_sd2058_SetCalendar(const INT8U* data);

/*****************************************************************************
**  函数: HAL_sd2058_ReadCalendar
**  描述: 读取日期
**  参数: [in]data 读取日期数据缓存
**  返回: TRUE 成功
          FALSE 失败
*****************************************************************************/
BOOLEAN HAL_sd2058_ReadCalendar(INT8U* data);

/*****************************************************************************
**  函数: HAL_sd2058_Open
**  描述: 打开
**  参数: none
**  返回: TRUE 成功
          FALSE 失败
*****************************************************************************/
BOOLEAN HAL_sd2058_Open(void);

/*****************************************************************************
**  函数: HAL_sd2058_writebyte
**  描述: 写数据
**  参数: [in]regaddr 寄存器地址
			  buf     写数据内容
**  返回: TRUE 成功
          FALSE 失败
*****************************************************************************/
BOOLEAN HAL_sd2058_writebyte(INT8U regaddr,INT8U rbuf);

/*****************************************************************************
**  函数: HAL_sd2058_write
**  描述: 写数据
**  参数: [in]regaddr 寄存器地址
			  buf     写数据内容
			  buflen  数据长度
**  返回: TRUE 成功
          FALSE 失败
*****************************************************************************/
BOOLEAN HAL_sd2058_write(INT8U regaddr,INT8U* buf,INT8U buflen);

/*****************************************************************************
**  函数: HAL_sd2058_readbyte
**  描述: 读数据
**  参数: [in]regaddr 寄存器地址
			  buf     读数据内容
**  返回: TRUE 成功
          FALSE 失败
*****************************************************************************/
BOOLEAN HAL_sd2058_readbyte(INT8U regaddr,INT8U *rbuf);

/*****************************************************************************
**  函数: HAL_sd2058_read
**  描述: 读数据
**  参数: [in]regaddr 寄存器地址
			  buf     读数据内容缓存
			  buflen  数据长度
**  返回: TRUE 成功
          FALSE 失败
*****************************************************************************/
BOOLEAN HAL_sd2058_read(INT8U regaddr,INT8U* buf,INT8U buflen);

/*****************************************************************************
**  函数: HAL_sd2058_SetCalendar
**  描述: 设置日期
**  参数: [in]alarm_flag:报警使能位 bit0~bit6:秒 分 时 周 日 月 年,bit7=0
		  [in]alarm_time:报警日期 7字节数据byte0~byte6:秒 分 时 周 日 月 年
**  返回: TRUE 成功
          FALSE 失败
*****************************************************************************/
BOOLEAN HAL_sd2058_SetAlarm(INT8U alarm_flag, INT8U *alarm_time);

/*****************************************************************************
**  函数: HAL_sd2058_ClearAlarm
**  描述: 清除报警标志
**  参数: [in]无
**  返回: TRUE 成功
          FALSE 失败
*****************************************************************************/
BOOLEAN HAL_sd2058_ClearAlarm(void);


INT8U sd_Hex2BCD(INT8U hex);

#endif /* __DAL_SD2058_H */


