/********************************************************************************
**
** 文件名:     yx_swconfig.c
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现空功能模块开关控制
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2011/01/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef SWCONFIG_H
#define SWCONFIG_H           1

/*
*****************************************************************************************
* 各功能模块的编译控制开关
*****************************************************************************************
*/
#define EN_FREECONST            1           /* 0: 禁止自由使用const变量, 1: 允许自由使用const变量 */

#define EN_ALWAYSOPENED         0           /* 抢劫按钮常开/常闭选择，1－为常开，0为常闭 */
#define EN_GPSSLEEP	            1           /* GPS省电功能 */

#define EN_GAUDER               0           /* 防盗报警功能 */
#define EN_SHAKE_ALM            0           /* 震动报警功能 */
#define EN_LOW_VOLTAGE          1           /* 欠压报警功能 */
#define EN_LOWSPEED             0           /* 怠速报警功能 */

#define EN_WIRELESSDOWN         0           /* 无线下载 */

#define EN_SN_UID               1           /* UID 1 以SN码形式显示，0 以手机号码的前三后四 */
#if EN_WIRELESSDOWN > 0
#define EN_WD_TCPCHANL          1
#endif
#define EN_GZIP                 0

#define EN_DEBUG_APP            0 	        /* APP Debug Enable */


#define EN_TEST485              0           /* 485测试 */
#define EN_TESTCAN              0           /* CAN测试 */
#define EN_HW_TIM               0           /* 1:使用硬件定时器 */

#define EN_CAN_ERR_INT         0           /* 1:使用can错误中断接口 */         

#define EN_CHARGE_DET           0          /* 1:打开外部电源充电检测脚功能 */

#define EN_NEW_BAT_CTL          1          /* 1:常开,0：与旧的 PIN_BATCTL脚 控制方式一样 */

#define EN_DAL_GSEN_WK          0       /* 0:关闭碰撞唤醒功能，1:打开六轴碰撞唤醒功能 */
/* 注意：关闭/开启唤醒功能，宏EN_DAL_GSEN_WK也要关闭/开启 */
#define EN_GSEN_WAKE_UP         0          /* 0:关闭碰撞唤醒功能，1:打开六轴碰撞唤醒功能 */

#define EN_CAN2_WAKE_UP         0          /* CAN2唤醒使能，1:使能，0:关闭 */

#define EN_ADC_TRAN_S32K        1          /* 1:上报的adc值转换成原来的s23k值，主机不需要修改计算; 0:按新的adc电路读取值上报,主机需要根据新的电路修改计算公式 */

#define EN_KMS_LOCK             1          /* 1:使能康明斯锁车; 0:关闭康明斯锁车 */
#define EN_UDS                  1          /* 1:开启UDS功能     0:关闭UDS功能 */
#define EN_UDS_TRANS            0          /* 1:开启UDS下载功能 0:关闭UDS下载功能 */ 
#define SOFT_BUSOFF_RECOBRY     1          /* 1:软件恢复BUSOFF  0:自动恢复busoff */
#define ACC_OFF_STOP_SEND       1          /* 1:开启acc off 1000ms内关闭报文发送  0:关闭此功能 */
#define EN_CAN_FILTER           0          /* 0:MCU自配置滤波   1:MCU配置滤波原有逻辑  */
/*
*****************************************************************************************
* 定义全局宏
*****************************************************************************************
*/

#endif /* __CONFIG_H */

