/********************************************************************************
**
** 文件名:     debug_print.h
** 版权所有:   (c) 2014-2020 厦门雅迅网络股份有限公司
** 文件描述:   系统调试打印函数接口
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2010/12/30 | LEON   | 创建本模块
**
*********************************************************************************/
#ifndef __DEBUG_PRINT_H
#define __DEBUG_PRINT_H
#include "yx_system.h"

/*************************************************************************************************/
/*                           宏替代系统打印函数                                                  */
/*************************************************************************************************/
#define Debug_SysPrint       printf                                  /* 重定义系统打印函数 */
//#define debug_printf         Debug_SysPrint
#define debug_printf_dir     Debug_SysPrint
#define printf_hex(buf,len)  Debug_PrintHex(0,buf,len)
#define printf_hex_dir       printf_hex

/*******************************************************************
** 函数名:     debug_printf
** 函数描述:   打印接口
** 参数:       无
** 返回:       无
********************************************************************/
BOOLEAN debug_printf(const char * fmt, ...);

/*******************************************************************
** 函数名:     Debug_PrintByte
** 函数描述:   打印输出单个字节
** 参数:       [in] byte   数据
** 返回:       无
********************************************************************/
void Debug_PrintByte(INT8U byte);

/*******************************************************************
** 函数名:     Debug_PrintCRLF
** 函数描述:   在打印信息后补加回车换行符
** 参数:       无
** 返回:       无
********************************************************************/
void Debug_PrintCRLF(void);

/*******************************************************************
** 函数名:     Debug_PrintHex
** 函数描述:   以16进制格式打印连续数据
** 参数:       [in] ptr   数据
**             [in] size  数据长度
** 返回:       无
********************************************************************/
void Debug_PrintHex(BOOLEAN end, INT8U *ptr, INT16U size);

/*******************************************************************
** 函数名:     Debug_PrintStr
** 函数描述:   以字符串形式打印连续内容
** 参数:       [in] ptr   数据
** 返回:       无
********************************************************************/
void Debug_PrintStr(char *ptr);

/*******************************************************************
** 函数名:     Debug_Initiate
** 函数描述:   初始化打印串口
** 参数:       无
** 返回:       无
********************************************************************/
void Debug_Initiate(void);

/*******************************************************************
** 函数名:     Debug_Print_Sw
** 函数描述:   打印开关(主要用于加密芯片调用debug_printf打印接口输出控制)
** 参数:       [in] db_sw : TRUE:打开，FALSE:关闭
** 返回:       无
********************************************************************/
void Debug_Print_Sw(BOOLEAN db_sw);

#endif



