/********************************************************************************
**
** 文件名:     dmemory.h
** 版权所有:   (c) 2014-2020 厦门雅迅网络股份有限公司
** 文件描述:   系统动态内存管理接口函数头文件
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2016/1/6   | jump   | 创建本模块
**
*********************************************************************************/
#ifndef __DMEMORY_H
#define __DMEMORY_H




typedef struct memquery_t {
    INT32U occupysize;                                     /* 已经使用的内存大小 */
    INT32U blocks;                                         /* 内存块数量 */
} HEAPMEM_STATISTICS_T;



/*******************************************************************
** 函数名:     InitDmemory
** 函数描述:   初始化动态内存模块
** 参数:       无
** 返回:       无
********************************************************************/
void InitDmemory(void);

/*******************************************************************
** 函数名:     mmi_memalloc
** 函数描述:   申请一个内存模块
** 参数:       [in] datalen: 申请内存的长度
**             [in] overtime:内存使用时间，单位：秒
**             [in] file:    申请内存的文件名
**             [in] line:    申请内存的行号
** 返回:       成功返回申请的内存地址，失败返回空指针
********************************************************************/
void *mmi_memalloc(INT32U datalen, INT16U overtime, char *file, INT32U line);

/*******************************************************************
** 函数名:     mmi_memfree
** 函数描述:   释放动态申请的内存
** 参数:       [in] sptr: 释放内存的地址
**             [in] file: 申请内存的文件名
**             [in] line: 申请内存的行号
** 返回:       释放结果
********************************************************************/
BOOLEAN mmi_memfree(void *sptr, char *file, INT32U line);

/*******************************************************************
** 函数名:     mmi_dmemory_getstatistics
** 函数描述:   查询内存池当前使用状态接口
** 参数:       无
** 返回:       成功返回返回统计信息，失败返回0
********************************************************************/
HEAPMEM_STATISTICS_T *mmi_dmemory_getstatistics(void);

#endif /*__DMEMORY_H*/

/****************************** (C) COPYRIGHT 2010 XIAMEN YAXON.LTD **************END OF FILE******/


