/********************************************************************************
**
** 文件名:     mmi_resetcnt.h
** 版权所有:   (c) 2014-2020 厦门雅迅网络股份有限公司
** 文件描述:   复位统计模块,目前暂统计如下信息
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2016/1/4   | JUMP   | 创建本模块
**
*********************************************************************************/
#ifndef RESETCNT_H
#define RESETCNT_H


#include  "dal_structs.h"


/*
********************************************************************************
* 定义复位类型
********************************************************************************
*/
typedef enum {
    RESET_ABNORMAL = 1,      /* 出错异常复位 */
    RESET_INITIATIVE,        /* 主动复位 */
    RESET_LINK,              /* 链路超时复位 */
    RESET_DIRECT,            /* 直接复位 */
    RESET_MAX
} RESET_E;

/*******************************************************************
** 函数名:     mmi_resetinform
** 函数描述:   复位回调接口
** 参数:       [in] resettype：复位类型
**             [in] filename： 文件名
**             [in] line：     出错行号
**             [in] errid：    错误ID
** 返回:       无
********************************************************************/
void mmi_resetinform(INT8U resettype, INT8U *filename, INT32U line, INT32U errid);

/*******************************************************************
** 函数名:     mmi_resetcnt_init
** 函数描述:   初始化出错统计模块
** 参数:       无
** 返回:       无
********************************************************************/
void mmi_resetcnt_init(void);

/*******************************************************************
** 函数名:     mmi_resetcnt_getptr
** 函数描述:   获取复位信息
** 参数:       无
** 返回:       无
********************************************************************/
RESETREC_T *mmi_resetcnt_getptr(void);
//INT8U *mmi_resetcnt_getptr(void);
#endif  // END OF RESETCNT_H

