/******************************************************************************
**
** Filename:     os_qmsg.h
** Copyright:    
** Description:  该模块主要实现系统消息管理
**
-------------------------------------------------------------------------------
**             Revision history
**-----------------------------------------------------------------------------
**| 2014/03/09 | 叶德焰 |  创建文件
*******************************************************************************/
#ifndef OS_QMSG_H
#define OS_QMSG_H


/*
********************************************************************************
* define config parameters
********************************************************************************
*/
/* 最大消息队列数 */
#define OS_MAX_MSG           20

/*
********************************************************************************
* define struct
********************************************************************************
*/
typedef struct {
    INT8U       tskid;
    INT32U      msgid;
    INT32U      para1;
    INT32U      para2;
} OS_MSG_T;

/*******************************************************************
** 函数名称:   OS_PostMsg
** 函数描述:   发送系统消息
** 参数:       [in]  msgid: 消息ID
**             [in]  para1: 消息参数1
**             [in]  para2: 消息参数2
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN OS_PostMsg(INT8U tskid, INT32U msgid, INT32U para1, INT32U para2);

/*******************************************************************
** 函数名称:   OS_PostMsgEx
** 函数描述:   发送消息,增强型接口
** 参数:       [in]  overlay: true-检查是否已有存在该消息，false-不检查
**             [in]  tskid:   消息所属任务ID
**             [in]  msgid:   系统消息ID
**             [in]  para1:   低32位消息参数
**             [in]  para2:   高32位消息参数
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN OS_PostMsgEx(BOOLEAN overlay, INT8U tskid, INT32U msgid, INT32U para1, INT32U para2);

/*******************************************************************
** 函数名称:   OS_InitQMsg
** 函数描述:   初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void OS_InitQMsg(void);

/*******************************************************************
** 函数名称:   MsgSchedEntry
** 函数描述:   处理系统消息
** 参数:       无
** 返回:       无
********************************************************************/
void OS_MsgSchedEntry(void);


#endif

