/******************************************************************************
**
** filename:     os_timer.h
** copyright:    
** description:  该模块主要实现定时器调度和管理
**
-------------------------------------------------------------------------------
**             Revision history
**-----------------------------------------------------------------------------
**| 2014/03/09 | 叶德焰 |  创建文件
*******************************************************************************/
#ifndef OS_TIMER_H
#define OS_TIMER_H


#ifndef GLOBALS_TIMER
#define _TIMER_EXT                    extern volatile
#else
#define _TIMER_EXT                    volatile
#endif


/*
********************************************************************************
* define config parameters
********************************************************************************
*/
#define OS_MAX_TIMER                   32

/*
********************************************************************************
* define struct
********************************************************************************
*/
typedef struct {
    INT8U  ready;			                        /* 定时器是否就绪 */
    INT8U  tskid;                                   /* 定时器所属任务ID */
    void  *index;        	                        /* 定时执行函数特征数据指针 */
    INT32U totaltime;		                        /* 定时程序的总定时时间，单位100ms */
    INT32U lefttime;				                /* 当前的剩余时间, 单位100ms */
    
    void   (*tmrproc)(void *index);          	    /* 定时执行任务的指针 */
    void   (*bakproc)(void *index);          	    /* 定时执行任务的指针 */
} OS_TMR_T;

/*
***********************************************
* define ticks
***********************************************
*/
#define PERTICK                             1                      /* 1 tick = 20 ms */
#define TICK_MILSECOND                      (100L / PERTICK)
#define TICK_SECOND                         (1000L / PERTICK)
#define TICK_MINUTE                         ((60 * 1000L) / PERTICK)
/*
***********************************************
* define attrib
***********************************************
*/
#define _HIGHTICK                            1
#define _TICK                               10
#define _MILTICK                            TICK_MILSECOND
#define _SECOND                             TICK_SECOND
#define _MINUTE                             TICK_MINUTE

/*
********************************************************************************
* define module variants
********************************************************************************
*/
_TIMER_EXT INT32U g_systicks;


/*******************************************************************
** 函数名称:   OS_InitTimer
** 函数描述:   定时器模块初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void OS_InitTimer(void);

/*******************************************************************
** 函数名称:   OS_CreateTmr
** 函数描述:   创建定时器
** 参数:       [in] tskid     定时器所属任务ID
**             [in] index:     定时器标识
**             [in] tmrproc:   定时器超时处理函数
** 返回:       定时器ID; 如安装失败, 则返回0xff
********************************************************************/
INT8U OS_CreateTmr(INT8U tskid, void *index, void (*tmrproc)(void *index));

/*******************************************************************
** 函数名称:   OS_RemoveTmr
** 函数描述:   删除一个已创建的定时器
** 参数:       [in]  id: 定时器ID
** 返回:       无
********************************************************************/
void OS_RemoveTmr(INT8U id);

/*******************************************************************
** 函数名称:   OS_StartTmr
** 函数描述:   启动定时器
** 参数:       [in]  id:        已创建的一个定时器ID
**             [in]  attrib:    定时器超时时间单位
**             [in]  time:      定时器超时时间
** 返回:       无
********************************************************************/
void OS_StartTmr(INT8U id, INT32U attrib, INT32U time);

/*******************************************************************
** 函数名称:   OS_StopTmr
** 函数描述:   停止定时器
** 参数:       [in]  id: 定时器ID
** 返回:       无
********************************************************************/
void OS_StopTmr(INT8U id);

/*******************************************************************
** 函数名称:   OS_GetLeftTime
** 函数描述:   获取定时器还需要等待的超时时间
** 参数:       [in]  id: 定时器ID
** 返回:       剩余的运行时间, 单位: 一个tick
********************************************************************/
INT32U OS_GetLeftTime(INT8U id);

/*******************************************************************
** 函数名称:   OS_TmrIsRun
** 函数描述:   判断定时器是否处于运行状态
** 参数:       [in]  id:  定时器ID
** 返回:       true:  运行状态,false: 停止状态
********************************************************************/
INT8U OS_TmrIsRun(INT8U id);

/*******************************************************************
** 函数名称:   OS_ExeTmrFunc
** 函数描述:   定时器回调函数执行接口，供各任务调用
** 参数:       [in]     tskid：任务ID号
** 返回:       无
********************************************************************/
void OS_ExeTmrFunc(INT8U tskid);

/*******************************************************************
** 函数名称:   OS_TmrTskEntry
** 函数描述:   系统定时器超时后的处理函数
** 参数:       无
** 返回:       无
********************************************************************/
void OS_TmrTskEntry(void);

#endif

/*************END OF FILE****/
