/********************************************************************************
**
** 文件名:     yx_sleep.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现省电管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/06/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef YX_SLEEP_H
#define YX_SLEEP_H           1


/* 唤醒事件类型 */
typedef enum {
    WAKEUP_EVENT_ACC = 0,    /* ACC唤醒 */
    WAKEUP_EVENT_ROB,        /* 抢劫唤醒 */
    WAKEUP_EVENT_SERVER,     /* 服务器唤醒 */
    WAKEUP_EVENT_SM,         /* 短信唤醒 */
    WAKEUP_EVENT_MAX
} WAKEUP_EVENT_E;


/*******************************************************************
** 函数名:     YX_SLEEP_Init
** 函数描述:   初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void YX_SLEEP_Init(void);

/*******************************************************************
** 函数名:     YX_SLEEP_Wakeup
** 函数描述:   唤醒设备
** 参数:       [in] waketime: 唤醒时长,单位:分钟
** 参数:       [in] event:    唤醒事件,见 WAKEUP_EVENT_E
** 返回:       无
********************************************************************/
void YX_SLEEP_Wakeup(INT8U waketime, INT8U event);

/*******************************************************************
** 函数名:     YX_SLEEP_GetWakeupEvent
** 函数描述:   获取唤醒设备事件
** 参数:       无
** 返回:       见 WAKEUP_EVENT_E
********************************************************************/
INT8U YX_SLEEP_GetWakeupEvent(void);

/*******************************************************************
** 函数名:     YX_SLEEP_ConfirmRecCan
** 函数描述:   确认收到can消息
** 参数:       无
** 返回:       见 void
********************************************************************/
void YX_SLEEP_ConfirmRecCan(INT8U *candata);

#endif
