/******************************************************************************
** 文件名:     yx_enc_fun.h
** 版权所有:   (c) 2005-2019 厦门雅迅网络股份有限公司
** 文件描述:   该模块实现加密芯片spi接口和其他接口函数
******************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者    |  修改记录
**===============================================================================
**| 2019 /4/30 | cym |  创建第一版本
*********************************************************************************/
#ifndef _YX_ENC_FUN_H_
#define _YX_ENC_FUN_H_
//返回类型
#define E_SUCCESS 0x00000000
#define E_COMMUNICATE_FAILURE 0x30000000
#define E_PIB_FAILURE 0x3000FFFF
/*****************************************************************************
**  函数名:  delay_init
**  函数描述: 初始化延迟函数
**  参数:        无
**  返 回 : 
*****************************************************************************/
extern void delay_init(void);
/*****************************************************************************
**  函数名:  delay_us
**  函数描述: 延时nus微秒
**  参数:       [in] nus:延时us数
**  返 回 : 无
*****************************************************************************/
extern void delay_us(unsigned int nus);
/*****************************************************************************
**  函数名:  delay_ms
**  函数描述: 延时mus毫秒
**  参数:       [in] nms:延时ms数
**  返 回 : 无
*****************************************************************************/
extern void delay_ms(unsigned int nms);
/*****************************************************************************
**  函数名:  gpio_reset
**  函数描述: 将一个GPIO初始化为复位引脚，并对SE设备硬件复位
**  参数:       [in]void  :
**  返 回 : 
*****************************************************************************/
extern void gpio_reset(void);

/*****************************************************************************
**  函数名:  gpio_cs_init
**  函数描述: 将一个GPIO初始化为SPI的CS引脚
**  参数:   :无
**  返 回 : 无
*****************************************************************************/
extern void gpio_cs_init(void);

/*****************************************************************************
**  函数名:  gpio_cs_sel
**  函数描述: SPI协议中利用GPIO选中SPI设备
**  参数:   :无
**  返 回 : 无
*****************************************************************************/
extern void gpio_cs_sel(void);
/*****************************************************************************
**  函数名:  gpio_cs_desel
**  函数描述: SPI协议中利用GPIO释放SPI设备
**  参数:   :无
**  返 回 : 无 
*****************************************************************************/
extern void gpio_cs_desel(void);
/*****************************************************************************
**  函数名:  yx_spi_init
**  函数描述: MCU的spi接口初始化
**  参数:       [in]handle  :spi句柄
**              [in]para    :
**  返 回 : 是否成功，成功返回E_SUCCESS
*****************************************************************************/
extern unsigned long yx_spi_init(void **handle, void *para);
/*****************************************************************************
**  函数名:  spi_deinit
**  函数描述: MCU的spi接口释放，句柄清空
**  参数:       [in]handle  :spi句柄
**  返 回 : 是否成功，成功返回E_SUCCESS
*****************************************************************************/
extern unsigned long spi_deinit(void *handle);
/*****************************************************************************
**  函数名:  spi_transmittx
**  函数描述: spi数据发送
**  参数:       [in]handle:spi句柄
**              [in]pdata:发送的数据指针
**              [in]data_len:发送数据长度
**              [in]delay:片选延时微秒数
**  返 回 : 是否成功，成功返回E_SUCCESS
*****************************************************************************/
extern unsigned long spi_transmittx(void *handle,unsigned char* pdata,unsigned int data_len,unsigned int delay);
/*****************************************************************************
**  函数名:  spi_transmitrx
**  函数描述: spi数据接收
**  参数:       [in]handle:spi句柄
**              [in]pdata:发送的数据指针
**              [in]data_len:发送数据长度
**              [in]delay:片选延时微秒数
**  返 回 : 是否成功，成功返回E_SUCCESS
*****************************************************************************/
extern unsigned long spi_transmitrx(void *handle, unsigned char* pdata,unsigned int data_len,unsigned int delay);

/*****************************************************************************
**  函数名:  Enc_Wakeup
**  函数描述: 唤醒加密芯片(调试时用，因为用到延时函数占用系统时序)
**  参数:       [in]void  :
**  返 回 : 
*****************************************************************************/
void Enc_Wakeup(void);

/*****************************************************************************
**  函数名:  Enc_WkPinCtl
**  函数描述: 控制唤醒脚
**  参数:    [in] ctl : TRUE:拉高，FALSE:拉低
**  返回:    无
*****************************************************************************/
void Enc_WkPinCtl(BOOLEAN ctl);

/*****************************************************************************
**  函数名:  Enc_PinEnOrDis
**  函数描述: 设置为开漏状态/正常状态
**  参数:    [in] ctl : TRUE:恢复，FALSE:关闭
**  返回:    无
*****************************************************************************/
void Enc_PinEnOrDis(BOOLEAN ctl);

/*****************************************************************************
**  函数名:  Enc_PinInit
**  函数描述: 加密芯片引脚初始化
**  参数:    无
**  返回:    无
*****************************************************************************/
void Enc_PinInit(void);

#endif
