/*
********************************************************************************
** 文件名:     yx_encrypt_man.h
** 版权所有:   (c) 2018 厦门雅迅网络股份有限公司
** 文件描述:   加密算法接口
** 创建人：    阙存先，2019.05.17
********************************************************************************
*/
#ifndef YX_ENCRYPT_MAN_H_
#define YX_ENCRYPT_MAN_H_


/*******************************************************************************
 **  函数名称:  YX_Encrypt_Func
 **  功能描述:  加密算法请求
 **  输入参数:  [in] buffer: 数据指针
                [in] len   : 长度
 **  返回参数:  无
 ******************************************************************************/
void YX_Encrypt_Func(INT8U *buffer, INT16U len);

/*******************************************************************************
 **  函数名称:  YX_Encrypt_Init
 **  功能描述:  加密算法模块初始化
 **  输入参数:  [IN]	*buffer: 数据指针
 **  返回参数:  无
 ******************************************************************************/
void YX_Encrypt_Init(void);

#endif /* YX_ENCRYPT_MAN_H_ */
