/*******************************************************************************
**
** 文件名:     bal_pp_drv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:    该模块主要实现公共参数文件存储驱动管理
**
********************************************************************************
**             修改历史记录
**==============================================================================
**| 日期       | 作者   |  修改记录
**==============================================================================
**| 2017/06/07 | 谢金成 |  创建第一版本
*******************************************************************************/
#ifndef __BAL_PP_DRV_H__
#define __BAL_PP_DRV_H__   1

//#include "bal_pp_reg.h"
//#include "bal_pp_misc.h"
#include "Public.H"
/*
********************************************************************************
* 定义模块配置参数
********************************************************************************
*/
//#define MAX_PP_NUM           18       /* 最大参数个数（不可以随意更改） */
//#define PP_HEAD_START        0       /*记录参数头的起始位置*/
//#define PP_RECNUM            4       /*最大参数个数为18时 对应 记录数 4；如果最大参数个数更改需变化*/

//#define PP_HEAD_LEN          7       /*每个PP参数头长度
//（包含：ID + 有效值 + 校验值 + 起始记录 + 结束记录 + 参数有效长度 + 预留一个字节 ）*/

//#define STB_PP_LEN         32      /*每个参数的长度*/
/*
********************************************************************************
* 定义模块数据结构
********************************************************************************
*/
//typedef struct {
//    INT8U chksum[2];
//} PP_HEAD_T;

/*******************************************************************************
** 函数名:      bal_pp_Init
** 函数描述:    公共参数存储驱动初始化
** 参数:        无
** 返回:        无
*******************************************************************************/
void bal_pp_Init(void);

/*******************************************************************************
** 函数名:      bal_pp_ReadParaByID
** 函数描述:    读取PP参数，判断PP有效性
** 参数:        [in] id:  参数编号，见PP_ID_E
**              [in] dptr:输出缓存
**              [in] rlen:缓存长度
** 返回:        有效返回true，无效返回false
*******************************************************************************/
INT8U bal_pp_ReadParaByID(INT8U id, INT8U *dptr, INT16U rlen);

/*******************************************************************************
** 函数名:      bal_pp_StoreParaByID
** 函数描述:    存储PP参数，立即存储到flash
** 参数:        [in] id:  参数编号，见PP_ID_E
**              [in] sptr:输入缓存
**              [in] slen:缓存长度
** 返回:        成功返回true，失败返回false
*******************************************************************************/
BOOLEAN bal_pp_StoreParaByID(INT8U id, INT8U *sptr, INT16U slen);

#endif


