/********************************************************************************
**
** 文件名:     hal_hit_drv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现加速度传感器芯片驱动
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/04/09 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef HAL_HIT_DRV_H
#define HAL_HIT_DRV_H      1

#if EN_GSENSOR > 0

#define GSENSOR_SCALE        4              /* XYZ轴重力加速度值刻度,1表示0.004g*/

/* XYZ三轴值 */
typedef struct {
    INT16S x;                /* x轴重力加速度,单位0.001g */
    INT16S y;                /* y轴重力加速度,单位0.001g */
    INT16S z;                /* z轴重力加速度,单位0.001g */
} GSENSOR_XYZ_T;

/*******************************************************************
** 函数名称: HAL_HIT_InitDrv
** 函数描述: 初始化模块
** 参数:     无
** 返回:     无
********************************************************************/
void HAL_HIT_InitDrv(void);

/*******************************************************************
** 函数名称: HAL_HIT_GetValueXYZ
** 函数描述: 获取XYZ轴值
** 参数:     无
** 返回:     成功返回TRUE,失败返回FALSE
********************************************************************/
BOOLEAN InitAccelerometerSensor(void);
BOOLEAN HAL_HIT_GetValueXYZ(GSENSOR_XYZ_T *xyz);

/*******************************************************************
** 函数名称:   HAL_HIT_Read
** 函数描述:   读取传感器数据
** 参数:       [in]  offset: flash地址偏移量
**             [out] dptr:   读取缓存指针
**             [in]  maxlen: 读取长度
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN HAL_HIT_Read(INT32U offset, INT8U *dptr, INT32U maxlen);

/*******************************************************************
** 函数名称:   HAL_HIT_Write
** 函数描述:   写入传感器数据
** 参数:       [in] offset: flash地址偏移量
**             [in] sptr:   数据指针
**             [in] slen:  数据长度
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN HAL_HIT_Write(INT32U offset, INT8U *sptr, INT32U slen);


#endif
#endif

/************************** (C) COPYRIGHT 2010 XIAMEN YAXON.LTD *******************END OF FILE******/



