/********************************************************************************
**
** 文件名:     hal_ic_drv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现IC卡读写卡功能（4442和24CXX系列的IC卡）
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/04/09 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef HAL_IC_DRV_H
#define HAL_IC_DRV_H         1



/*******************************************************************
** 函数名:     HAL_IC_InitDrv
** 函数描述:   IC卡模块初始化
** 参数:       无
** 返回:       无
********************************************************************/
void HAL_IC_InitDrv(void);

/*******************************************************************
** 函数名:     HAL_IC_ReadSLE4442
** 函数描述:   读取SLE4442卡数据
** 参数:       [in]  addr:   地址
**             [out] dptr：  数据指针
**             [in]  maxlen：数据长度
** 返回:       读取到数据长度
********************************************************************/
INT16U HAL_IC_ReadSLE4442(INT16U addr, INT8U *dptr, INT16U maxlen);

/*******************************************************************
** 函数名:     HAL_IC_WriteSLE4442
** 函数描述:   写SLE4442卡数据
** 参数:       [in] addr: 地址
**             [in] sptr：数据指针
**             [in] slen：数据长度
** 返回:       写入数据长度
********************************************************************/
INT16U HAL_IC_WriteSLE4442(INT16U addr, INT8U *sptr, INT16U slen);

/*******************************************************************
** 函数名:     HAL_IC_Read24CXX
** 函数描述:   读取24CXX卡数据
** 参数:       [in]  addr:   地址
**             [out] dptr：  数据指针
**             [in]  maxlen：数据长度
** 返回:       读取到数据长度
********************************************************************/
INT16U HAL_IC_Read24CXX(INT16U addr, INT8U *dptr, INT16U maxlen);

/*******************************************************************
** 函数名:     HAL_IC_WriteData
** 函数描述:   写卡数据
** 参数:       [in] offset: 偏移地址
**             [in] sptr：  数据指针
**             [in] slen:   数据长度
** 返回:       写入数据长度
********************************************************************/
INT32U HAL_IC_WriteData(INT32U offset, INT8U *sptr, INT16U slen);

#endif
/************************** (C) COPYRIGHT 2010 XIAMEN YAXON.LTD *******************END OF FILE******/


