/********************************************************************************
**
** 文件名:     hal_sflash_drv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现外部扩展串行flash存储芯片读写驱动
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/04/09 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef HAL_SFLASH_DRV_H
#define HAL_SFLASH_DRV_H      1




/*******************************************************************
** 函数名称: HAL_SFLASH_InitDrv
** 函数描述: 初始化模块
** 参数:     无
** 返回:     无
********************************************************************/
void HAL_SFLASH_InitDrv(void);

/*******************************************************************
** 函数名称:   HAL_SFLASH_Read
** 函数描述:   读取FLASH数据
** 参数:       [in]  offset: flash地址偏移量
**             [out] dptr:   读取缓存指针
**             [in]  maxlen: 读取长度
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN HAL_SFLASH_Read(INT32U offset, INT8U *dptr, INT32U maxlen);

/*******************************************************************
** 函数名称:   HAL_SFLASH_Write
** 函数描述:   写入FLASH数据
** 参数:       [in] offset: flash地址偏移量
**             [in] sptr:   数据指针
**             [in] slen:  数据长度
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN HAL_SFLASH_Write(INT32U offset, INT8U *sptr, INT32U slen);



#endif

/************************** (C) COPYRIGHT 2010 XIAMEN YAXON.LTD *******************END OF FILE******/



