/********************************************************************************
**
** 文件名:     yx_lowpower_drv.c
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现芯片低功耗管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2017/11/06 | 谢宁鸿 |  创建第一版本
*********************************************************************************/
#ifndef _hal_lowpower_drv_h_
#define _hal_lowpower_drv_h_

typedef enum {
    LOW_POWER_MODE_SLEEP = 0x01,    /* 休眠模式 */
    LOW_POWER_MODE_STOP,            /* 停止模式 */
    LOW_POWER_MODE_STANDBY,         /* 待机模式 */
    LOW_POWER_MODE_MAX
}LOW_POWER_MODE_E;


typedef enum {
    LOW_POWER_FLAG_WUF = 0x01,    /* 唤醒标志 */
    LOW_POWER_FLAG_SB,            /* StandBy标志 */
    LOW_POWER_FLAG_MAX
}LOW_POWER_FLAG_E;


/*******************************************************************
** 函数名称: HAL_LowPower_InitDrv
** 函数描述: 初始化驱动
** 参数:     无
** 返回:     无
********************************************************************/
void HAL_LowPower_InitDrv(void);

/*******************************************************************
** 函数名称: HAL_LowPower_Enter
** 函数描述: 进入低功耗模式
** 参数:     [in] mode 见LOW_POWER_MODE_E
**           [in] time 定时唤醒时间
** 返回:     无
********************************************************************/
void HAL_LowPower_Enter(INT8U mode, INT32U time);

/*******************************************************************
** 函数名称: HAL_LowPower_Exti
** 函数描述: 退出低功耗模式
** 参数:     [in] void
** 返回:     无
********************************************************************/
BOOLEAN HAL_LowPower_Exti(void);

/*******************************************************************
** 函数名称: HAL_LowPower_GetFlag
** 函数描述: 获取低功耗标志
** 参数:     [in] mode 见LOW_POWER_FLAG_E
** 返回:     flag
********************************************************************/
BOOLEAN HAL_LowPower_GetFlag(INT8U flag);

/*******************************************************************
** 函数名称: HAL_LowPower_ClearFlag
** 函数描述: 清低功耗标志
** 参数:     [in] mode 见LOW_POWER_FLAG_E
** 返回:     无
********************************************************************/
void HAL_LowPower_ClearFlag(INT8U flag);

#endif
