/********************************************************************************
**
** 文件名:     st_adc_reg.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现ADC资源的配置管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/08/15 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef ST_ADC_REG_H
#define ST_ADC_REG_H         1
    
/*
********************************************************************************
* define struct
********************************************************************************
*/
typedef struct {
    INT8U  ch;                         /* 统一编号 */
    INT8U  pin_adc;                    /* ADC管脚编号 */
    INT32U channel;                    /* 物理通道 */
    
    INT32U dma_base;                   /* DMA寄存器基址 */
    INT32U adc_base;                   /* ADC寄存器基址 */
    INT32U gpio_base;                  /* GPIO寄存器基址 */
    INT32U adc_rcc;                    /* ADC系统时钟 */
} ADC_REG_T;

/*
********************************************************************************
* 定义统一ADC通道编号
********************************************************************************
*/
#ifdef BEGIN_ADC_CFG
#undef BEGIN_ADC_CFG
#endif

#ifdef END_ADC_CFG
#undef END_ADC_CFG
#endif 

#ifdef ADC_DEF
#undef ADC_DEF
#endif 

#define BEGIN_ADC_CFG

#define ADC_DEF(_CH_, _PIN_ADC_, _ADC_CH_, _DMA_BASE,  _ADC_BASE, _GPIO_BASE, _RCC) \
                 _CH_,
                 
#define END_ADC_CFG

typedef enum {
    #include "st_adc_reg.def"
    ADC_CH_MAX
} ADC_CH_E;



/*******************************************************************
** 函数名:     ST_ADC_GetRegTblInfo
** 函数描述:   获取对应ADC的配置表信息
** 参数:       [in] com: ADC编号,见ADC_CH_E
** 返回:       成功返回配置表指针，失败返回0
********************************************************************/
const ADC_REG_T *ST_ADC_GetRegTblInfo(INT8U com);

/*******************************************************************
** 函数名:    ST_ADC_GetCfgTblMax
** 函数描述:  获取已注册的ADC个数
** 参数:      无
** 返回:      注册的个数
********************************************************************/
INT8U ST_ADC_GetCfgTblMax(void);

#endif

