/********************************************************************************
**
** 文件名:     st_exti_drv.c
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现外部中断配置管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/04/09 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef ST_EXTI_DRV_H
#define ST_EXTI_DRV_H        1

#include "st_gpio_reg.h"


/* 中断边沿触发模式 */
typedef enum {
   EXTI_TRIG_RAIS,           /* 上升沿中断 */
   EXTI_TRIG_FALL,           /* 下降沿中断 */
   EXTI_TRIG_RAIS_FALL,      /* 上下边沿中断 */
   EXTI_TRIG_MAX
} EXTI_TRIG_E;


/*******************************************************************
** 函数名称: ST_EXTI_InitDrv
** 函数描述: 初始化模块
** 参数:     无
** 返回:     无
********************************************************************/
void ST_EXTI_InitDrv(void);

/*******************************************************************
** 函数名称: ST_EXTI_OpenExtiFunction
** 函数描述: 打开中断功能
** 参数:     [in] pinid:    GPIO统一编号,GPIO_PIN_E
**           [in] trig:     中断边沿触发模式,EXTI_TRIG_E
**           [in] callback: 中断处理函数
** 返回:     无
********************************************************************/
BOOLEAN ST_EXTI_OpenExtiFunction(INT8U pinid, INT8U trig, void (*callback)(void));

/*******************************************************************
** 函数名称: ST_EXTI_CloseExtiFunction
** 函数描述: 关闭外部中断功能
** 参数:     [in] pinid:    GPIO统一编号,GPIO_PIN_E
** 返回:     成功返回TRUE,失败返回FALSE
********************************************************************/
BOOLEAN ST_EXTI_CloseExtiFunction(INT8U pinid);

/*******************************************************************
** 函数名称: EXTI0_1_IrqHandle
** 函数描述: 中断服务程序
** 参数:     无
** 返回:     无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) void EXTI0_1_IrqHandle(void);

/*******************************************************************
** 函数名称: EXTI2_3_IrqHandle
** 函数描述: 中断服务程序
** 参数:     无
** 返回:     无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) void EXTI2_3_IrqHandle(void);

/*******************************************************************
** 函数名称: EXTI4_15_IrqHandle
** 函数描述: 中断服务程序
** 参数:     无
** 返回:     无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) void EXTI4_15_IrqHandle(void);

#endif

/************************ (C) COPYRIGHT 2011 XIAMEN YAXON.LTD *******************END OF FILE******/

