/******************************************************************************
**
** Filename:     st_i2c_reg.h
** Copyright:    
** Description:  该模块主要实现串口资源的配置管理
**
*******************************************************************************
**             Revision history
**-----------------------------------------------------------------------------
**| 2014/03/09 | 叶德焰 |  创建文件
*******************************************************************************/
#ifndef ST_I2C_REG_H
#define ST_I2C_REG_H         1
    
/*
********************************************************************************
* define struct
********************************************************************************
*/
typedef struct {
    INT8U  com;                        /* 统一编号 */
    INT8U  enable;                     /* 通道使能 */
    INT32U pin_scl;                    /* SCL管脚编号 */
    INT32U pin_sda;                    /* SDA管脚编号 */
    
    INT32U i2c_base;                   /* I2C寄存器基址 */
    INT32U gpio_base;                  /* GPIO寄存器基址 */
    INT32U i2c_rcc;                    /* I2C系统时钟 */
} I2C_REG_T;

/*
********************************************************************************
* 定义统一串口通道编号
********************************************************************************
*/
#ifdef BEGIN_I2C_CFG
#undef BEGIN_I2C_CFG
#endif

#ifdef END_I2C_CFG
#undef END_I2C_CFG
#endif 

#ifdef I2C_DEF
#undef I2C_DEF
#endif 

#define BEGIN_I2C_CFG

#define I2C_DEF(_COM_, _ENABLE, _PIN_SCL, _PIN_SDA,  _I2C_BASE, _GPIO_BASE, _RCC) \
                 _COM_,
                 
#define END_I2C_CFG

typedef enum {
    #include "st_i2c_reg.def"
    I2C_COM_MAX
} I2C_COM_E;



/*******************************************************************
** 函数名:     ST_I2C_GetRegTblInfo
** 函数描述:   获取对应串口的配置表信息
** 参数:       [in] com: 串口编号,见I2C_COM_E
** 返回:       成功返回配置表指针，失败返回0
********************************************************************/
const I2C_REG_T *ST_I2C_GetRegTblInfo(INT8U com);

/*******************************************************************
** 函数名:    ST_I2C_GetCfgTblMax
** 函数描述:  获取已注册的串口个数
** 参数:      无
** 返回:      注册的个数
********************************************************************/
INT8U ST_I2C_GetCfgTblMax(void);

#endif

