/********************************************************************************
**
** 文件名:     st_i2c_simu.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现模拟I2C接口驱动
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/04/09 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef ST_I2C_SIMU_H
#define ST_I2C_SIMU_H        1



#include "st_i2c_reg.h"

//#if EN_I2C_SIMU > 0


/*******************************************************************
** 函数名称: ST_I2C_InitDrv
** 函数描述: 初始化模块
** 参数:     无
** 返回:     无
********************************************************************/
void ST_I2C_InitDrv(void);

/*******************************************************************
** 函数名称:   ST_I2C_IsOpen
** 函数描述:   I2C总线是否已打开
** 参数:       [in] com: 通道编号,见I2C_COM_E
** 返回:       是返回true,否返回false
********************************************************************/
BOOLEAN ST_I2C_IsOpen(INT8U com);

/*******************************************************************
** 函数名称:   ST_I2C_OpenCom
** 函数描述:   打开I2C总线并初始化
** 参数:       [in] com: 通道编号,见I2C_COM_E
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN ST_I2C_OpenCom(INT8U com);

/*******************************************************************
** 函数名:     ST_I2C_CloseCom
** 函数描述:   关闭I2C
** 参数:       [in] com: 通道编号,见I2C_COM_E
** 返回:       成功返回true, 失败返回false
********************************************************************/
BOOLEAN ST_I2C_CloseCom(INT8U com);

/*******************************************************************
** 函数名:     ST_I2C_SendData
** 函数描述:   发送一串数据,单字节无地址对齐限制
** 参数:       [in] com:       通道,见I2C_COM_E
**             [in] devaddr:   设备地址
**             [in] writeaddr: 数据的起始地址
**             [in] sptr:      数据指针
**             [in] slen:      数据长度
** 返回:       成功返回TRUE,失败返回FALSE
********************************************************************/
BOOLEAN ST_I2C_SendData(INT8U com, INT16U devaddr, INT16U writeaddr, INT8U *sptr, INT16U slen);

/*******************************************************************
** 函数名:     ST_I2C_SetReadAddr
** 函数描述:   设置读取数据地址
** 参数:       [in]  com:       通道,见I2C_COM_E
**             [in]  devaddr:   设备地址
**             [in]  readaddr:  数据的起始地址
** 返回:       成功返回TRUE,失败返回FALSE
********************************************************************/
BOOLEAN ST_I2C_SetReadAddr(INT8U com, INT16U devaddr, INT16U readaddr);

/*******************************************************************
** 函数名:     ST_I2C_ReadData
** 函数描述:   读取一串字节数据,在这之前必须调用ST_I2C_SetReadAddr
** 参数:       [in]  com:       通道,见I2C_COM_E
**             [in]  devaddr:   设备地址
**             [out] dptr:      返回读取数据
**             [out] maxlen:    读取数据长度
** 返回:       返回读取的字节数
********************************************************************/
INT16U ST_I2C_ReadData(INT8U com, INT16U devaddr, INT8U *dptr, INT16U maxlen);

//#endif
#endif
/************************** (C) COPYRIGHT 2010 XIAMEN YAXON.LTD *******************END OF FILE******/


