/********************************************************************************
**
** 文件名:     st_rtc_drv.h
** 版权所有:   (c) 2007-2008 厦门雅迅网络股份有限公司
** 文件描述:   该模块主要实现RTC实时时钟配置管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/04/09 | 叶德焰 |  创建第一版本
*********************************************************************************/
#ifndef ST_RTC_DRV_H
#define ST_RTC_DRV_H        1



/* RTC时钟源 */
typedef enum {
   RTC_CLOCK_LSI,           /* 内部低速时钟 */
   RTC_CLOCK_LSE,           /* 外部低速时钟 */
   RTC_CLOCK_HSE_DIV32,     /* 外部高速时钟/32 */
   RTC_CLOCK_MAX
} RTC_CLOCK_E;

/*******************************************************************
** 函数名称: RTC_WaitForSynchro2
** 函数描述: 对st库RTC_WaitForSynchro函数进行重写,加入计数防止无限循环
** 参数:     无
** 返回:     是否执行成功.
********************************************************************/
BOOLEAN RTC_WaitForSynchro2(void);

/*******************************************************************
** 函数名称: RTC_WaitForLastTask2
** 函数描述: 对st库RTC_WaitForLastTask函数进行重写,加入计数防止无限循环
** 参数:     无
** 返回:     是否执行成功.
********************************************************************/
BOOLEAN RTC_WaitForLastTask2(void);

/*******************************************************************
** 函数名称: ST_RTC_InitDrv
** 函数描述: 初始化模块
** 参数:     无
** 返回:     无
********************************************************************/
void ST_RTC_InitDrv(void);

/*******************************************************************
** 函数名称: ST_RTC_OpenRtcFunction
** 函数描述: 打开RTC功能
** 参数:     [in] clock:  时钟源, 见 RTC_CLOCK_E
** 返回:     成功返回TRUE,失败返回FALSE
********************************************************************/
BOOLEAN ST_RTC_OpenRtcFunction(INT8U clock);

/*******************************************************************
** 函数名称: ST_RTC_CloseRtcFunction
** 函数描述: 关闭RTC功能
** 参数:     无
** 返回:     成功返回TRUE,失败返回FALSE
********************************************************************/
BOOLEAN ST_RTC_CloseRtcFunction(void);

/*******************************************************************
** 函数名称: ST_RTC_SetSystime
** 函数描述: 设置系统时间
** 参数:     [in] date:    系统日期
**           [in] time:    系统时间
**           [in] weekday:  周天,1-7
** 返回:     成功返回TRUE,失败返回FALSE
********************************************************************/
BOOLEAN ST_RTC_SetSystime(DATE_T *date, TIME_T *time, INT8U weekday);

/*******************************************************************
** 函数名称: ST_RTC_GetSystime
** 函数描述: 获取系统时间
** 参数:     [in] date:       系统日期
**           [in] time:       系统时间
**           [in] weekday:    周天,1-7
**           [in] subsecond:  小数点秒
** 返回:     成功返回TRUE,失败返回FALSE
********************************************************************/
BOOLEAN ST_RTC_GetSystime(DATE_T *date, TIME_T *time, INT8U *weekday, INT32U *subsecond);

/*******************************************************************
** 函数名称: ST_RTC_BattleIsNormal
** 函数描述: 获取RTC电池状态
** 参数:     无
** 返回:     正常返回TRUE,否则返回FALSE
********************************************************************/
BOOLEAN ST_RTC_BattleIsNormal(void);

#endif

/************************ (C) COPYRIGHT 2011 XIAMEN YAXON.LTD *******************END OF FILE******/

