/**************************************************************************************************
**                                                                                               **
**  文件名称:  APP_update.h                                                                      **
**  版权所有:  CopyRight @ Xiamen Yaxon NetWork CO.LTD. 2011                                     **
**  创建信息:  2011-12-23 By clt: 创建本文件                                                     **
**  文件描述:  无线升级应用层接口函数                                                            **
**  ===========================================================================================  **
**  修改信息:  单击此处添加....                                                                  **
**************************************************************************************************/
#ifndef __APP_UPDATE_H
#define __APP_UPDATE_H

#include  "app_include.h"

#define  SPECIAL_CHCKSUM        0x10000001                                     /* 特殊校验和，在校验和刚好=0xffffffff */

#define  HEX_TYPE               0x01                                           /* HEX文件类型 */
#define  BIN_TYPE               0x02                                           /* BIN文件类型 */

#define  UPDATE_NONE            0x00000000                                     /* 没有升级更新 */
#define  UPDATE_WIRELESS        0x00000001                                     /* 无线升级     */
#define  UPDATE_MANUAL          0x00000002                                     /* 手动升级     */

/*************************************************************************************************/
/*                           升级参数区参数位置枚举                                                      */
/*************************************************************************************************/
typedef enum {
    PARA_MAINCHKSUM = 0x00,                                                    /* 第0参数:主程序校验和 */
    PARA_MAINLEN,                                                              /* 第1参数:主程序长度 */
    PARA_BACKCHKSUM,                                                           /* 第2参数:备份程序校验和 */
    PARA_BACKLEN,                                                              /* 第3参数:备份程序长度 */
    PARA_MODE,                                                                 /* 第4参数:升级的模式，手动、无线、无 */
    PARA_MAX                                                                   /* 参数总个数 */
} UPDATA_PARA_E;

/*************************************************************************************************/
/*                           升级各个阶段枚举                                                    */
/*************************************************************************************************/
typedef enum {
    UPSTATUS_NONE = 0x00,                                                      /* 未进入升级流程 */
    UPSTATUS_START,                                                            /* 备份区正常，开始进入升级流程 */
    UPSTATUS_LOADING,                                                          /* 升级数据下载中 */
    UPSTATUS_LOADSUCESS,                                                       /* 升级数据下载成功 */
    UPSTATUS_FAILURE                                                           /* 升级失败 */
} UPDATE_STATUS_E;

/*************************************************************************************************/
/*                           升级结果枚举                                                        */
/*************************************************************************************************/
typedef enum {
    UP_RESULT_END =0x00,                                                       /* 导出结束 */
    UP_RESULT_SUCESS,                                                          /* 导出一帧成功 */
    UP_RESULT_BUSY,                                                            /* 忙碌，失败 */
    UP_RESULT_REJECT,                                                          /* 数据串出错，驳回 */
    UP_RESULT_UNKNOWERROR                                                      /* 未知错误，失败终止 */    
}UPDATE_RESULE_E;

void UpDateMode_Init(void);
/*******************************************************************************
**  函数名称:  ResetMcuDelay
**  功能描述:  复位MCU延时
**  输入参数:  [IN]	sec:	秒
**  返回参数:  无
******************************************************************************/
void ResetMcuDelay(INT32U sec) ;

#endif
/**************************** (C) COPYRIGHT 2011  XIAMEN YAXON.LTD **************END OF FILE******/

