/********************************************************************************
**
** 文件名:     dal_gpio.h
** 版权所有:   (c) 2014-2020 厦门雅迅网络股份有限公司
** 文件描述:   GPIO驱动接口函数
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/12/29 | JUMP   | 创建本模块
**
*********************************************************************************/
#ifndef  _DRV_GPIO_H
#define  _DRV_GPIO_H


/*******************************************************************
** 函数名:     CreateInputPort
** 函数描述:   创建输入管脚
** 参数:       [in] pgrp  管脚端口,如GPIOA,GPIOB,GPIOC,GPIOD,GPIOE等 
**             [in] pnum  管脚号
**             [in] mode  输入的模式
**             [in] lock  是否锁住配置
** 返回:       无
********************************************************************/
void CreateInputPort(INT32U pgrp, INT16U pnum, INT32U mode, BOOLEAN lock);

/*******************************************************************
** 函数名:     CreateOutputPort
** 函数描述:   创建输出管脚
** 参数:       [in] pgrp  管脚端口,如GPIOA,GPIOB,GPIOC,GPIOD,GPIOE等 
**             [in] pnum  管脚号
**             [in] mode  输出的模式
**             [in] speed  :输出的速率
**             [in] lock  是否锁住配置
** 返回:       无
********************************************************************/
void CreateOutputPort(INT32U pgrp, INT16U pnum, INT32U mode, INT32U speed, BOOLEAN lock);
 
/*******************************************************************
** 函数名:     ReadInputPort
** 函数描述:   读取输入管脚状态
** 参数:       [in] pgrp  管脚端口,如GPIOA,GPIOB,GPIOC,GPIOD,GPIOE等 
**             [in] pnum  管脚号
** 返回:       高电平情况下返回TRUE，低电平情况下返回FALSE
********************************************************************/
BOOLEAN  ReadInputPort(INT32U pgrp, INT16U pnum);

/*******************************************************************
** 函数名:     ReadOutputPort
** 函数描述:   读取输出管脚状态
** 参数:       [in] pgrp  管脚端口,如GPIOA,GPIOB,GPIOC,GPIOD,GPIOE等 
**             [in] pnum  管脚号
** 返回:       高电平情况下返回TRUE，低电平情况下返回FALSE
********************************************************************/
BOOLEAN  ReadOutputPort(INT32U pgrp, INT16U pnum);

/*******************************************************************
** 函数名:     WriteOutputPort
** 函数描述:   写输出管脚
** 参数:       [in] pgrp    管脚端口,如GPIOA,GPIOB,GPIOC,GPIOD,GPIOE等 
**             [in] pnum    管脚号
**             [in] ishigh  TRUE表示输出高电平，FALSE表示输出低电平 
** 返回:       无
********************************************************************/
void WriteOutputPort(INT32U pgrp, INT16U pnum, BOOLEAN ishigh);

/*******************************************************************
** 函数名:     Read_InputGPIOxData
** 函数描述:   读取某个GPIO管脚组的输入寄存器的数据
** 参数:       [in] pgrp    管脚端口,如GPIOA,GPIOB,GPIOC,GPIOD,GPIOE等 
** 返回:       对应管脚组16个管脚的当前输入寄存器的数值
********************************************************************/
INT16U Read_InputGPIOxData(INT32U pgrp);

/*******************************************************************
** 函数名:     Read_OutPutGPIOxData
** 函数描述:   读取某个GPIO管脚组的输出寄存器的数据
** 参数:       [in] pgrp    管脚端口,如GPIOA,GPIOB,GPIOC,GPIOD,GPIOE等 
** 返回:       对应管脚组16个管脚的当前输出寄存器的数值
********************************************************************/
INT16U Read_OutPutGPIOxData(INT32U pgrp);

/*******************************************************************
** 函数名:     Write_GPIOx
** 函数描述:   对某个GPIO管脚组的输出寄存器进行赋值
** 参数:       [in] pgrp       管脚端口,如GPIOA,GPIOB,GPIOC,GPIOD,GPIOE等
**             [in] portvalue  16个管脚寄存器的值，注意，如果没有用到所有管脚，那么其他管脚的值必须保留
** 返回:       无
********************************************************************/
void Write_GPIOx(INT32U pgrp, INT16U portvalue);

/*******************************************************************
** 函数名:     dal_gpio_getsource
** 函数描述:   转化为pinsource
** 参数:       [in] pnum  管脚号
** 返回:       
********************************************************************/
INT8U  dal_gpio_getsource(INT16U pnum);

/*******************************************************************
** 函数名:     DAL_GpioPortCfg
** 函数描述:   引脚配置
** 参数:       [in] pgrp  管脚端口,如GPIOA,GPIOB,GPIOC,GPIOD,GPIOE等 
**             [in] pnum  管脚号
**             [in] mode  输出的模式
**             [in] speed  :输出的速率
**             [in] lock  是否锁住配置
** 返回:       无
********************************************************************/
void DAL_GpioPortCfg(INT32U pgrp, INT16U pnum, INT32U mode, INT32U speed, BOOLEAN lock);

#endif /* _DRV_GPIO_H */
/**************************** (C) COPYRIGHT 2010 XIAMEN YAXON.LTD **************END OF FILE******/
