/********************************************************************************
**
** 文件名:     dal_can.h
** 版权所有:   (c) 2014-2020 厦门雅迅网络股份有限公司
** 文件描述:   CAN总线通信驱动模块头文件
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/12/29 | JUMP   | 创建本模块
**
*********************************************************************************/
#ifndef __DAL_CAN_H
#define __DAL_CAN_H

#include "dal_include.h"

#define MAX_CANIDS            105                                     /* CAN的ID对象总数 */


#define MAX_RXIDOBJ           13                                     /* CAN的接收ID对象个数 */
#define CAN_SENDPERIOD        10                                     /* CAN周期发送最小时间(ms) */
/*************************************************************************************************/
/*                         系统时钟 72MHz ，PCLK1 = 36MHz = APB1                                */
/*                       CAN_bps = APB1 / ((BS1 + BS2 + 1) * Prescaler                           */
/*  CANopen 协议中推荐的设置。                                                                   */
/*  1Mbps 速率下，采用点的位置在6tq位置处，BS1=5, BS2=2                                          */
/*  500kbps 速率下，采用点的位置在8tq位置处，BS1=7, BS2=3                                        */
/*  250kbps 速率下，采用点的位置在14tq位置处，BS1=13, BS2=2                                      */
/*  125k, 100k, 50k, 20k, 10k 的采用点位置与 250K 相同。                                         */
/*************************************************************************************************/
#define CANSWJ                CAN_BT_SJW_1TQ

#define CAN_BS1_1000K         CAN_BT_BS1_3TQ        
#define CAN_BS2_1000K         CAN_BT_BS2_2TQ
#define CAN_PRES_1000K        (PCLK1_FREQ / (1000000 * 6))       /* Prescaler */
      
#define CAN_BS1_500K          CAN_BT_BS1_3TQ
#define CAN_BS2_500K          CAN_BT_BS2_2TQ
#define CAN_PRES_500K         (PCLK1_FREQ / (500000 * 6))       /* Prescaler */

#define CAN_BS1_250K          CAN_BT_BS1_3TQ   
#define CAN_BS2_250K          CAN_BT_BS2_2TQ
#define CAN_PRES_250K         (PCLK1_FREQ / (250000 * 6))       /* Prescaler */

#define CAN_PRES_125K         (PCLK1_FREQ / (125000 * 9))       /* Prescaler */
#define CAN_PRES_100K         (PCLK1_FREQ / (100000 * 9))       /* Prescaler */
#define CAN_PRES_50K          (PCLK1_FREQ / (50000 * 9))        /* Prescaler */
#define CAN_PRES_20K          (PCLK1_FREQ / (20000 * 9))        /* Prescaler */
#define CAN_PRES_10K          (PCLK1_FREQ / (10000 * 9))        /* Prescaler */


/*************************************************************************************************/
/*                              波特率枚举                                                      */
/*************************************************************************************************/
typedef enum {
    CAN_10    = 10,
    CAN_20    = 20,
    CAN_50    = 50,
    CAN_100   = 100,
    CAN_125   = 125,
    CAN_250   = 250,
    CAN_500   = 500,
    CAN_1000  = 1000    
} CAN_BAUD_E;

/*************************************************************************************************/
/*                              数据帧类型                                                       */
/*************************************************************************************************/
typedef enum {
    _FRAME_STD  = CAN_FF_STANDARD,                                        /* 标准帧 */
    _FRAME_EXT  = CAN_FF_EXTENDED                                         /* 扩展帧 */
} FRAMETYPE_E;

/*************************************************************************************************/
/*                              数据帧格式                                                       */
/*************************************************************************************************/
typedef enum {
    _FRAME_DATA = CAN_FT_DATA,                                      /* 数据帧 */
    _FRAME_RMOT = CAN_FT_REMOTE                                     /* 远程帧 */
} FRAMEFMAT_E;

/*************************************************************************************************/
/*                              工作模式                                                         */
/*************************************************************************************************/
typedef enum {
    CAN_MODE_UNSET    = 0x00,                                        /* 尚未配置模式 */
    CAN_MODE_LUCIDLY  = 0x01,                                        /* 完全透传模式 */
    CAN_MODE_REPORT   = 0x02,                                        /* 主动上报模式 */   
    CAN_MODE_QUERY    = 0x03                                         /* 被动查询模式 */
} CAN_WORKMODE_E;


/*************************************************************************************************/
/*                           CAN滤波方式枚举                                            */
/*************************************************************************************************/
typedef enum {
    CAN_FILTER_OFF    = 0x00,
    CAN_FILTER_ON     = 0X01,
    CAN_FILTER_ACTION
}CAN_FILTERCTRL_E;

/*************************************************************************************************/
/*                           CAN参数设置有效与否枚举                                             */
/*************************************************************************************************/
typedef enum {
    CAN_IS_SET   = 0x01,                                             /* 参数已设置 */                      
    CAN_UN_SET   = 0x02,                                             /* 参数未设置 */  
} CAN_PARA_SET_E;
/*************************************************************************************************/
/*                           CAN测试模式否枚举                                             */
/*************************************************************************************************/
typedef enum {
    CAN_NORMAL_MODE    = Can_NORMAL_MODE,                            /* 正常模式 */                      
    CAN_LOOPBACK_MODE  = Can_LOOPBACK_MODE,                          /* 环回模式(只能收到自己发送的数据) */  
    CAN_SILENT_MODE    = Can_SILENT_MODE,                            /* 静默模式(只收不发) */  
} CAN_TEST_MODE_E;
/*************************************************************************************************/
/*                             CAN属性结构体                                                     */
/*************************************************************************************************/
typedef struct {
    BOOLEAN         onoff;                                           /* 功能开关 */
    CAN_BAUD_E      baud;                                            /* 波特率 */
    FRAMETYPE_E     type;                                            /* 帧类型 */
    FRAMEFMAT_E     fmat;                                            /* 帧格式 */
    CAN_TEST_MODE_E test_mode;                                       /* 测试模式 */
    CAN_PARA_SET_E  comm_effect;                                     /* 通信参数有效与否 */
    CAN_WORKMODE_E  mode;                                            /* 工作模式 */
    CAN_PARA_SET_E  mode_effect;                                     /* 工作模式有效与否 */
    CAN_PARA_SET_E  id_effect;                                       /* ID配置有效与否 */
    CAN_FILTERCTRL_E filteronoff;                                    /* 滤波是否开启 */
} CAN_ATTR_T;

/*************************************************************************************************/
/*                           数据包覆盖模式枚举                                                  */
/*************************************************************************************************/
typedef enum {
    CAN_COVER_NEW = 0x00,                                            /* 只存最新的一帧 */
    CAN_COVER_CHUCK,                                                 /* 丢弃新数据 */
    CAN_COVER_OLD,                                                   /* 覆盖最旧的数据 */
    CAN_COVER_LAST                                                   /* 覆盖最新的数据 */
} CAN_COVER_E;

/*************************************************************************************************/
/*                           ID内容、属性结构体                                                  */
/*************************************************************************************************/
typedef struct {
    INT32U      id;                                                  /* 滤波的ID */
    BOOLEAN     isused;                                              /* ID是否被配置 */
} FILTER_T;

#if 0
typedef struct {
    INT32U      id;                                                  /* 滤波的ID */
    INT32U      screeid;                                             /* 屏蔽ID*/
    INT32U      id_rec;                                              /* 实际收到的ID */
    BOOLEAN     isused;                                              /* ID是否被配置 */
    INT8U       mode;                                                /* 存储模式 */
    INT8U       stores;                                              /* 所需存储的总条数 */
    INT8U       storecnt;                                            /* 已经收到的条数 */
    INT8U       storeadd;                                            /* 存储的位置 */
    INT8U       type;                                                /* 帧格式:扩展帧或标准帧 */
    INT8U       len;                                                 /* 数据长度 */
    INT8U       storebuf[8];                                         /* 存储的缓冲区,存储最新的一包 */
} IDPARA_T;
#endif
typedef struct {
    INT32U      id;                                                  /* 滤波的ID */
    INT16U      period;                                              /* 发送报文的周期 */
    INT16U      timecnt;                                             /* 发送计时 */
    BOOLEAN     isused;                                              /* ID是否被配置 */
    INT8U       len;                                                 /* 数据长度 */
    INT8U       storebuf[8];                                         /* 存储的缓冲区,存储最新的一包 */
} ID_SEND_T;
#if 0
typedef struct {
    INT8U       id[4];                                               /* 滤波的ID */
    INT8U       channel;                                             /* 通道 */
    INT8U       type;                                                /* 标准帧/扩展帧 */
    INT8U       len;                                                 /* 数据长度 */
    INT8U       databuf[8];                                          /* 存储的缓冲区 */
} CAN_DATA_HANDLE_T;
#endif
typedef struct {
    INT8U       channel;                /* 通道 */
    INT8U       id[4];                  /* 滤波的ID */
    INT8U       format;                 /* 标准帧/扩展帧 */
    INT8U       type;                   /* 数据帧/远程帧*/
    INT8U       len;                    /* 数据长度 */
    INT8U       databuf[8];             /* 存储的缓冲区 */
} CAN_DATA_HANDLE_T;

/*************************************************************************************************/
/*                           CAN回调APP层索引枚举                                                */
/*************************************************************************************************/
typedef enum {
    LB_REPORT = 0x00,                                                /* 回调上报函数 */
    LUCIDLY_REPORT,                                                  /* 新透传 */
    LB_ANALYZE,                                                      /* 特殊报文解析 */
    LB_HANDSHAKE,                                                    /* 特殊握手报文解析 */
    LB_MAX
}CAN_LBINDEX_E;

/*******************************************************************
** 函数名:     Dal_CAN_Init
** 函数描述:   CAN底层初始化
** 参数:       无
** 返回:       无
********************************************************************/
void Dal_CAN_Init(void);

/*******************************************************************
** 函数名:     Dal_CANLBRepReg
** 函数描述:   CAN回调上报函数
** 参数:       [in] handle             指向APP层的函数指针
** 返回:       无
********************************************************************/
void Dal_CANLBRepReg(CAN_LBINDEX_E index, void (* handle) (CAN_DATA_HANDLE_T *CAN_msg));

/*******************************************************************
** 函数名:     CANRegularReport
** 函数描述:   CAN定时采集函数
** 参数:       无
** 返回:       无
********************************************************************/
void CANRegularReport(void);

/*******************************************************************
** 函数名:     GetStoreNum
** 函数描述:   获取指定ID目前缓存的条数
** 参数:       [in] serial             ID序号
**             [in] channel            通道号
** 返回:       已经收到并缓存的条数
********************************************************************/
INT8U GetStoreNum(INT8U serial, INT8U channel);

/*******************************************************************
** 函数名:     GetStoreData
** 函数描述:   app层获取缓存的CAN数据，用于被动查询模式
** 参数:       [in] idcnts             ID序号
**             [in] channel            通道号
**             [out] buf               存储缓存数据的起始地址
** 返回:       数据总长度
********************************************************************/
INT16U GetStoreData(INT8U idcnts, INT8U *buf, INT8U channel);

/*******************************************************************
** 函数名:     GetIDCnts
** 函数描述:   获取当前通道已经配置的过滤ID个数
** 参数:       [in] channel            CAN 通道
** 返回:       已配置的过滤ID个数
********************************************************************/
INT8U GetIDCnts(INT8U channel);

/*******************************************************************
** 函数名:     GetIDIsUsed
** 函数描述:   获取ID是否被使用
** 参数:       [in] idcnts             序号
**             [in] channel            CAN 通道
** 返回:       true  or false
********************************************************************/
BOOLEAN GetIDIsUsed(INT8U idcnts, INT8U channel);

/*******************************************************************
** 函数名:     GetID
** 函数描述:   获取ID值
** 参数:       [in] idcnts             序号
**             [in] channel            CAN 通道
** 返回:       ID值
********************************************************************/
INT32U GetID(INT8U idcnts, INT8U channel);

/*******************************************************************
** 函数名:     GetIDPara
** 函数描述:   获取滤波ID属性参数
** 参数:       [in] idcnts             序号
**             [in] channel            CAN 通道
** 返回:       指向ID属性结构体的地址
********************************************************************/
//IDPARA_T* GetIDPara(INT8U idcnts, INT8U channel);

/*******************************************************************
** 函数名:     SetIDPara
** 函数描述:   设置滤波ID属性参数
** 参数:       [in] idcnts             序号
**             [in] channel            CAN 通道
** 返回:       无
********************************************************************/
//void SetIDPara(IDPARA_T *idset, INT8U idcnts, INT8U channel);
BOOLEAN DAL_CAN_TxData_Dir(INT8U *data, INT8U channel);
/*******************************************************************
** 函数名:     DAL_CAN_TxData
** 函数描述:   CAN发送数据接口函数
** 参数:       [in] data               指向数据区域指针(排列:ID len 数据)
**             [in] wait               是否等待发送成功应答
**             [in] channel            CAN 通道
** 返回:       发送结果
********************************************************************/
BOOLEAN DAL_CAN_TxData(INT8U *data, BOOLEAN wait, INT8U channel);

/*******************************************************************
** 函数名:     CAN_RxFilterConfig
** 函数描述:   CAN接收滤波
** 参数:       [in] filter_id          标示符
**             [in] screen_id          屏蔽位，相当于掩码，为0的位不关心，为1的位必须匹配
**             [in] onoff              是否开启滤波，CAN_FILTER_ON 配置idset的滤波ID，CAN_FILTER_OFF 不进行滤波接收所有ID
**             [in] channel            CAN 通道
** 返回:       设置结果
********************************************************************/
BOOLEAN CAN_RxFilterConfig(INT32U filter_id, INT32U screen_id, CAN_FILTERCTRL_E onoff, INT8U channel);

/*******************************************************************
** 函数名:     CAN_WorkModeSet
** 函数描述:   CAN工作模式配置: 完全透传\主动上报\被动查询
** 参数:       [in] para               参数
**             [in] channel            CAN 通道
** 返回:       无
********************************************************************/
void CAN_WorkModeSet(CAN_ATTR_T *para, INT8U channel);

/*******************************************************************
** 函数名:     CAN_CommParaSet
** 函数描述:   CAN通信参数配置：roundbuf\波特\数据帧格式\类型
** 参数:       [in] para               参数
**             [in] channel            CAN 通道
** 返回:       无
********************************************************************/
void CAN_CommParaSet(CAN_ATTR_T *para, INT8U channel);

/*******************************************************************
** 函数名:     CAN_OnOFFCtrl
** 函数描述:   CAN通讯功能开与关模块
** 参数:       [in] onoff              开关
**             [in] channel            CAN 通道
** 返回:       无
********************************************************************/
void CAN_OnOFFCtrl (BOOLEAN onoff, INT8U channel);

/*******************************************************************
** 函数名:     CAN_ClearFilterPara
** 函数描述:   清除指定的CAN滤波ID
** 参数:       [in] idnums             序号，0 ~ 13
**             [in] channel            CAN 通道
** 返回:       设置结果
********************************************************************/
BOOLEAN CAN_ClearFilterPara(INT8U idnums, INT8U channel);

/*******************************************************************
** 函数名:     CAN_ClearFilterByID
** 函数描述:   清除指定的CAN滤波ID
** 参数:       [in] id                 所要清的ID
**             [in] channel            CAN 通道
** 返回:       无
********************************************************************/
BOOLEAN CAN_ClearFilterByID(INT32U id, INT8U channel);

/*******************************************************************
** 函数名:     Dal_SetCANMsg_Period
** 函数描述:   设置周期性发送CAN报文
** 参数:       [in] id                 发送ID
**             [in] ptr                发送长度和数据
**             [in] period             发送周期，单位10ms
**             [in] channel            CAN 通道
** 返回:       设置结果
********************************************************************/
BOOLEAN Dal_SetCANMsg_Period(INT32U id, INT8U *ptr, INT16U period, INT8U channel);

/*******************************************************************
** 函数名:     Dal_StopCANMsg_Period
** 函数描述:   停止周期发送
** 参数:       [in] id                 发送ID
**             [in] channel            CAN 通道
** 返回:       设置结果
********************************************************************/
BOOLEAN Dal_StopCANMsg_Period(INT32U id, INT8U channel);

/*******************************************************************
** 函数名:     ChickCanID
** 函数描述:   确认ID是否有效
** 参数:       [in] id                 传入的CAN ID
**             [in] channel            CAN 通道
** 返回:       为0时表示未找到
********************************************************************/
INT32U  ChickCanID(INT32U id,INT8U chanl);

/*******************************************************************
** 函数名:     SendCANMsg_Period
** 函数描述:   周期性发送CAN报文
** 参数:       无
** 返回:       无
********************************************************************/
void SendCANMsg_Period(void);

/*******************************************************************
** 函数名:     SendCANMsg_FromBuf
** 函数描述:   发送缓冲区中的CAN报文
** 参数:       无
** 返回:       无
********************************************************************/
void SendCANMsg_FromBuf(void);

/**************************************************************************************************
**  函数名称:  CheckCanIsErrer
**  功能描述:  查看CAN总线是否出错
**  输入参数:
**  返回参数:
**************************************************************************************************/
BOOLEAN CheckCanIsErrer(INT8U channel);
#if EN_UDS > 0
/*******************************************************************
** 函数名称:   HAL_CAN_SendIdAccessSet
** 函数描述:   允许发送id设置
** 参数:       [in] com :  通道编号,见CAN_COM_E
               [in] set :  TRUE:打开发送id是否允许发送判断
               [in] id  :  发送id
               [in] idx :  允许发送id列表下表号:(0 ~ (MAX_ACCESS_SEND_ID_NUM-1))
** 返回:       剩余空间字节数
********************************************************************/
void HAL_CAN_SendIdAccessSet(INT8U com, BOOLEAN set, INT32U id, INT8U idx);
/*******************************************************************
 ** 函数名:        can_Reset_PeriodSendPeriod
 ** 函数描述:   周期性重新计数
 ** 参数:        无
 ** 返回:        无
 ********************************************************************/
void dal_CAN_Reset_PeriodSendPeriod(void); 
#endif
#if SOFT_BUSOFF_RECOBRY > 0
/**************************************************************************************************
**  函数名称:  GetBusOffStatus
**  功能描述:  获取busoff状态
**  输入参数:
**  返回参数:  TRUE BUSOFF FALSE 
**************************************************************************************************/
BOOLEAN GetBusOffStatus(INT8U chn);
/*******************************************************************************
** 函数名:    CanBusoffHal
** 函数描述:   CAN BusOff处理
** 参数:       无
** 返回:       无
******************************************************************************/
void CanBusOffHal(void);
#endif
#endif
/**************************** (C) COPYRIGHT 2012  XIAMEN YAXON.LTD **************END OF FILE******/

