/**************************************************************************************************
**                                                                                               **
**  文件名称:  dal_simi2c_2.h                                                                        **
**  版权所有:  CopyRight @ Xiamen Yaxon NetWork CO.LTD. 2012                                     **
**  创建信息:  2012-9-14 By lyj: 创建本文件                                                      **
**  文件描述:  模拟I2C接口                                                            **
**  ===========================================================================================  **
**  修改信息:  单击此处添加....                                                                  **
**************************************************************************************************/
#ifndef __DAL_SIMI2C_2_H
#define __DAL_SIMI2C_2_H
#include  "dal_include.h"

// I2C通道编号定义
typedef enum {
    I2C_SIM_IDX_0 = 0,//6轴传感器
	I2C_SIM_IDX_1,//sd2058
    MAX_I2C_SIM_IDX
} I2C_SIM_IDX_E;

// I2C读写操作参数结构体
typedef struct {
    INT8U  devaddr;      /*从机设备地址*/
    INT8U  addr;         /*寄存器地址*/
    INT8U  *buf;         /*数据缓冲区*/
    INT16U  dlen;        /*数据长度*/
} I2C_SIM_OPPARA_T;


/*
*********************************************************************************
*                   对外接口声明
*********************************************************************************
*/
/********************************************************************************
**  函数名称:  dal_i2c_sim_ReadData
**  功能描述:  从I2C外设读数据
**  输入参数:  [in]  idx:     I2C通道编号,从0开始
**                  optpara:  I2C读写操作参数结构体指针
**  返回参数:  TRUE，读取成功； FALSE，读取失败
********************************************************************************/
BOOLEAN dal_i2c_sim_ReadData(INT8U idx, I2C_SIM_OPPARA_T *op_para);
/********************************************************************************
**  函数名称:  dal_i2c_sim_ReadByte
**  功能描述:  从I2C外设读一个字节
**  输入参数:  [in]  idx:     I2C通道编号,从0开始
**                  devaddr: 从机地址
**                  rdaddr:  读取的目标地址
**                  rd_buf: 读取缓冲,1字节
**  返回参数:  读取成功返回读到的字节； 读取失败返回 -1.
********************************************************************************/
BOOLEAN dal_i2c_sim_ReadByte(INT8U idx, INT8U devaddr, INT8U readaddr,INT8U *rd_buf);


/********************************************************************************
**  函数名称:  dal_i2c_sim_WriteData
**  功能描述:  向I2C外设写数据
**  输入参数:  [in]  idx:     I2C通道编号,从0开始
**                  optpara:  I2C读写操作参数结构体指针
**  返回参数:  TRUE，写入成功； FALSE，写入失败
********************************************************************************/
BOOLEAN dal_i2c_sim_WriteData(INT8U idx, I2C_SIM_OPPARA_T *op_para);

/********************************************************************************
**  函数名称:  dal_i2c_sim_WriteByte
**  功能描述:  向I2C外设写一个字节
**  输入参数:  [in]  idx:     I2C通道编号,从0开始
**                  devaddr: 从机地址
**                  wraddr:  写入的目标地址
**                  wrbyte:  待写入的字节
**  返回参数:  TRUE，写入成功； FALSE，写入失败
********************************************************************************/
BOOLEAN dal_i2c_sim_WriteByte(INT8U idx, INT8U devaddr, INT8U wraddr, INT8U wrbyte);


/********************************************************************************
**  函数名称:  dal_i2c_GetState
**  功能描述:  获取g-sensor设备工作状态
**  输入参数:  idx:传感器序号
**  返回参数:  TRUE:准备就绪    FALSE:未准备好
********************************************************************************/
BOOLEAN dal_i2c_GetState(INT8U idx);

/********************************************************************************
**  函数名称:  dal_i2c_sim_Open
**  功能描述:  打开指定的I2C通道
**  输入参数:  [in] idx: I2C通道编号,从0开始
**  返回参数:  TRUE，打开成功； FALSE，打开失败
********************************************************************************/
BOOLEAN dal_i2c_sim_Open(INT8U idx);

/********************************************************************************
**  函数名称:  dal_i2c_sim_Close
**  功能描述:  关闭指定的I2C通道
**  输入参数:  [in] idx: I2C通道编号,从0开始
**  返回参数:  无
********************************************************************************/
void dal_i2c_sim_Close(INT8U idx);

/********************************************************************************
**  函数名称:  dal_i2c_sim_Init
**  功能描述:  I2C通道初始化，底层系统级专用接口，非面向上层
**  输入参数:  无
**  返回参数:  无
********************************************************************************/
void dal_i2c_sim_Init(void);

#endif
/**************************** (C) COPYRIGHT 2012  XIAMEN YAXON.LTD **************END OF FILE******/

