/**************************************************************************************************
**                                                                                               **
**  文件名称:  dal_spi.h                                                                       **
**  版权所有:  CopyRight @ Xiamen Yaxon NetWork CO.LTD. 2012                                     **
**  创建信息:                                                                                    **
**  文件描述:  SPI驱动接口函数                                                                   **
**  ===========================================================================================  **
**  修改信息:  单击此处添加....                                                                  **
**************************************************************************************************/
#ifndef __DAL_SPI_H
#define __DAL_SPI_H


/*************************************************************************************************/
/*                           spi回调APP层索引枚举                                                */
/*************************************************************************************************/
typedef struct {
    INT8U  (*callback_spiintrxmsg) (INT8U ReceivedDat); /* SPI中断接收回调函数指针 */
} SPI_CALLBACK_T;

typedef enum {
    SPI_IND_1,    /* 对应spi1(用于can芯片) */
    SPI_IND_2,    /* 对应spi4(用于加密芯片) */
    MAX_SPI_IND
} SPI_IND_E;

/*************************************************************************************************/
/*                           SPIDMA模式枚举                                                    */
/*************************************************************************************************/
typedef enum {
    SPI_DMA_MODE_DISABLE = 0x00,                                           /* 中断模式收发 */
    SPI_DMA_MODE_ENABLE,                                                   /* DMA模式收发  */
    SPI_LOOP_MODE_ENABLE,                                                  /* 查询状态传输模式 */
    MAX_SPI_DMA_MODE,
} SPI_DMA_MODE_E;


/*******************************************************************
** 函数名:     Spix_GetDmaMode
** 函数描述:   获取收据收发模式
** 参数:       [in] idx : spi编号
** 返回:       0x00: 中断模式
               0x01: DMA模式
********************************************************************/
INT8U Spix_GetDmaMode(SPI_IND_E idx);

/*******************************************************************
** 函数名:     Spix_LeftofBuf
** 函数描述:   获取指定串口的发送缓冲区剩余空间
** 参数:       [in] idx : spi编号
** 返回:       剩余空间长度
********************************************************************/
INT32S Spix_LeftofBuf(SPI_IND_E idx);

/*******************************************************************
** 函数名:     Spix_ReadByte
** 函数描述:   SPIX读取单个字节
** 参数:       [in] idx : spi编号
** 返回:       剩余空间长度
********************************************************************/
INT32S Spix_ReadByte(SPI_IND_E idx);

/*******************************************************************
** 函数名:     Spix_RecvBufUsed
** 函数描述:   SPIX接收的大小
** 参数:       [in] idx : spi编号
** 返回:       接收大小
********************************************************************/
INT32U Spix_RecvBufUsed(SPI_IND_E idx);

/*******************************************************************
** 函数名:     Spix_RecvBufReset
** 函数描述:   复位接收缓存
** 参数:       [in] idx : spi编号
** 返回:       无
********************************************************************/
void Spix_RecvBufReset(SPI_IND_E idx);

/*******************************************************************
** 函数名:     Spix_SendByte
** 函数描述:   SPIX发送单个字节
** 参数:       [in] idx : spi编号
               [in] byte: 字节数据
** 返回:       无
********************************************************************/
BOOLEAN Spix_SendByte(SPI_IND_E idx, INT8U byte);

/*******************************************************************
** 函数名:     Spix_SendData
** 函数描述:   SPIX发送连续数据
** 参数:       [in] idx : spi编号
               [in] ptr:   数据指针
**             [in] tlen:  数据长度
** 返回:       发送结果
********************************************************************/
BOOLEAN Spix_SendData(SPI_IND_E idx, INT8U *ptr, INT32U tlen);

/*******************************************************************
** 函数名:     Spix_Open_Port
** 函数描述:   打开SPI端口
** 参数:       [in] spi_mode : 0为主机模式; 1为从机模式
               [in] dma_mode : dma/中断模式
               [in] bps      : 波特率
               [in] clock_mode : 时钟模式(0~3:mode0 ~ mode3)
** 返回:       TRUE ：成功   FALSE ：失败
********************************************************************/
BOOLEAN Spix_Open_Port(SPI_IND_E idx, INT8U spi_mode, INT8U dma_mode, INT16U bps, INT8U clock_mode);

/*******************************************************************
** 函数名:     Spix_Close_Port
** 函数描述:   关闭SPI端口
** 参数:       [in] idx : spi编号
** 返回:       TRUE ：成功   FALSE ：失败
********************************************************************/
BOOLEAN Spix_Close_Port(SPI_IND_E idx);

/*******************************************************************
** 函数名:     Spix_RegistHandler
** 函数描述:   注册SPI模块中断接收回调函数
** 参数:       [in] idx : spi编号
               [in] ReceivedDat：要接收到的数据
** 返回:       无
********************************************************************/
void Spix_RegistHandler(SPI_IND_E idx, INT8U (* handle) (INT8U ReceivedDat));

INT32U read_roundbuf(SPI_IND_E idx);

/*******************************************************************
** 函数名:     Spix_IsSendIle
** 函数描述:   发送是否在空闲状态
** 参数:       [in] idx : spi编号
** 返回:       TRUE : 空闲 FALSE: 非空闲状态
********************************************************************/
BOOLEAN Spix_IsSendIle(SPI_IND_E idx);

#endif

