/**************************************************************************************************
**                                                                                               **
**  文件名称:  dal_usart.h                                                                       **
**  版权所有:  CopyRight @ Xiamen Yaxon NetWork CO.LTD. 2012                                     **
**  创建信息:  2012-1-12 By clt: 创建本文件                                                      **
**  文件描述:  串口驱动接口函数                                                                  **
**  ===========================================================================================  **
**  修改信息:  单击此处添加....                                                                  **
**************************************************************************************************/
#ifndef __DAL_USART_H
#define __DAL_USART_H

#include "dal_include.h"
#include "roundbuf.h"

/*************************************************************************************************/
/*                           可用串口序号枚举                                                    */
/*************************************************************************************************/
typedef enum {
    USART_NO1 = 0x00,
    USART_NO2,
    USART_NO3,
    USART_NO4,
    USART_NO5,
    USART_MAX
} USART_INDEX_E;

/*************************************************************************************************/
/*                           串口波特率值枚举                                                    */
/*************************************************************************************************/
typedef enum {
    BAUD_200    = 200L,
    BAUD_1200   = 1200L,
    BAUD_2400   = 2400L,
    BAUD_4800   = 4800L,
    BAUD_9600   = 9600L,
    BAUD_10400  = 10400L,
    BAUD_19200  = 19200L,
    BAUD_38400  = 38400L,
    BAUD_57600  = 57600L,
    BAUD_115200 = 115200L,
    BAUD_230400 = 230400L,
    BAUD_460800 = 460800L,
    BAUD_921600 = 921600L,
    BAUD_MAXVAL
} BAUD_VALUE_E;

/*************************************************************************************************/
/*                           数据位枚举                                                          */
/*************************************************************************************************/
typedef enum {
    DATABITS_8 = USART_WL_8BIT,                         /* 8位 */
    DATABITS_9 = USART_WL_9BIT,                         /* 8位 */        
} USART_DATABITS_E;

/*************************************************************************************************/
/*                           停止位枚举                                                          */
/*************************************************************************************************/
typedef enum {
    STOPBITS_1   = USART_STB_1BIT,                          /* 1位 */
    STOPBITS_2   = USART_STB_2BIT                           /* 2位 */     
} USART_STOPBITS_E;

/*************************************************************************************************/
/*                           校验位枚举                                                      */
/*************************************************************************************************/
typedef enum {
    PARITY_NONE  = USART_PM_NONE,                            /* 不校验 */
    PARITY_ODD   = USART_PM_ODD,                           /* ODD奇校验 */
    PARITY_EVEN  = USART_PM_EVEN,                          /* EVEN偶校验 */
    PARITY_MARK  = 3,                                          /* mark校验 */
    PARITY_SPACE = 4                                           /* space校验 */
} USART_PARITY_E;

/*************************************************************************************************/
/*                           串口参数结构体                                                      */
/*************************************************************************************************/
typedef struct {
    BAUD_VALUE_E           baud;                                                /* 波特率 */
    USART_DATABITS_E       databits;                                            /* 数据位 */
    USART_STOPBITS_E       stopbits;                                            /* 停止位 */
    USART_PARITY_E         parity;                                              /* 校验位 */    
} USART_PARA_T;

/*************************************************************************************************/
/*                           串口发送状态枚举                                                    */
/*************************************************************************************************/
typedef enum {
    STATUS_DISABLE = 0x00,                                           /* 串口被禁用 */
    STATUS_INITING,                                                  /* 串口初始化 */
    STATUS_SENDING,                                                  /* 串口正忙 */
    STATUS_IDLENOW                                                   /* 串口空闲 */
} USART_SS_E;

/*************************************************************************************************/
/*                           串口发送结果枚举                                                    */
/*************************************************************************************************/
typedef enum {
    SEND_DATAERR = 0x00,                                             /* 数据错误 */
    SEND_DISABLE,                                                    /* 串口禁用 */
    SEND_BUSYNOW,                                                    /* 串口正忙 */
    SEND_TOOLONG,                                                    /* 数据过长 */
    SEND_NOERROR                                                     /* 发送成功 */
} USART_SR_E;

/*************************************************************************************************/
/*                           串口缓冲区初始化结构体                                              */
/*************************************************************************************************/
typedef struct {
    INT32U     rlen;                                                 /* RECV Buffer len */	
    INT32U     slen;                                                 /* SEND Buffer len */
    INT8U     *rbuf;                                                 /* Pointer to RECV Buffer */
    INT8U     *sbuf;                                                 /* Pointer to SEND Buffer */
} USART_BUF_T;


/*************************************************************************************************/
/*                           中断号枚举                                                          */
/*************************************************************************************************/
typedef enum {
    USART_ITPE    = USART_INT_FLAG_PERR,                          
    USART_ITTXE   = USART_INT_FLAG_TBE,                         
    USART_ITTC    = USART_INT_FLAG_TC,                         
    USART_ITRXNE  = USART_INT_FLAG_RBNE,                       
    USART_ITIDLE  = USART_INT_FLAG_IDLE,                        
    USART_ITLBD   = USART_INT_FLAG_LBD,                         
    USART_ITCTS   = USART_INT_FLAG_CTS,                        
    USART_ITORE   = USART_INT_FLAG_ERR_ORERR,                        
    USART_ITNE    = USART_INT_FLAG_ERR_NERR ,                       
    USART_ITFE    = USART_INT_FLAG_ERR_FERR ,                       
} USART_IT_E;



/*************************************************************************************************/
/*                           USART回调APP层索引枚举                                                */
/*************************************************************************************************/
typedef enum {
    LB_485_TORCV    = 0x00,                                                     /*485切换为接收状态 */
    LB_485_TOSEND   = 0x01,                                                     /* 485切换为发送状态 */
    LB_USART_MAX
}USART_LBINDEX_E;


/*******************************************************************
** 函数名:     USARTX_IOConfig
** 函数描述:   USARTX的IO口配置
** 参数:       [in] index: 串口号
** 返回:       无
********************************************************************/
void USARTX_IOConfig(USART_INDEX_E index);

/*******************************************************************
** 函数名:     USARTX_Initiate
** 函数描述:   初始化USARTX(此处也配置了DMA) - 初始化完后默认是禁用的
** 参数:       [in] index: 串口号
**             [in] usart: 串口参数
**             [in] buft:  串口缓冲区
** 返回:       无
**  备注    :  UART1~UART4有带DMA，UART5不带DMA，配置上有所差别(如果使用DMA发送情况下要注意)
********************************************************************/
void USARTX_Initiate(USART_INDEX_E index, USART_PARA_T *usart, USART_BUF_T *buft);

/*******************************************************************
** 函数名:     USARTX_Enable
** 函数描述:   启用USARTX
** 参数:       [in] index: 串口号
** 返回:       无
********************************************************************/
void USARTX_Enable(USART_INDEX_E index);

/*******************************************************************
** 函数名:     USARTX_Disable
** 函数描述:   停用USARTX
** 参数:       [in] index: 串口号
** 返回:       无
********************************************************************/
void USARTX_Disable(USART_INDEX_E index);

/*******************************************************************
** 函数名:     USARTX_LeftofBuf
** 函数描述:   获取指定串口的发送缓冲区剩余空间
** 参数:       [in] index: 串口号
** 返回:       剩余空间长度
********************************************************************/
INT32S USARTX_LeftofBuf(USART_INDEX_E index);

/*******************************************************************
** 函数名:     USARTX_ReadByte
** 函数描述:   USARTX读取单个字节
** 参数:       [in] index: 串口号
** 返回:       剩余空间长度
********************************************************************/
INT32S USARTX_ReadByte(USART_INDEX_E index);

/*******************************************************************
** 函数名:     USARTX_SendByte
** 函数描述:   USARTX发送单个字节
** 参数:       [in] index: 串口号
**             [in] byte: 字节数据
** 返回:       无
********************************************************************/
BOOLEAN USARTX_SendByte(USART_INDEX_E index, INT8U byte);

/*******************************************************************
** 函数名:     USARTX_SendData
** 函数描述:   USARTX发送连续数据
** 参数:       [in] index: 串口号
**             [in] ptr:   数据指针
**             [in] tlen:  数据长度
** 返回:       发送结果
********************************************************************/
BOOLEAN USARTX_SendData(USART_INDEX_E index, INT8U *ptr, INT32U tlen);

/*******************************************************************
** 函数名:     SetMarkOrSpace
** 函数描述:   设置为MARK或SPACE校验
** 参数:       [in] index:  串口号
**             [in] parity: 校验类型
** 返回:       无
********************************************************************/
void SetMarkOrSpace(USART_INDEX_E index,USART_PARITY_E parity);

/*******************************************************************
** 函数名:     Dal_UsartLBRepReg
** 函数描述:   Usart回调上报函数
** 参数:       [in] index:  串口号
**             [in] handle: 指向APP层的函数指针
** 返回:       无
********************************************************************/
void Dal_UsartLBRepReg(USART_LBINDEX_E index, void (* handle) (void));

/**************************************************************************************************
**  函数名称:  Setidledetectable
**  功能描述:   
**  输入参数:   
**  返回参数:  None
**************************************************************************************************/
void Setidledetectable(BOOLEAN statu);

#endif
/**************************** (C) COPYRIGHT 2012  XIAMEN YAXON.LTD **************END OF FILE******/

