/********************************************************************************
**
** 文件名:     dal_timer.h
** 版权所有:   (c) 2014-2020 厦门雅迅网络股份有限公司
** 文件描述:   系统定时器驱动接口函数
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/12/30 | JUMP   | 创建本模块
**
*********************************************************************************/
#ifndef __DRV_TIMER_H
#define __DRV_TIMER_H

#include "dal_include.h"

/*************************************************************************************************/
/*                           系统定时器枚举                                                      */
/*************************************************************************************************/
typedef enum {
    TIMER_NO_1,
    TIMER_NO_2,
    TIMER_NO_3,
    TIMER_NO_4,
    TIMER_NO_5,
    TIMER_NO_6,
    TIMER_NO_7,
} TIMER_NO_E;

/*******************************************************************
** 函数名:     TimerX_Func_Enable
** 函数描述:   定时器X功能使能
** 参数:       [in] index 定时器序号
** 返回:       无
********************************************************************/
void TimerX_Func_Enable(TIMER_NO_E index);

/*******************************************************************
** 函数名:     TimerX_IT_Enable
** 函数描述:   定时器X中断使能,如果要使用中断，则必须打开功能使能
** 参数:       [in] index 定时器序号
** 返回:       无
********************************************************************/
void TimerX_IT_Enable(TIMER_NO_E index);

/*******************************************************************
** 函数名:     TimerX_Disable
** 函数描述:   定时器X禁能
** 参数:       [in] index 定时器序号
** 返回:       无
********************************************************************/
void TimerX_Disable(TIMER_NO_E index);

/*******************************************************************
** 函数名:     TimerX_Initiate
** 函数描述:   定时器X初始化 - 设置成每1毫秒中断一次，系统时钟168M, 定时器时钟总线84M, 根据数据手册:
**             定时器的时钟频率为168M, Prescaler = 167, 则定时器的计数器时钟 168M / (167 + 1) = 1M
**             Period = 999 所以定时器计数到中断频率为 1M / (999 + 1) = 1K
** 参数:       [in] index 定时器序号
** 返回:       无
**  注意事项:  RCC_APB2PeriphClockCmd语句一定要置于其他初始化指令之前
********************************************************************/
void TimerX_Initiate(TIMER_NO_E index);

/*******************************************************************
** 函数名:     Get_TimerX_Counter
** 函数描述:   获取定时器x计数器的数值
** 参数:       [in] index 定时器序号
** 返回:       返回该定时器计数器的数值
********************************************************************/
INT16U Get_TimerX_Counter(TIMER_NO_E index);

#endif
/**************************** (C) COPYRIGHT 2010  XIAMEN YAXON.LTD **************END OF FILE******/
