/*******************************************************************************
**
** 文件名:     dal_gsen_drv.h
** 版权所有:   (c) 1998-2017 厦门雅迅网络股份有限公司
** 文件描述:   g-sensor、gyro驱动，提供加速度、角速度数据查询及参数标定等接口
**
*********************************************************************************
**                  修改历史记录
**===============================================================================
**| 日期              | 作者        |  修改记录
**===============================================================================
**| 2017/05/27 | 黄运峰    |  创建第一版本
********************************************************************************/
#ifndef DAL_GSEN_DRV_H
#define DAL_GSEN_DRV_H    1

#include "Dal_Include.h"

/*
*********************************************************************************
*                   数据类型及宏定义
*********************************************************************************
*/
// 定义G-SENSOR事件类型
typedef enum{
    GSEN_EVENT_NONE = 0,
    GSEN_EVENT_HIT,
    GSEN_EVENT_MOTION,
    GSEN_EVENT_MAX
}GSEN_EVENT_E;

// 坐标轴数据结构体类型
typedef struct {
    INT32S axis_x;
    INT32S axis_y;
    INT32S axis_z;
} AXIS_DATA_T;

// 加速度传感器三轴标定完成后回调函数指针，返回标定得到的三轴初始加速度值
typedef void (* GSEN_CALIB_CALBAK_PTR)(AXIS_DATA_T *val_accl, AXIS_DATA_T *val_gyro);

/*
*********************************************************************************
*                   对外接口声明
*********************************************************************************
*/
/********************************************************************************
** 函数名:     dal_gsen_EnableTemp
** 函数描述:   使能温度数据采集功能，默认初始化完是关闭
** 参数:       无
** 返回:       无
********************************************************************************/
BOOLEAN dal_gsen_EnableTemp(void);

/********************************************************************************
** 函数名:     dal_gsen_CalibStart
** 函数描述:   收到通知后进行ACCL的X/Y/Z轴的标定
** 参数:       标定完成回调函数，用以返回三轴标定值
** 返回:       无
********************************************************************************/
void dal_gsen_CalibStart(GSEN_CALIB_CALBAK_PTR calbak);

/********************************************************************************
**  函数名称:  dal_gsen_EnterLowPower
**  功能描述:  设置g-sensor模块进入低功耗模式(系统进入休眠模式前调用)
**  输入参数:  None
**  返回参数:  None
********************************************************************************/
void dal_gsen_EnterLowPower(void);

/********************************************************************************
**  函数名称:  dal_gsen_EnterSleep
**  功能描述:  设置g-sensor模块进入睡眠模式(系统进入运输模式前调用)
**  输入参数:  None
**  返回参数:  None
********************************************************************************/
void dal_gsen_EnterSleep(void);

/********************************************************************************
**  函数名称:  dal_gsen_SetHitPara
**  功能描述:  设置碰撞加速度阀值和三轴轴标定值
**  输入参数: [in] ths_val: 碰撞加速度阀值,单位mg
**            [in] calib:  三轴标定值
**  返回参数:  TRUE，设置成功；FALSE，设置失败
********************************************************************************/
BOOLEAN dal_gsen_SetHitPara(INT16U ths_val, AXIS_DATA_T *calib);

/********************************************************************************
**  函数名称:  dal_gsen_SetGyroPara
**  功能描述:  设置标定的角速度三轴偏移值
**  输入参数: [in] calib: 角速度三轴标定偏移值
**
**  返回参数:  TRUE，设置成功；FALSE，设置失败
********************************************************************************/
BOOLEAN dal_gsen_SetGyroPara(AXIS_DATA_T *calib);

/********************************************************************************
**  函数名称:  dal_gsen_GetWorkState
**  功能描述:  获取g-sensor工作状态
**  输入参数:  None
**  返回参数:  0 未运行  1 已运行
********************************************************************************/
INT8U dal_gsen_GetWorkState(void);

/********************************************************************************
**  函数名称:  dal_gsen_GetState
**  功能描述:  获取g-sensor设备工作状态
**  输入参数:  idx:传感器序号
**  返回参数:  TRUE:准备就绪    FALSE:未准备好
********************************************************************************/
BOOLEAN dal_gsen_GetState(INT8U idx);

/********************************************************************************
**  函数名称:  dal_gsen_ReadAcclData
**  功能描述:  获取g-sensor三轴加速度值，单位mg
**  输入参数:  [in] axis_val：用于返回三轴加速度值
**  返回参数:  TRUE，获取成功；FALSE，获取失败
********************************************************************************/
BOOLEAN dal_gsen_ReadAcclData(AXIS_DATA_T *axis_val);

/********************************************************************************
**  函数名称:  dal_gsen_ReadHitAcclData
**  功能描述:  获取碰撞中断时刻g-sensor三轴加速度值,单位mg
**  输入参数:  [in] axis_val[3],用于返回三轴加速度值
**  返回参数:  TRUE，获取成功；FALSE，获取失败
********************************************************************************/
BOOLEAN dal_gsen_ReadHitAcclData(AXIS_DATA_T *axis_val);

/********************************************************************************
**  函数名称:  dal_gsen_ReadGyroData
**  功能描述:  获取g-sensor三轴角速度值，单位1/1000 °/s
**  输入参数:  [in] axis_val：用于返回三轴角速度值
**  返回参数:  TRUE，获取成功；FALSE，获取失败
********************************************************************************/
BOOLEAN dal_gsen_ReadGyroData(AXIS_DATA_T *axis_val);

/********************************************************************************
**  函数名称:  dal_gsen_ReadTempData
**  功能描述:  获取温度传感器值
**  输入参数:  [in] rval：用于返回温度值，单位:1/10℃
**  返回参数:  TRUE，获取成功；FALSE，获取失败
********************************************************************************/
BOOLEAN dal_gsen_ReadTempData(INT16S *rval);

/********************************************************************************
**  函数名称:  dal_gsen_Init
**  功能描述:  初始化g-sensor模块
**  输入参数:  无
**  返回参数:  无
********************************************************************************/
void dal_gsen_Init(void);

/********************************************************************************
**  函数名称:  dal_gsen_GetDevInfor
**  功能描述:  获取g-sensor设备型号信息
**  输入参数:  无
**  返回参数:  设备型号信息字符串
********************************************************************************/
char *dal_gsen_GetDevInfor(void);

void GsenIntCalbakFunc(void); //PRIVATE_FUNC


/*****************************sd2058相关函数*********************************/
/*****************************************************************************
** 函数:   sd_ReadData
** 描述: 读多个字节
** 参数: noe
** 返回: TRUE成功 FALSE失败
*****************************************************************************/
BOOLEAN sd_ReadData(INT8U regaddr, INT8U *rbuf, INT8U rlen);

/*****************************************************************************
** 函数:   sd_ReadByte
** 描述: 读单个字节
** 参数: noe
** 返回: TRUE成功 FALSE失败
*****************************************************************************/
BOOLEAN sd_ReadByte(INT8U regaddr, INT8U *rbuf);

/*****************************************************************************
** 函数:   sd_WriteData
** 描述: 写多个字节
** 参数: noe
** 返回: TRUE成功 FALSE失败
*****************************************************************************/
BOOLEAN sd_WriteData(INT8U regaddr, INT8U* wbuf, INT8U wlen);

/*****************************************************************************
** 函数:   sd_WriteByte
** 描述: 写单个字节
** 参数: noe
** 返回: TRUE成功 FALSE失败
*****************************************************************************/
BOOLEAN sd_WriteByte(INT8U regaddr, INT8U wbuf);

//-------------------------------------------------------------------------------
#endif /* DAL_GSEN_DRV_H */
