/**************************************************************************************************
**                                                                                               **
**  文件名称:  dal_flash.h                                                                       **
**  版权所有:  CopyRight ⊙ Xiamen Yaxon NetWork CO.LTD. 2010                                    **
**  创建信息:  Lantu.Cai -- 2010年12月3日                                                        **
**  文件描述:  FLASH驱动函数接口头文件                                                           **
**  ===========================================================================================  **
**  修改信息:  单击此处添加....                                                                  **
**************************************************************************************************/
#ifndef _DRV_FLASH_H
#define _DRV_FLASH_H

/*******************************************************************
** 函数名:     Flash_Unlock
** 函数描述:   解锁FLASH擦除控制器
** 参数:       无
** 返回:       无
********************************************************************/
void Flash_Unlock(void);

/*******************************************************************
** 函数名:     Flash_Lock
** 函数描述:   锁定FLASH擦除控制器
** 参数:       无
** 返回:       无
********************************************************************/
void Flash_Lock(void);

/*******************************************************************
** 函数名:     Flash_ErasePage
** 函数描述:   擦除某页FLASH
** 参数:       [in] sector:  所要擦除的块，从0到最大
** 返回:       擦除成功返回TRUE，失败返回FLASH
********************************************************************/
BOOLEAN Flash_ErasePage(INT16U sector);

/*******************************************************************
** 函数名:     Flash_EraseAllPage
** 函数描述:   擦除整片FLASH
** 参数:       无
** 返回:       擦除成功返回TRUE，失败返回FLASH
********************************************************************/
BOOLEAN Flash_EraseAllPage(void);

/*******************************************************************
** 函数名:     Flash_WriteHalfword
** 函数描述:   写一个16位的数据到FLASH中,按字对齐
** 参数:       [in] addr     : 要写入的地址，必须字对齐
**             [in] halfword : 要写的数据
** 返回:       成功返回TRUE，失败返回FLASH
********************************************************************/
BOOLEAN Flash_WriteHalfword(INT32U addr, INT16U halfword);

/*******************************************************************
** 函数名:     Flash_WriteWord
** 函数描述:   写一个32位的数据到FLASH中,按字对齐
** 参数:       [in] addr     : 要写入的地址，必须字对齐
**             [in] word     : 要写的数据
** 返回:       成功返回TRUE，失败返回FLASH
********************************************************************/
BOOLEAN Flash_WriteWord(INT32U addr, INT32U word);

/*******************************************************************
** 函数名:     Flash_WriteData
** 函数描述:   写一串数据(8位)到FLASH中,按字对齐
** 参数:       [in] addr     : 要写入的地址，必须字对齐
**             [in] data     : 要写的数据
**             [in] datalen  : 要写的数据的个数，必须满足2的倍数
** 返回:       成功返回TRUE，失败返回FLASH
********************************************************************/
BOOLEAN Flash_WriteData(INT32U addr, INT8U *data, INT16U datalen);

/*******************************************************************
** 函数名:     Flash_CopyBlock
** 函数描述:   FLASH拷贝整个扇区
** 参数:       [in] addr     : 要写入的地址，必须字对齐
**             [in] data     : 要写的数据
**             [in] datalen  : 要写的数据的个数，必须满足2的倍数
** 返回:       成功返回TRUE，失败返回FLASH
********************************************************************/
BOOLEAN Flash_CopyBlock(INT32U saddr, INT32U daddr,INT16U datalen);

/*******************************************************************
** 函数名:     Flash_GetPage
** 函数描述:   获得地址对应的FLASH页码
** 参数:       [in] addr: 地址
** 返回:       地址对应的FLASH的页 
********************************************************************/
INT16U Flash_GetPage(INT32U addr);

/*******************************************************************
** 函数名:     GetFlashAbsAddr
** 函数描述:   获取绝对地址
** 参数:       [in] sector: 页数
**             [in] offset: 偏移地址
** 返回:       绝对地址
********************************************************************/
INT32U GetFlashAbsAddr(INT16U sector, INT32U offset) ;
 

#endif /*_DRV_FLASH_H */

/**************************** (C) COPYRIGHT 2010 XIAMEN YAXON.LTD ***************END OF FILE******/
