/********************************************************************************
**
** 文件名:     dal_rtc.h
** 版权所有:   (c) 2014-2020 厦门雅迅网络股份有限公司
** 文件描述:   实时时钟模块驱动层接口函数
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/12/30 | JUMP   | 创建本模块
**
*********************************************************************************/
#ifndef __DRV_RTC_H
#define __DRV_RTC_H


#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <math.h>

#include  "dal_include.h"
#include "yx_system.h"

extern INT8U const CWEEK[];
/*******************************************************************
** 函数名:     dal_rtc_init
** 函数描述:   实时时钟模块初始化
** 参数:       无
** 返回:       无
********************************************************************/
void dal_rtc_init(void);

/*******************************************************************
** 函数名:     dal_rtc_gettime
** 函数描述:   获取实时时钟时间
** 参数:       [OUT] ptr 时间输出地址
** 返回:       无
********************************************************************/
void dal_rtc_gettime(INT8U* temp, INT8U length);

/*******************************************************************
** 函数名:     dal_rtc_settime
** 函数描述:   设置实时时钟时间
** 参数:       [OUT] ptr 时间数据指针
** 返回:       无
********************************************************************/
void dal_rtc_settime(INT8U* nowtime);

/*******************************************************************
** 函数名:     dal_rtc_set_current_time
** 函数描述:   设置实时时钟时间为当前系统时钟
** 参数:       无
** 返回:       无
********************************************************************/
void dal_rtc_set_current_time(void);

/*******************************************************************
** 函数名:     dal_rtc_reinit
** 函数描述:   实时时钟模块重新初始化
** 参数:       无
** 返回:       无
********************************************************************/
void dal_rtc_reinit(void);

/*******************************************************************
** 函数名:     dal_rtc_getinitsta
** 函数描述:   获取RTC初始化状态
** 参数:       无
** 返回:       TRUE-RTC正常；FALSE-RTC初始化失败
********************************************************************/
BOOLEAN dal_rtc_getinitsta(void);

#endif

/**************************** (C) COPYRIGHT 2010  XIAMEN YAXON.LTD **************END OF FILE******/


