/********************************************************************************
**
** 文件名:     dal_exti.h
** 版权所有:   (c) 2014-2020 厦门雅迅网络股份有限公司
** 文件描述:   外部中断接口函数头文件
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/12/29 | JUMP   | 创建本模块
**
*********************************************************************************/
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef  _DRV_EXTI_H
#define  _DRV_EXTI_H
#include  "dal_include.h"

typedef void (*CALLBACK_EXTI)(void) __irq;
/*************************************************************************************************/
/*                           定义管脚端口枚举                                                    */
/*************************************************************************************************/
  typedef enum {
   GRP_A,
   GRP_B,
   GRP_C,
   GRP_D,
   GRP_E,
   MAX_GRP
}PORT_GRP_E;
/*************************************************************************************************/
/*                           定义管脚号枚举                                                      */
/*************************************************************************************************/
typedef enum {
   PIN_0,
   PIN_1,
   PIN_2,
   PIN_3,
   PIN_4,
   PIN_5,
   PIN_6,
   PIN_7,
   PIN_8,
   PIN_9,
   PIN_10,
   PIN_11,
   PIN_12,
   PIN_13,
   PIN_14,
   PIN_15,
   MAX_PIN
}PORT_IDX_E;
/*************************************************************************************************/
/*                           定义触发方式枚举                                                    */
/*************************************************************************************************/

typedef enum {
   TRIG_RAISING,
   TRIG_FAILING,
   TRIG_RAISING_FAILING,
   MAX_TRIG_MODE
}TRIG_MODE_E;
 
/*******************************************************************
** 函数名:     CreateExtIntLine
** 函数描述:   创建外部中断
** 参数:       [in] grp:       管脚端口
**             [in] pin:       管脚号
**             [in] trig_mode: 触发方式
**             [in] callback:  中断处理函数
** 返回:       无
********************************************************************/
void CreateExtIntLine(INT8U grp, INT8U pin,INT8U trig_mode, CALLBACK_EXTI callback);

/*******************************************************************
** 函数名:     SetExtIntLine
** 函数描述:   设置外部中断
** 参数:       [in] grp:       管脚端口
**             [in] pin:       管脚号
**             [in] trig_mode: 触发方式
** 返回:       无
********************************************************************/
void SetExtIntLine(PORT_GRP_E grp, PORT_IDX_E pin, TRIG_MODE_E trig_mode);

/*******************************************************************
** 函数名:     ClearExtIntLine
** 函数描述:   清除外部中断
** 参数:       [in] grp:       管脚端口
**             [in] pin:       管脚号
**             [in] trig_mode: 触发方式
** 返回:       无
********************************************************************/
void ClearExtIntLine(PORT_GRP_E grp, PORT_IDX_E pin, TRIG_MODE_E trig_mode);

/*******************************************************************
** 函数名:     GetExtiItStatus
** 函数描述:   获取外部中断状态
** 参数:       [in] grp:       管脚端口
**             [in] pin:       管脚号
** 返回:       无
********************************************************************/
BOOLEAN GetExtiItStatus(INT8U grp, INT8U pin);

/*******************************************************************
** 函数名:     ClrExtiITPendingBit
** 函数描述:   清除寄存器中的外部中断置位
** 参数:       [in] grp:       管脚端口
**             [in] pin:       管脚号
** 返回:       无
********************************************************************/
void ClrExtiITPendingBit(INT8U grp, INT8U pin);

/*******************************************************************
** 函数名:     GPIO_ExtiLineConfiguartion
** 函数描述:   链接外部中断到对应管脚
** 参数:       [in] grp: 管脚端口
**             [in] pin: 管脚号
** 返回:       无
********************************************************************/
void GPIO_ExtiLineConfiguartion(PORT_GRP_E grp, PORT_IDX_E pin);

/*******************************************************************
** 函数名:     EXIT_Configuartion
** 函数描述:   配置外部中断及触发方式
** 参数:       [in] grp:       管脚端口
**             [in] pin:       管脚号
**             [in] trig_mode: 触发方式
**             [in] enable   : 使能line
** 返回:       无
********************************************************************/
INT8U EXIT_Configuartion(PORT_GRP_E grp, PORT_IDX_E pin, TRIG_MODE_E trig_mode, BOOLEAN enable);


#endif /* _DRV_EXTI_H */
/************************ (C) COPYRIGHT 2010 XIAMEN YAXON.LTD *******************END OF FILE******/
