/********************************************************************************
**
** 文件名:     roundbuf.c
** 版权所有:   (c) 2014-2020 厦门雅迅网络股份有限公司
** 文件描述:   环形缓冲区管理模块
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2014/08/21 | 张鹏   |  创建该文件
**
*********************************************************************************/
#include "dal_include.h"
#include "roundbuf.h"


/*************************************************************************************************
**  函数名称:  InitRoundBuf
**  功能描述:  环形缓冲区初始化
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
void InitRoundBuf(ROUNDBUF_T *round, INT8U *mem, INT32U memsize, ASMRULE_T *rule)
{
    round->bufsize = memsize;
    round->used = 0;
    round->bptr = mem;
    round->eptr = mem + memsize;
    round->wptr = round->rptr = round->bptr;
    round->rule = rule;
}

/**************************************************************************************************
**  函数名称:  ResetRoundBuf
**  功能描述:  环形缓冲区重设
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
void ResetRoundBuf(ROUNDBUF_T *round)
{
    ENTER_CRITICAL();
    round->used = 0;
    round->rptr = round->wptr = round->bptr;
    EXIT_CRITICAL();
}

/**************************************************************************************************
**  函数名称:  RoundBufStartPos
**  功能描述:  获取缓冲区起始指针
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
INT8U *RoundBufStartPos(ROUNDBUF_T *round)
{
    return round->bptr;
}

/**************************************************************************************************
**  函数名称:  WriteRoundBuf
**  功能描述:  缓冲区写入单个字节数据
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
BOOLEAN WriteRoundBuf(ROUNDBUF_T *round, INT8U data)
{
    if (PNULL == round) return false;
    if (round->used >= round->bufsize) {
        return false;
    }
    ENTER_CRITICAL();
    *round->wptr++ = data;
    if (round->wptr >= round->eptr) {
        round->wptr = round->bptr;
    }
    round->used++;
    EXIT_CRITICAL();
     
    return true;
}

/**************************************************************************************************
**  函数名称:  ReadRoundBuf
**  功能描述:  缓冲区读取单个字节数据
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
INT32S ReadRoundBuf(ROUNDBUF_T *round)
{
    INT32S ret;
    
    if (round->used == 0) return -1;
    ENTER_CRITICAL();
    ret = *round->rptr++;
    if (round->rptr >= round->eptr) {
        round->rptr = round->bptr;
    }
    if (round->used == 0) {                                                    /* 出现异常错误，复位roundbuf */
        round->rptr = round->wptr = round->bptr;
        EXIT_CRITICAL();
        return -1;
    } else {
        round->used--;
    }
    EXIT_CRITICAL();
     
    return ret;
}

/**************************************************************************************************
**  函数名称:  ReadRoundBufNoMVPtr
**  功能描述:  读取缓冲区内容但是不移动数据指针
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
INT32S ReadRoundBufNoMVPtr(ROUNDBUF_T *round)
{
    if (round->used == 0) return -1;
    else return *round->rptr; 
}

/**************************************************************************************************
**  函数名称:  LeftOfRoundBuf
**  功能描述:  获取缓冲区剩余空间
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
INT32U LeftOfRoundBuf(ROUNDBUF_T *round)
{
    return (round->bufsize - round->used);
}

/**************************************************************************************************
**  函数名称:  UsedOfRoundBuf
**  功能描述:  获取缓冲区已用空间
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
INT32U UsedOfRoundBuf(ROUNDBUF_T *round)
{
    return round->used;
}

/**************************************************************************************************
**  函数名称:  WriteBlockRoundBuf
**  功能描述:  缓冲区写入连续数据
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
BOOLEAN WriteBlockRoundBuf(ROUNDBUF_T *round, INT8U *bptr, INT32U blksize)
{
    if (blksize > LeftOfRoundBuf(round)) {
        return false;
    }
     
    for (; blksize > 0; blksize--) {
        *round->wptr++ = *bptr++;
        if (round->wptr >= round->eptr) round->wptr = round->bptr;
        ENTER_CRITICAL();
        round->used++;
        EXIT_CRITICAL();
    }
    
    return true;
}



