/**************************************************************************************************
**                                                                                               **
**  文件名称:  Stream.C                                                                          **
**  版权所有:  CopyRight ⊙ Xiamen Yaxon NetWork CO.LTD. 2010                                    **
**  创建信息:  LEON -- 2010年12月1日                                                             **
**  文件描述:  数据流管理模块                                                                    **
**  ===========================================================================================  **
**  修改信息:  单击此处添加....                                                                  **
**************************************************************************************************/
#include "stream.h"
#include "tools.h"

/**************************************************************************************************
**  函数名称:  Strm_Init
**  功能描述:  数据流初始化
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
BOOLEAN Strm_Init(STREAM_T *Sp, void *Bp, INT32U MaxLen)
{
    if (Sp == 0) return false;
    
    Sp->Len      = 0;                            /* length have been read or writed of stream */
    Sp->MaxLen   = MaxLen;                       /* max stream length */
    Sp->CurPtr   = Bp;                           /* currently read & writer address of stream */
    Sp->StartPtr = Bp;                           /* stream begin address */
    return true;
}

/**************************************************************************************************
**  函数名称:  Strm_GetLeaveLen
**  功能描述:  获取数据流剩余的长度
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
INT32U Strm_GetLeaveLen(STREAM_T *Sp)
{
    if (Sp->MaxLen >= Sp->Len) {
        return (Sp->MaxLen - Sp->Len);
    } else {
        return 0;
    }
}

/**************************************************************************************************
**  函数名称:  Strm_GetLen
**  功能描述:  获取数据流的长度
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
INT32U Strm_GetLen(STREAM_T *Sp)
{
    return (Sp->Len);
}

/**************************************************************************************************
**  函数名称:  Strm_GetCurPtr
**  功能描述:  获取数据流当前指针位置
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
void *Strm_GetCurPtr(STREAM_T *Sp)
{
    return (Sp->CurPtr);
}

/**************************************************************************************************
**  函数名称:  Strm_GetStartPtr
**  功能描述:  获取数据流起始指针位置
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
void *Strm_GetStartPtr(STREAM_T *Sp)
{
    return (Sp->StartPtr);
}

/**************************************************************************************************
**  函数名称:  Strm_MovPtr
**  功能描述:  移动数据流指针
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
BOOLEAN Strm_MovPtr(STREAM_T *Sp, INT32U Len)
{
    if (Sp != 0) {
        if ((Sp->Len + Len) <= Sp->MaxLen) {
            Sp->Len    += Len;
            Sp->CurPtr += Len;
            return true;
        } else {
            return false;
        }
    } else {
        return false;
    }
}

/**************************************************************************************************
**  函数名称:  Strm_WriteBYTE
**  功能描述:  写入单个字节数据
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
BOOLEAN Strm_WriteBYTE(STREAM_T *Sp, INT8U writebyte)
{
    if (Sp != 0){
        if (Sp->Len < Sp->MaxLen) {
            *Sp->CurPtr = writebyte;
            Sp->CurPtr += 1;
            Sp->Len++;
            return true;
        } else {
            return false;
        }
    } else {
        return false;
    }
}

/**************************************************************************************************
**  函数名称:  Strm_WriteHEX
**  功能描述:  写入16进制数据
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
BOOLEAN Strm_WriteHEX(STREAM_T *Sp, INT8U writebyte)
{
    if (Sp != 0) {
        if ((Sp->Len + 3) <= Sp->MaxLen) {
            Strm_WriteBYTE(Sp, HexToChar((INT8U)(writebyte >> 4)));
            Strm_WriteBYTE(Sp, HexToChar(writebyte));
            Strm_WriteBYTE(Sp, ' ');
            return true;
        } else {
            return false;
        }
    } else {
        return false;
    }
}

/**************************************************************************************************
**  函数名称:  Strm_WriteWORD
**  功能描述:  写入字数据
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
BOOLEAN Strm_WriteWORD(STREAM_T *Sp, INT16U writeword)
{
    if (Sp != 0) {
        if ((Sp->Len + 2) <= Sp->MaxLen) {
            Strm_WriteBYTE(Sp, (INT8U)(writeword >> 8));
            Strm_WriteBYTE(Sp, (INT8U)(writeword & 0xff));
            return true;
        } else {
            return false;
        }
    } else {
        return false;
    }
}

/**************************************************************************************************
**  函数名称:  Strm_WriteLONG
**  功能描述:  写入字数据
**  输入参数:
**  返回参数:
**************************************************************************************************/
BOOLEAN Strm_WriteLONG(STREAM_T *Sp, INT32U writelong)
{
    Strm_WriteWORD(Sp, writelong >> 16);
    Strm_WriteWORD(Sp, writelong);
    return true;
}

/**************************************************************************************************
**  函数名称:  Strm_WriteLF
**  功能描述:  写入回车符
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
BOOLEAN Strm_WriteLF(STREAM_T *Sp)
{
    if (Sp != 0) {
        if ((Sp->Len + 2) <= Sp->MaxLen) {
            Strm_WriteBYTE(Sp, '\r');
            Strm_WriteBYTE(Sp, '\n');
            return true;
        } else {
            return false;
        }
    } else {
        return false;
    }
}

/**************************************************************************************************
**  函数名称:  Strm_WriteSTR
**  功能描述:  写入连续字符串 - 不能长于5K字节
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
BOOLEAN Strm_WriteSTR(STREAM_T *Sp, char *Ptr)
{
    INT16U ct;

    ct = 0;
    while (*Ptr)
    {
        if (!Strm_WriteBYTE(Sp, *Ptr++)) {
            return false;
        }
        if (++ct > (5*1024)) {
            return false;
        }
    }
    return true;
}

/**************************************************************************************************
**  函数名称:  Strm_WriteDATA
**  功能描述:  写入指定长度的数据
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
BOOLEAN Strm_WriteDATA(STREAM_T *Sp, INT8U *Ptr, INT16U Len)
{
    while (Len--)
    {
        if (!Strm_WriteBYTE(Sp, *Ptr++)) {
            return false;
        }
    }
    return true;
}

/**************************************************************************************************
**  函数名称:  Strm_ReadBYTE
**  功能描述:  读取字节数据
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
INT8U Strm_ReadBYTE(STREAM_T *Sp)
{
    INT8U ret;

    if (Sp->Len >= Sp->MaxLen) {
        return 0;
    }
    
    Sp->Len++;
    ret = *Sp->CurPtr;
    Sp->CurPtr += 1;
    return ret;
}

/**************************************************************************************************
**  函数名称:  Strm_ReadWORD
**  功能描述:  读取字数据
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
INT16U Strm_ReadWORD(STREAM_T *Sp)
{
    INT16U tempw;
    
    tempw   = Strm_ReadBYTE(Sp);
    tempw <<= 8;
    tempw  |= Strm_ReadBYTE(Sp);
    return tempw;
}

/**************************************************************************************************
**  函数名称:  Strm_ReadDATA
**  功能描述:  读取连续数据
**  输入参数:  
**  返回参数:  
**************************************************************************************************/
void Strm_ReadDATA(STREAM_T *Sp, INT8U *Ptr, INT16U Len)
{
    while (Len--)
    {
        *Ptr++ = Strm_ReadBYTE(Sp);
    }
}

