/********************************************************************************
**
** 文件名:     os_diagnose.c
** 版权所有:   (c) 1998-2017 厦门雅迅网络股份有限公司
** 文件描述:   实现虚拟内核错误诊断管理功能
** 创建人：        陈从华
*********************************************************************************
**                  修改历史记录
**===============================================================================
**| 日期              | 作者        |  修改记录
**===============================================================================
**| 2017/05/15 | 黄运峰    |  移植、修改、规范化
********************************************************************************/
#ifndef OS_DIAGNOSE_H
#define OS_DIAGNOSE_H       1

#include "yx_includes.h"
#include "yx_errcode.h"
#include "port_plat.h"
/*
*********************************************************************************
*                   数据类型及宏定义
*********************************************************************************
*/
/********************************************************************************
*                   定义模块配置参数及宏
********************************************************************************/
#define MAX_RESET_INFORM     20
#define MAX_DIAG             80

#ifndef RETURN_VOID
#define RETURN_VOID
#endif

#ifndef RETURN_TRUE
#define RETURN_TRUE          true
#endif

#ifndef RETURN_FALSE
#define RETURN_FALSE         false
#endif
/********************************************************************************
*                   定义断言接口宏
********************************************************************************/
#define OS_ASSERT(EXPRESSION, RET_VAL)                \
do {                                                            \
    if (!(EXPRESSION)) {                                        \
        OS_Reset(RESET_ABNORMAL, __FILE__, __LINE__, 0xffffffff); \
        PORT_Assert(#EXPRESSION,  __FILE__, __LINE__);          \
        return RET_VAL;                                         \
    }                                                           \
} while(0)

/********************************************************************************
*                   定义复位接口宏
********************************************************************************/
#define OS_RESET(TYPE) OS_Reset(TYPE, __FILE__, __LINE__, 0xffffffff)
#if 0
/********************************************************************************
*                   定义复位类型
********************************************************************************/
typedef enum {
    RESET_ABNORMAL = 1,      /* 出错异常复位，复位前会回调注册进来的复位通知函数 */
    RESET_INITIATIVE,        /* 主动复位，复位前会回调注册进来的复位通知函数 */
    RESET_DIRECT,            /* 直接复位，复位前不回调注册进来的复位通知函数 */
    RESET_MAX
} RESET_E;
#endif
/********************************************************************************
*                   定义复位回调接口的优先级
********************************************************************************/
typedef enum {
    RESET_HDL_PRIO_LOW,
    RESET_HDL_PRIO_HIGH
} RESET_HDL;
/*
*********************************************************************************
*                   对外接口声明
*********************************************************************************
*/
/********************************************************************************
** 函数名:     OS_InitDiag
** 函数描述:   模块初始化函数
** 参数:       无
** 返回:       无
********************************************************************************/
void OS_InitDiag(void);

/********************************************************************************
** 函数名:     OS_RegResetHooker
** 函数描述:   复位注册接口,处理复位前的紧急事件,如参数保存等
** 参数:       [in]: prior,待处理事件的优先级
**			   [in]: fp,   回调函数
** 返回:       成功返回true，失败返回false
********************************************************************************/
BOOLEAN OS_RegResetHooker(INT8U prior, void (*fp)(INT8U resettype, INT8U *filename, INT32U line, INT32U errid));

/********************************************************************************
** 函数名:     OS_Reset
** 函数描述:   复位
** 参数:       [in] rsttype：  复位类型
**             [in] pfilename：文件名
**             [in] line：     出错行号
**             [in] errid：    错误ID
** 返回:       无
********************************************************************************/
void OS_Reset(INT8U rsttype, char *pfilename, INT32U line, INT32U errid);

/********************************************************************************
** 函数名:     OS_DiagEntry
** 函数描述:   诊断模块的入口函数
** 参数:       无
** 返回:       无
********************************************************************************/
void OS_DiagEntry(void);

/********************************************************************************
** 函数名:     OS_InstallDiag
** 函数描述:   安装一个诊断函数
** 参数:       [in]  diagproc: 待安装的诊断函数
** 返回:       成功返回true，失败返回false
********************************************************************************/
BOOLEAN OS_InstallDiag(void (*diagproc)(void));

//-------------------------------------------------------------------------------
#endif /* OS_MSGMAN_H */
