/*
********************************************************************************
** 文件名:     yx_can_man.h
** 版权所有:   (c) 2017 厦门雅迅网络股份有限公司
** 文件描述:   can业务逻辑及协议处理
** 创建人：        谢金成，2017.5.18
********************************************************************************
*/
#ifndef H_YX_CAN_MAN
#define H_YX_CAN_MAN

#include"yx_includes.h"
#include"port_can.h"

#ifdef __cplusplus
extern "C"
{
#endif 

/******************************************************************************/
/*                              工作模式                                                                                                                                               */
/******************************************************************************/

/******************************************************************************/
/*                             CAN属性结构体                                                                                                                                    */
/******************************************************************************/
typedef struct {
    BOOLEAN         onoff;                               /* 功能开关 */
    APPCAN_BAUD_E   baud;                                /* 波特率 */
    INT8U           frameformat;                         /* 帧格式 */
    CAN_WORKMODE_E  mode;                                /* 工作模式 */
} CAN_PARA_T;

typedef struct {
    INT32U      id;                                      /* 滤波的ID */
    INT32U      screeid;                                 /* 屏蔽ID*/
    BOOLEAN     isused;                                  /* ID是否被配置 */
    INT8U       mode;                                    /* 存储模式 */
    INT8U       stores;                                  /* 所需存储的总条数 */
    INT8U       storecnt;                                /* 已经收到的条数 */
    INT8U       storeadd;                                /* 存储的位置 */
    INT8U       len;                                     /* 数据长度 */
    INT8U       storebuf[8];                             /* 存储的缓冲区,存储最新的一包 */
} IDPARA_T;

typedef struct {
    INT8U         rxobjused;                             /* 存储使用了多少个接收对象个数 */
    INT8U         recvcnt[MAX_CANIDS + 1];               /* 接收的数据包计数流水号 ，最后一个元素存无滤波时的流水号*/
    INT8U         format[MAX_CANIDS + 1];                /* 帧格式:扩展帧或标准帧 */
    INT8U         type[MAX_CANIDS + 1];                  /* 帧类型:数据帧和远程帧*/
    IDPARA_T      idcbt[MAX_CANIDS];                     /* ID参数属性 */
} AAPCAN_MSG_T;

typedef enum {
    ID_CLRALL   = 0x01,                                  /* 清空重填 */
    ID_ADD      = 0x02,                                  /* 追加补充 */
    ID_DEL      = 0x03,                                  /* 删除制定 */
    ID_REPLACE  = 0x04,                                  /* 替换指定 */
    ID_NOFILTER = 0x05,                                  /* 无滤波 */
} IDSTROE_ATTRIB_E;

/******************************************************************************/
/*                           数据包覆盖模式枚举                                                                                                                                  */
/******************************************************************************/


typedef enum {
    CAN_SEND_NOMAL  = 0x00,
    CAN_SEND_PERIOD = 0x01,
    CAN_SEND_STOP   = 0x02,
    CAN_SEND_THREE  = 0x03,     // 周期发送三帧
} CAN_SEND_TYPE_E;

/******************************************************************************/
/*                           定义多包传输对应参数数                                                                                                                          */
/******************************************************************************/
typedef struct {
    BOOLEAN packet_com;                                     /* 标志是否开始多包传输 */
    INT8U  *packet_buf;                                     /* 多包传输缓存 */
    INT8U   packet_index;                                   /* 多包传输的包序号 */
    INT8U   packet_total;                                   /* 多包传输的总包数 */
    INT16U   packet_tmrcnt;                                  /* 超时计数器 */
    INT16U  packet_totallen;                                /* 多包传输的总长度 */
    INT32U  packet_id;                                      /* 多包传输的参数组号 */
}PACKET_PARA_T;

typedef struct {
    INT8U   *packet_buf;
    BOOLEAN packet_com;                                         /* 标志是否开始多包传输 */

    BOOLEAN sendcontinue;                                       /* 是否处于连续包发送过程中 */
    INT8U   periods;                                            /* 接收端要求的多包之间的发送间隔 */
    INT8U   tmrcnt;                                             /* 发送间隔内时间计数器 */

    INT8U   blocksize;                                          /* 块大小 */
    INT8U   cf_cnt;                                             /* 块内CF帧计数器 */

    INT8U   sendpacket;                                         /* CF帧包序号 */

    INT8U   channel;
    INT16U  packet_tmrcnt;                                      /* 超时计数器 */

    INT16U  sendlen;                                            /* 已发长度 */
    INT16U  packet_totallen;                                    /* 数据长度 */
    INT32U  sendid;
    INT32U  recvid;
    INT8U   prot_type;
} MULTIPACKET_SEND_T;

/**************************************************************************************************
**  函数名称:  CAN_TxData
**  功能描述:  CAN发送数据接口函数
**  输入参数:  *data 指向数据区域指针 排列 ID len 数据
**  返回参数:  None
**************************************************************************************************/
BOOLEAN CAN_TxData(INT8U *data, BOOLEAN wait, INT8U channel);
/**************************************************************************************************
**  函数名称:  GetOilMsg_State
**  功能描述:  获取油耗报文ID：0x18FEE900状态
**  输入参数:  无
**  返回参数:  FALSE:收到该ID，TRUE:没收到该ID
**************************************************************************************************/
BOOLEAN GetOilMsg_State(void);
/**************************************************************************************************
**  函数名称:  ResetOilMsg_State
**  功能描述:  重置油耗报文ID：0x18FEE900状态
**  输入参数:  无
**  返回参数:  无
**************************************************************************************************/
void ResetOilMsg_State(void);

/*******************************************************************************
**  函数名称:  GetIDIsUsed
**  功能描述:  获取ID是否被使用
**  输入参数:  idcnts 序号
**  返回参数:  TRUE  or FALSE
*******************************************************************************/
BOOLEAN GetIDIsUsed(INT8U idcnts, INT8U channel);

/*******************************************************************************
**  函数名称:  SetIDPara
**  功能描述:  设置滤波ID属性参数
**  输入参数:  idcnts 序号
               channel 通道号
**  返回参数:  指向ID属性结构体的地址
*******************************************************************************/
void SetIDPara(IDPARA_T *idset, INT8U idcnts, INT8U channel);
/*******************************************************************************
 ** 函数名:    YX_CAN_SoftStatus
 ** 函数描述:   获取CAN软件的工作状态
 ** 参数:       无
 ** 返回:       无
 ******************************************************************************/
INT8U YX_CAN_SoftStatus(void);

/*******************************************************************************
 ** 函数名:    YX_CAN_Init
 ** 函数描述:   CAN通讯驱动模块初始化
 ** 参数:       无
 ** 返回:       无
 ******************************************************************************/
void YX_CAN_Init(void);

BOOLEAN SetCANMsg_Period(INT32U id, INT8U *ptr, INT16U period, INT8U channel);
BOOLEAN StopCANMsg_Period(INT32U id, INT8U channel);

/*******************************************************************
**  函数名称:  Can_GetRxStat
**  功能描述:  获取can通信状态
**  输入参数:
**  返回参数:
*******************************************************************/
INT8U Can_GetRxStat(void);

/*******************************************************************
** 函数名:     Can_TxMsg
** 函数描述:   发送CAN 报文成功
** 参数:       无
** 返回:       无
********************************************************************/
void Can_TxMsg(INT8U channel);
/*****************************************************************************
**  函数名:  YX_MMI_UDS_CanSendMul
**  函数描述: uds发送多帧数据
**  参数:    [in] data :
**           [in] len  :
**  返回:    FALSE:执行失败 TRUE:执行成功
*****************************************************************************/
BOOLEAN YX_MMI_UDS_CanSendMul(INT8U com,INT8U* data, INT16U len);

#ifdef __cplusplus
}
#endif

#endif

