/******************************************************************************
**
** Filename:     yx_debug.h
** Copyright:    
** Description:  该模块主要实现调试信息数据输出
**
-------------------------------------------------------------------------------
**             Revision history
**-----------------------------------------------------------------------------
**| 2014/03/09 | 叶德焰 |  创建文件
*******************************************************************************/
#ifndef YX_DEBUG_H
#define YX_DEBUG_H

#include "st_uart_drv.h"
/*
********************************************************************************
* define config parameters
********************************************************************************
*/

#define DEBUG_UART_WriteBlock     ST_UART_WriteBlock
#define DEBUG_UART_SendChar       ST_UART_WriteCharWait


/*
********************************************************************************
* define struct
********************************************************************************
*/

//#if EN_DEBUG > 0
/*-------------------------------------------------------------------
** 函数名称:   printf_com
** 函数描述:   通用打印函数，与printf类似
** 参数:       [in]  fmt: 打印参数
** 返回:       成功返回true,失败返回false
-------------------------------------------------------------------*/
BOOLEAN printf_com(const char *fmt, ...);

/*-------------------------------------------------------------------
** 函数名称:   printf_hex
** 函数描述:   将缓冲区中的数据转换成可见字符输出
** 参数:       [in]  ptr: 数据指针
**             [in]  len: 数据长度
** 返回:       成功返回true,失败返回false
-------------------------------------------------------------------*/
BOOLEAN printf_hex(INT8U *ptr, INT16U len);

/*-------------------------------------------------------------------
** 函数名称:   printf_raw
** 函数描述:   将原始数据直接通过串口输出
** 参数:       [in]  ptr: 数据指针
**             [in]  len: 数据长度
** 返回:       成功返回true,失败返回false
-------------------------------------------------------------------*/
BOOLEAN printf_raw(INT8U *ptr, INT16U len);

/*-------------------------------------------------------------------
** 函数名称:   printf_irq
** 函数描述:   中断打印接口,将原始数据直接通过串口输出
** 参数:       [in]  ptr: 数据指针
**             [in]  len: 数据长度
** 返回:       成功返回true,失败返回false
-------------------------------------------------------------------*/
BOOLEAN printf_irq(INT8U *ptr, INT16U len);


//#endif
#endif

